#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlterationOptionsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AlterationOptionsWidget.AlterationOptionsWidget_C
// 0x0080 (0x0360 - 0x02E0)
class UAlterationOptionsWidget_C final : public UFortAlterationOptionsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAlterationOption_C*                    AlterationOption;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlterationOption_C*                    AlterationOption_0;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlterationOption_C*                    AlterationOption_1;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlterationOption_C*                    AlterationOption_2;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoAlterationsText;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OptionsSwitcher;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OptionsVbox;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ReplacementsBorder;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ReplacementsVBox;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Upgrades;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          UpgradesBorder;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UpgradesVBox;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemWindow_C*                          ItemInfoWindow;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AlterationOptionsWidget(int32 EntryPoint);
	void OnOptionSelected(class UCommonButton* SelectedOption, bool Selected);
	void Destruct();
	void OnGenerateOption(EFortAlterationOptionType OptionType, class UFortAlterationOption* OptionWidget);
	void OnItemChanged(bool bIntroAlterations);
	void ClearOptionsAndInitialize(bool bIntroAlteration);
	void AddAlterationOptionWidget(EFortAlterationOptionType OptionType, class UFortAlterationOption* OptionWidget);
	void DoAnyAlterationsExist(bool* OptionsExist);
	bool ShouldShowNoOptions();
	void SetScrollWidget();
	void ClearAndUnbindOptions();
	void UnbindChildren(class UPanelWidget* Panel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlterationOptionsWidget_C">();
	}
	static class UAlterationOptionsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlterationOptionsWidget_C>();
	}
};
static_assert(alignof(UAlterationOptionsWidget_C) == 0x000008, "Wrong alignment on UAlterationOptionsWidget_C");
static_assert(sizeof(UAlterationOptionsWidget_C) == 0x000360, "Wrong size on UAlterationOptionsWidget_C");
static_assert(offsetof(UAlterationOptionsWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UAlterationOptionsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, AlterationOption) == 0x0002E8, "Member 'UAlterationOptionsWidget_C::AlterationOption' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, AlterationOption_0) == 0x0002F0, "Member 'UAlterationOptionsWidget_C::AlterationOption_0' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, AlterationOption_1) == 0x0002F8, "Member 'UAlterationOptionsWidget_C::AlterationOption_1' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, AlterationOption_2) == 0x000300, "Member 'UAlterationOptionsWidget_C::AlterationOption_2' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, CommonTextBlock_1) == 0x000308, "Member 'UAlterationOptionsWidget_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, NoAlterationsText) == 0x000310, "Member 'UAlterationOptionsWidget_C::NoAlterationsText' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, OptionsSwitcher) == 0x000318, "Member 'UAlterationOptionsWidget_C::OptionsSwitcher' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, OptionsVbox) == 0x000320, "Member 'UAlterationOptionsWidget_C::OptionsVbox' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, ReplacementsBorder) == 0x000328, "Member 'UAlterationOptionsWidget_C::ReplacementsBorder' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, ReplacementsVBox) == 0x000330, "Member 'UAlterationOptionsWidget_C::ReplacementsVBox' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, ScrollBox) == 0x000338, "Member 'UAlterationOptionsWidget_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, Upgrades) == 0x000340, "Member 'UAlterationOptionsWidget_C::Upgrades' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, UpgradesBorder) == 0x000348, "Member 'UAlterationOptionsWidget_C::UpgradesBorder' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, UpgradesVBox) == 0x000350, "Member 'UAlterationOptionsWidget_C::UpgradesVBox' has a wrong offset!");
static_assert(offsetof(UAlterationOptionsWidget_C, ItemInfoWindow) == 0x000358, "Member 'UAlterationOptionsWidget_C::ItemInfoWindow' has a wrong offset!");

}

