#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlterationOptionsIngredientsList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AlterationOptionsIngredientsList.AlterationOptionsIngredientsList_C.ExecuteUbergraph_AlterationOptionsIngredientsList
// 0x0028 (0x0028 - 0x0000)
struct AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemQuantityListEntryBase*         K2Node_Event_ListEntry;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList) == 0x000008, "Wrong alignment on AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList");
static_assert(sizeof(AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList) == 0x000028, "Wrong size on AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList");
static_assert(offsetof(AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList, EntryPoint) == 0x000000, "Member 'AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList, K2Node_MakeStruct_Margin) == 0x000004, "Member 'AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList, K2Node_Event_ListEntry) == 0x000018, "Member 'AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList::K2Node_Event_ListEntry' has a wrong offset!");
static_assert(offsetof(AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000020, "Member 'AlterationOptionsIngredientsList_C_ExecuteUbergraph_AlterationOptionsIngredientsList::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function AlterationOptionsIngredientsList.AlterationOptionsIngredientsList_C.AddListEntry
// 0x0008 (0x0008 - 0x0000)
struct AlterationOptionsIngredientsList_C_AddListEntry final
{
public:
	class UFortItemQuantityListEntryBase*         ListEntry;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AlterationOptionsIngredientsList_C_AddListEntry) == 0x000008, "Wrong alignment on AlterationOptionsIngredientsList_C_AddListEntry");
static_assert(sizeof(AlterationOptionsIngredientsList_C_AddListEntry) == 0x000008, "Wrong size on AlterationOptionsIngredientsList_C_AddListEntry");
static_assert(offsetof(AlterationOptionsIngredientsList_C_AddListEntry, ListEntry) == 0x000000, "Member 'AlterationOptionsIngredientsList_C_AddListEntry::ListEntry' has a wrong offset!");

// Function AlterationOptionsIngredientsList.AlterationOptionsIngredientsList_C.SetupTitle
// 0x0010 (0x0010 - 0x0000)
struct AlterationOptionsIngredientsList_C_SetupTitle final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AlterationOptionsIngredientsList_C_SetupTitle) == 0x000008, "Wrong alignment on AlterationOptionsIngredientsList_C_SetupTitle");
static_assert(sizeof(AlterationOptionsIngredientsList_C_SetupTitle) == 0x000010, "Wrong size on AlterationOptionsIngredientsList_C_SetupTitle");
static_assert(offsetof(AlterationOptionsIngredientsList_C_SetupTitle, Temp_bool_Variable) == 0x000000, "Member 'AlterationOptionsIngredientsList_C_SetupTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AlterationOptionsIngredientsList_C_SetupTitle, CallFunc_IsEmptyList_ReturnValue) == 0x000001, "Member 'AlterationOptionsIngredientsList_C_SetupTitle::CallFunc_IsEmptyList_ReturnValue' has a wrong offset!");
static_assert(offsetof(AlterationOptionsIngredientsList_C_SetupTitle, K2Node_Select_Default) == 0x000008, "Member 'AlterationOptionsIngredientsList_C_SetupTitle::K2Node_Select_Default' has a wrong offset!");

}

