#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MountedTurret

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_MountedTurret.AnimBP_MountedTurret_C.ExecuteUbergraph_AnimBP_MountedTurret
// 0x0050 (0x0050 - 0x0000)
struct AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_NormalizeAxis_ReturnValue1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue2;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue3;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue4;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret) == 0x000008, "Wrong alignment on AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret");
static_assert(sizeof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret) == 0x000050, "Wrong size on AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, EntryPoint) == 0x000000, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, Temp_float_Variable) == 0x000004, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue) == 0x000008, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, Temp_bool_Variable) == 0x00000C, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue1) == 0x000010, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, K2Node_Event_DeltaTimeX) == 0x000020, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue2) == 0x000024, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000028, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue3) == 0x000030, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue4) == 0x000034, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, K2Node_Select_Default) == 0x00003C, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000040, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AnimBP_MountedTurret.AnimBP_MountedTurret_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_MountedTurret_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_MountedTurret_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_MountedTurret_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_MountedTurret_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_MountedTurret_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_MountedTurret_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_MountedTurret_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

