#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Enemy_Player_SneakySnowman

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Enemy_Player_SneakySnowman.Athena_Enemy_Player_SneakySnowman_C
// 0x0070 (0x0CA0 - 0x0C30)
class AAthena_Enemy_Player_SneakySnowman_C final : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_SneakySnowman;                                  // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Effects;                                           // 0x0C40(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C41[0x3];                                      // 0x0C41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EnemySnowmanHolster;                               // 0x0C44(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDamage;                                       // 0x0C58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5C[0x4];                                      // 0x0C5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHealth;                                         // 0x0C60(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SnowmanDuration;                                   // 0x0C80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Athena_Enemy_Player_SneakySnowman(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Enemy_Player_SneakySnowman_C">();
	}
	static class AAthena_Enemy_Player_SneakySnowman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Enemy_Player_SneakySnowman_C>();
	}
};
static_assert(alignof(AAthena_Enemy_Player_SneakySnowman_C) == 0x000008, "Wrong alignment on AAthena_Enemy_Player_SneakySnowman_C");
static_assert(sizeof(AAthena_Enemy_Player_SneakySnowman_C) == 0x000CA0, "Wrong size on AAthena_Enemy_Player_SneakySnowman_C");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, UberGraphFrame) == 0x000C30, "Member 'AAthena_Enemy_Player_SneakySnowman_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, SM_SneakySnowman) == 0x000C38, "Member 'AAthena_Enemy_Player_SneakySnowman_C::SM_SneakySnowman' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, Effects) == 0x000C40, "Member 'AAthena_Enemy_Player_SneakySnowman_C::Effects' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, EnemySnowmanHolster) == 0x000C44, "Member 'AAthena_Enemy_Player_SneakySnowman_C::EnemySnowmanHolster' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, PlayerPawn) == 0x000C50, "Member 'AAthena_Enemy_Player_SneakySnowman_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, TotalDamage) == 0x000C58, "Member 'AAthena_Enemy_Player_SneakySnowman_C::TotalDamage' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, MaxHealth) == 0x000C60, "Member 'AAthena_Enemy_Player_SneakySnowman_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(AAthena_Enemy_Player_SneakySnowman_C, SnowmanDuration) == 0x000C80, "Member 'AAthena_Enemy_Player_SneakySnowman_C::SnowmanDuration' has a wrong offset!");

}

