#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingTile

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.ExecuteUbergraph_AthenaMatchmakingTile
// 0x03D0 (0x03D0 - 0x0000)
struct AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistAdvertisementType                    Temp_byte_Variable2;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistAdvertisementType                    Temp_byte_Variable6;                               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0048(0x0018)()
	EFortMatchmakingTileStyle                     Temp_byte_Variable7;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingTileStyle                     Temp_byte_Variable8;                               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingTileStyle                     Temp_byte_Variable13;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable1;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable14;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable15;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCMSContext*                            CallFunc_GetContext_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewPlaylistInformationAvailable_ReturnValue; // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable16;                              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable17;                              // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable18;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable19;                              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable4;                              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable5;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable1;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable2;                             // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumRowTiles;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlaylistFrontEndData                  K2Node_Event_PlaylistToRepresent;                  // 0x0108(0x0038)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0150(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0170(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0188(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x01A8(0x0088)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue1;        // 0x0230(0x0088)()
	bool                                          Temp_bool_Variable7;                               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable20;                              // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable21;                              // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable22;                              // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select5_Default;                            // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable23;                              // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select6_Default;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue3;               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select7_Default;                            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable9;                               // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue4;               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue5;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable6;                              // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable7;                              // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select8_Default;                            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable10;                              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue1;           // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B[0x1];                                      // 0x034B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select9_Default;                            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select10_Default;                           // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select11_Default;                           // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue3;           // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue1;                 // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x035E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x035F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select12_Default;                           // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_363[0x1];                                      // 0x0363(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select13_Default;                           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select14_Default;                           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select15_Default;                           // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select16_Default;                           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimespanAsText_ReturnValue;            // 0x0398(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x03B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Available;                            // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select17_Default;                           // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile) == 0x000008, "Wrong alignment on AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile");
static_assert(sizeof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile) == 0x0003D0, "Wrong size on AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_DateTimeMinValue_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable) == 0x000010, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable1) == 0x000011, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable2) == 0x000012, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable3) == 0x000013, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable4) == 0x000014, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable5) == 0x000015, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable6) == 0x000016, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable) == 0x000018, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable1) == 0x000030, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable2) == 0x000048, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable7) == 0x000060, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_object_Variable) == 0x000068, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable8) == 0x000070, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable9) == 0x000071, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable10) == 0x000072, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable11) == 0x000073, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable12) == 0x000074, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable13) == 0x000075, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_object_Variable1) == 0x000078, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable) == 0x000080, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_class_Variable) == 0x000088, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_class_Variable1) == 0x000090, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable1) == 0x000098, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable14) == 0x000099, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable15) == 0x00009A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetContext_ReturnValue) == 0x0000A0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable2) == 0x0000A8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_IsNewPlaylistInformationAvailable_ReturnValue) == 0x0000A9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_IsNewPlaylistInformationAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable) == 0x0000AC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable1) == 0x0000B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable) == 0x0000B4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable1) == 0x0000B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable2) == 0x0000BC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable3) == 0x0000C0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable3) == 0x0000C4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable16) == 0x0000C5, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable17) == 0x0000C6, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable4) == 0x0000C7, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable18) == 0x0000C8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable19) == 0x0000C9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable5) == 0x0000CA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable4) == 0x0000CC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable5) == 0x0000D0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable2) == 0x0000D4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable) == 0x0000DC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default) == 0x0000E4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable1) == 0x0000E8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select1_Default) == 0x0000F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable2) == 0x0000F4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable6) == 0x0000FC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable3) == 0x000100, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_NumRowTiles) == 0x000104, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_NumRowTiles' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_PlaylistToRepresent) == 0x000108, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_PlaylistToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000140, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select2_Default) == 0x000148, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select3_Default) == 0x000150, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000168, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000169, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue) == 0x00016A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextToUpper_ReturnValue) == 0x000170, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextToUpper_ReturnValue1) == 0x000188, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextIsEmpty_ReturnValue) == 0x0001A0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x0001A8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeBrushFromTexture_ReturnValue1) == 0x000230, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeBrushFromTexture_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable7) == 0x0002B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable20) == 0x0002B9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable20' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable21) == 0x0002BA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable21' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue) == 0x0002C0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_CreateDelegate_OutputDelegate) == 0x0002C8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable8) == 0x0002D8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable22) == 0x0002D9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable22' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select4_Default) == 0x0002DA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select5_Default) == 0x0002E0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable23) == 0x0002E8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable23' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select6_Default) == 0x0002F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue1) == 0x0002F8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue2) == 0x000300, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetEndTime_ReturnValue) == 0x000308, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue3) == 0x000310, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select7_Default) == 0x000318, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable9) == 0x000319, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue4) == 0x000320, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue5) == 0x000328, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable6) == 0x000330, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable7) == 0x000334, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue1) == 0x000338, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanAND_ReturnValue) == 0x000339, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select8_Default) == 0x000340, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select8_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable10) == 0x000348, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000349, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue1) == 0x00034A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Len_ReturnValue) == 0x00034C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue2) == 0x000350, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Greater_IntInt_ReturnValue) == 0x000351, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue3) == 0x000352, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Not_PreBool_ReturnValue) == 0x000353, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select9_Default) == 0x000354, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select9_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select10_Default) == 0x000358, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select10_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000359, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select11_Default) == 0x00035A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select11_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue3) == 0x00035B, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue4) == 0x00035C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextIsEmpty_ReturnValue1) == 0x00035D, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextIsEmpty_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_SwitchEnum_CmpSuccess) == 0x00035E, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue5) == 0x00035F, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanAND_ReturnValue1) == 0x000360, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x000361, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select12_Default) == 0x000362, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select12_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select13_Default) == 0x000364, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select13_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select14_Default) == 0x000368, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select14_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select15_Default) == 0x00036C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select15_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_UtcNow_ReturnValue) == 0x000370, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Clamp_ReturnValue) == 0x000378, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00037C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeVector2D_ReturnValue) == 0x000380, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000388, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select16_Default) == 0x000390, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select16_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetTimespanAsText_ReturnValue) == 0x000398, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetTimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_CreateDelegate_OutputDelegate1) == 0x0003B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003C0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x0003C8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_Available) == 0x0003C9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_Available' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select17_Default) == 0x0003CA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select17_Default' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.UpdateTileAvailability
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingTile_C_UpdateTileAvailability final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingTile_C_UpdateTileAvailability) == 0x000001, "Wrong alignment on AthenaMatchmakingTile_C_UpdateTileAvailability");
static_assert(sizeof(AthenaMatchmakingTile_C_UpdateTileAvailability) == 0x000001, "Wrong size on AthenaMatchmakingTile_C_UpdateTileAvailability");
static_assert(offsetof(AthenaMatchmakingTile_C_UpdateTileAvailability, Available) == 0x000000, "Member 'AthenaMatchmakingTile_C_UpdateTileAvailability::Available' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.PlaylistChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaMatchmakingTile_C_PlaylistChanged final
{
public:
	struct FPlaylistFrontEndData                  PlaylistToRepresent;                               // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingTile_C_PlaylistChanged) == 0x000008, "Wrong alignment on AthenaMatchmakingTile_C_PlaylistChanged");
static_assert(sizeof(AthenaMatchmakingTile_C_PlaylistChanged) == 0x000038, "Wrong size on AthenaMatchmakingTile_C_PlaylistChanged");
static_assert(offsetof(AthenaMatchmakingTile_C_PlaylistChanged, PlaylistToRepresent) == 0x000000, "Member 'AthenaMatchmakingTile_C_PlaylistChanged::PlaylistToRepresent' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.SetTileSize
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingTile_C_SetTileSize final
{
public:
