#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingOptionsDisplay_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C
// 0x0168 (0x05C8 - 0x0460)
class UAthenaMatchmakingOptionsDisplay_v2_C final : public UFortAthenaMatchmakingOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroRightPanel;                                   // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutroRightPanel;                                   // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      AcceptButton;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               AthenaMatchmakingTile;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               AthenaMatchmakingTile_0;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               AthenaMatchmakingTile_1;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BangSwitcher;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGImage;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderLTMBang;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderLTMBang_Heist;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ChoosePromptSB;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentGameModeDescription;                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentGameModeDisabledDescription;                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentGameModeName;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeGlow;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GameModes;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCMSImageSlideShow_C*                   GameModeSlideShow;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IconSpacer;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineRule;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LTMModeSubIcon;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ModeDescriptionScrollBox;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RootBorder;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubGameModeName;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubGameModeNameHB;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_LTMBangText;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_LTMBangText_Heist;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TouchTOCloseZone;                                  // 0x0558(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         WarningHB;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_Cancel;                                      // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAthena_Matchmaking_SpecialEventButton_C* MyLTM;                                             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastHoveredStandardModeIndex;                      // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SM_Button_IndexMax;                                // 0x0584(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SM_Button_IndexCurrent;                            // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DefaultPlaylists;                                  // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   InitialButtonSelection;                            // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CurrentPlaylist;                                   // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatchmakingPageTileIndex;                          // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntroOutroTileDelayTime;                           // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputCustomMatchmaking;                            // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsPerformingOutro;                                 // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayIntroAnim;                                     // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2(int32 EntryPoint);
	void SetSpectatorButtonText(ESpectatorQueueType InSpectatorQueueType);
	void SetServerAccessText(EServerAccessSetting InServerAccessSetting);
	void UpdateMMButtonStatusBP(bool bPlaylistIsEnabled, EFillDisableReason FillDisableReason);
	void OnDeactivated();
	void Construct();
	void OnActivated();
	void ApplyCMSOverrides();
	void Start_Closing_Matchmaking_Options();
	void OnTileDoubleClicked(class UCommonButton* ButtonClicked);
	void RepresentedPlaylistChanged(const struct FPlaylistFrontEndData& NewRepresentedPlaylist);
	void OnRightPanelIntroFinshed();
	void OnBeginIntro();
	void OnRightPanelOutroFinshed();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetSquadFillText(ESquadFillSetting InSquadFillSetting);
	void SetupInput();
	void Handle_InputAction_Cancel(bool* PassThrough);
	struct FEventReply Touch_To_Close(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void TriggerMatchmakingPageTileIntroAnim();
	void TriggerMatchmakingPageTileOutroAnim();
	void OnCustomMatchmaking(bool* PassThrough);
	void SetScrollWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingOptionsDisplay_v2_C">();
	}
	static class UAthenaMatchmakingOptionsDisplay_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingOptionsDisplay_v2_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingOptionsDisplay_v2_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingOptionsDisplay_v2_C");
static_assert(sizeof(UAthenaMatchmakingOptionsDisplay_v2_C) == 0x0005C8, "Wrong size on UAthenaMatchmakingOptionsDisplay_v2_C");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, UberGraphFrame) == 0x000460, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IntroRightPanel) == 0x000468, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IntroRightPanel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, OutroRightPanel) == 0x000470, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::OutroRightPanel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AcceptButton) == 0x000478, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AthenaMatchmakingTile) == 0x000480, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AthenaMatchmakingTile' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AthenaMatchmakingTile_0) == 0x000488, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AthenaMatchmakingTile_0' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AthenaMatchmakingTile_1) == 0x000490, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AthenaMatchmakingTile_1' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BangSwitcher) == 0x000498, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BangSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BGImage) == 0x0004A0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BGImage' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BorderLTMBang) == 0x0004A8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BorderLTMBang' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BorderLTMBang_Heist) == 0x0004B0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BorderLTMBang_Heist' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ChoosePromptSB) == 0x0004B8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ChoosePromptSB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ConfirmSelectionShine) == 0x0004C0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentGameModeDescription) == 0x0004C8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentGameModeDescription' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentGameModeDisabledDescription) == 0x0004D0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentGameModeDisabledDescription' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentGameModeName) == 0x0004D8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentGameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModeGlow) == 0x0004E0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModeGlow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModeIcon) == 0x0004E8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModes) == 0x0004F0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModes' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModeSlideShow) == 0x0004F8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModeSlideShow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IconSpacer) == 0x000500, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IconSpacer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Lightbox) == 0x000508, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LineRule) == 0x000510, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LineRule' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LTMModeSubIcon) == 0x000518, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LTMModeSubIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ModeDescriptionScrollBox) == 0x000520, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ModeDescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, RootBorder) == 0x000528, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::RootBorder' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, RootOverlay) == 0x000530, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SubGameModeName) == 0x000538, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SubGameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SubGameModeNameHB) == 0x000540, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SubGameModeNameHB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, T_LTMBangText) == 0x000548, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::T_LTMBangText' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, T_LTMBangText_Heist) == 0x000550, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::T_LTMBangText_Heist' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, TouchTOCloseZone) == 0x000558, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::TouchTOCloseZone' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, WarningHB) == 0x000560, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::WarningHB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Input_Cancel) == 0x000568, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Input_Cancel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MyLTM) == 0x000578, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MyLTM' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LastHoveredStandardModeIndex) == 0x000580, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LastHoveredStandardModeIndex' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SM_Button_IndexMax) == 0x000584, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SM_Button_IndexMax' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SM_Button_IndexCurrent) == 0x000588, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SM_Button_IndexCurrent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, DefaultPlaylists) == 0x000590, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::DefaultPlaylists' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, InitialButtonSelection) == 0x000598, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::InitialButtonSelection' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentPlaylist) == 0x0005A0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentPlaylist' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MatchmakingPageTileIndex) == 0x0005A8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MatchmakingPageTileIndex' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IntroOutroTileDelayTime) == 0x0005AC, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IntroOutroTileDelayTime' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, InputCustomMatchmaking) == 0x0005B0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::InputCustomMatchmaking' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IsPerformingOutro) == 0x0005C0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IsPerformingOutro' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, PlayIntroAnim) == 0x0005C1, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::PlayIntroAnim' has a wrong offset!");

}

