#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaLobby.AthenaLobby_C.ExecuteUbergraph_AthenaLobby
// 0x02E8 (0x02E8 - 0x0000)
struct AthenaLobby_C_ExecuteUbergraph_AthenaLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPickerContext*                     CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue1;         // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLobbyType                                Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable1;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable2;                               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable3;                               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLobbyType                                Temp_byte_Variable4;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex2;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue2;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue3;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue1;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue6;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex1;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerIndex;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NumHighlights)>          K2Node_CreateDelegate_OutputDelegate2;             // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBROnly_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin1;                         // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default;                             // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatablePanel*                K2Node_CustomEvent_Panel;                          // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue7;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_EnsureClientQuestLogin* CallFunc_SendEnsureClientQuestLogin_ReturnValue;   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue8;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDLayoutToolFireModePanel_C*          K2Node_DynamicCast_AsHUDLayout_Tool_Fire_Mode_Panel; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStoreToastRequest*                     K2Node_Event_StoreUpdatedRequest;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue10;                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeginRequest_ReturnValue;           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStoreCallout                          CallFunc_GetToast_ReturnValue;                     // 0x01C0(0x0078)()
	bool                                          CallFunc_IsRequestReady_ReturnValue;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue11;                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue1;                   // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue2;                   // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B[0x5];                                      // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End1; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End2; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLobbyType                                K2Node_Event_LobbyType;                            // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x02CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayPCBData_ReturnValue;         // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMatchmakingPlay_C*               K2Node_DynamicCast_AsAthena_Matchmaking_Play;      // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable8;                               // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB[0x1];                                      // 0x02DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrontEndCamera                               K2Node_Select2_Default;                            // 0x02E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby) == 0x000008, "Wrong alignment on AthenaLobby_C_ExecuteUbergraph_AthenaLobby");
static_assert(sizeof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby) == 0x0002E8, "Wrong size on AthenaLobby_C_ExecuteUbergraph_AthenaLobby");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, EntryPoint) == 0x000000, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CustomEvent_Result) == 0x000004, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CustomEvent_ResultName) == 0x000008, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_K2_SetTimerDelegate_ReturnValue1) == 0x000030, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_K2_SetTimerDelegate_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue1) == 0x000038, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable) == 0x000040, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable1) == 0x000041, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable2) == 0x000042, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable3) == 0x000043, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable4) == 0x000044, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable5) == 0x000045, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable6) == 0x000046, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable7) == 0x000047, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_PlayerIndex2) == 0x000048, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_PlayerIndex2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue2) == 0x000050, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetCurrentInputType_ReturnValue) == 0x000059, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000060, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000068, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_Button1) == 0x000070, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate1) == 0x000078, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue3) == 0x000088, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue4) == 0x000090, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetCurrentInputType_ReturnValue1) == 0x000098, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetCurrentInputType_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue5) == 0x0000A0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_bool_Variable) == 0x0000A9, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue6) == 0x0000B0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_PlayerIndex1) == 0x0000B8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_PlayerIndex1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_PlayerIndex) == 0x0000BC, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_PlayerIndex' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C4, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_ComponentBoundEvent_Button) == 0x0000D8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsBROnly_ReturnValue) == 0x0000E0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsBROnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_MakeStruct_Margin) == 0x0000E4, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_BooleanAND_ReturnValue) == 0x0000F4, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_MakeStruct_Margin1) == 0x0000F8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_MakeStruct_Margin1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Select_Default) == 0x000108, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate3) == 0x000118, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CustomEvent_Panel) == 0x000128, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CustomEvent_Panel' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate4) == 0x000130, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue7) == 0x000140, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate5) == 0x000148, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetQuestManager_ReturnValue) == 0x000158, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_SendEnsureClientQuestLogin_ReturnValue) == 0x000160, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_SendEnsureClientQuestLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000170, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue8) == 0x000178, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetCachedWidget_ReturnValue) == 0x000180, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue9) == 0x000188, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_AsHUDLayout_Tool_Fire_Mode_Panel) == 0x000190, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_AsHUDLayout_Tool_Fire_Mode_Panel' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsValid_ReturnValue1) == 0x000199, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_StoreUpdatedRequest) == 0x0001A0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_StoreUpdatedRequest' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_bool_Has_Been_Initd_Variable) == 0x0001A8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue10) == 0x0001B0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_ShouldBeginRequest_ReturnValue) == 0x0001B8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_ShouldBeginRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetToast_ReturnValue) == 0x0001C0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetToast_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsRequestReady_ReturnValue) == 0x000238, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsRequestReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsValid_ReturnValue2) == 0x000239, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsActivated_ReturnValue) == 0x00023A, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue11) == 0x000240, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetContext_ReturnValue12) == 0x000248, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate6) == 0x000250, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetPlayerController_ReturnValue) == 0x000260, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsVisible_ReturnValue) == 0x000268, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_AsFort_Player_Controller_Front_End) == 0x000270, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_AsFort_Player_Controller_Front_End' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_bSuccess1) == 0x000278, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000280, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_CreateDelegate_OutputDelegate7) == 0x000288, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsValid_ReturnValue3) == 0x000298, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsVisible_ReturnValue1) == 0x000299, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsVisible_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_IsVisible_ReturnValue2) == 0x00029A, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_IsVisible_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetPlayerController_ReturnValue1) == 0x0002A0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_GetPlayerController_ReturnValue2) == 0x0002A8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_AsFort_Player_Controller_Front_End1) == 0x0002B0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_AsFort_Player_Controller_Front_End1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_bSuccess2) == 0x0002B8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_AsFort_Player_Controller_Front_End2) == 0x0002C0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_AsFort_Player_Controller_Front_End2' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_bSuccess3) == 0x0002C8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Event_LobbyType) == 0x0002C9, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Event_LobbyType' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_SwitchEnum_CmpSuccess) == 0x0002CA, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Select1_Default) == 0x0002CB, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_ShouldDisplayPCBData_ReturnValue) == 0x0002CC, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_ShouldDisplayPCBData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_AsAthena_Matchmaking_Play) == 0x0002D0, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_AsAthena_Matchmaking_Play' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_DynamicCast_bSuccess4) == 0x0002D8, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_byte_Variable8) == 0x0002D9, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_SwitchEnum1_CmpSuccess) == 0x0002DA, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_name_Variable) == 0x0002DC, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, Temp_bool_IsClosed_Variable) == 0x0002E4, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0002E5, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, CallFunc_EqualEqual_NameName_ReturnValue1) == 0x0002E6, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::CallFunc_EqualEqual_NameName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_ExecuteUbergraph_AthenaLobby, K2Node_Select2_Default) == 0x0002E7, "Member 'AthenaLobby_C_ExecuteUbergraph_AthenaLobby::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnPlaylistChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaLobby_C_OnPlaylistChanged final
{
public:
	EFortLobbyType                                LobbyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnPlaylistChanged) == 0x000001, "Wrong alignment on AthenaLobby_C_OnPlaylistChanged");
static_assert(sizeof(AthenaLobby_C_OnPlaylistChanged) == 0x000001, "Wrong size on AthenaLobby_C_OnPlaylistChanged");
static_assert(offsetof(AthenaLobby_C_OnPlaylistChanged, LobbyType) == 0x000000, "Member 'AthenaLobby_C_OnPlaylistChanged::LobbyType' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.DisplayStoreUpdated
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_DisplayStoreUpdated final
{
public:
	class UStoreToastRequest*                     StoreUpdatedRequest;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_DisplayStoreUpdated) == 0x000008, "Wrong alignment on AthenaLobby_C_DisplayStoreUpdated");
static_assert(sizeof(AthenaLobby_C_DisplayStoreUpdated) == 0x000008, "Wrong size on AthenaLobby_C_DisplayStoreUpdated");
static_assert(offsetof(AthenaLobby_C_DisplayStoreUpdated, StoreUpdatedRequest) == 0x000000, "Member 'AthenaLobby_C_DisplayStoreUpdated::StoreUpdatedRequest' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.NewsPanelClosed
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_NewsPanelClosed final
{
public:
	class UCommonActivatablePanel*                Panel;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_NewsPanelClosed) == 0x000008, "Wrong alignment on AthenaLobby_C_NewsPanelClosed");
static_assert(sizeof(AthenaLobby_C_NewsPanelClosed) == 0x000008, "Wrong size on AthenaLobby_C_NewsPanelClosed");
static_assert(offsetof(AthenaLobby_C_NewsPanelClosed, Panel) == 0x000000, "Member 'AthenaLobby_C_NewsPanelClosed::Panel' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobby_C_BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnBeginCursorOverPlayer
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnBeginCursorOverPlayer final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnBeginCursorOverPlayer) == 0x000004, "Wrong alignment on AthenaLobby_C_OnBeginCursorOverPlayer");
static_assert(sizeof(AthenaLobby_C_OnBeginCursorOverPlayer) == 0x000004, "Wrong size on AthenaLobby_C_OnBeginCursorOverPlayer");
static_assert(offsetof(AthenaLobby_C_OnBeginCursorOverPlayer, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnBeginCursorOverPlayer::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnPlayerClicked
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnPlayerClicked final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnPlayerClicked) == 0x000004, "Wrong alignment on AthenaLobby_C_OnPlayerClicked");
static_assert(sizeof(AthenaLobby_C_OnPlayerClicked) == 0x000004, "Wrong size on AthenaLobby_C_OnPlayerClicked");
static_assert(offsetof(AthenaLobby_C_OnPlayerClicked, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnPlayerClicked::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobby_C_BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'AthenaLobby_C_BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnEndCursorOverPlayer
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_OnEndCursorOverPlayer final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnEndCursorOverPlayer) == 0x000004, "Wrong alignment on AthenaLobby_C_OnEndCursorOverPlayer");
static_assert(sizeof(AthenaLobby_C_OnEndCursorOverPlayer) == 0x000004, "Wrong size on AthenaLobby_C_OnEndCursorOverPlayer");
static_assert(offsetof(AthenaLobby_C_OnEndCursorOverPlayer, PlayerIndex) == 0x000000, "Member 'AthenaLobby_C_OnEndCursorOverPlayer::PlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.DialogResult_156754AE468EF93DCA2009A412591BA7
// 0x000C (0x000C - 0x0000)
struct AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7) == 0x000004, "Wrong alignment on AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7");
static_assert(sizeof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7) == 0x00000C, "Wrong size on AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7");
static_assert(offsetof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7, Result) == 0x000000, "Member 'AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7::Result' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7, ResultName) == 0x000004, "Member 'AthenaLobby_C_DialogResult_156754AE468EF93DCA2009A412591BA7::ResultName' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct AthenaLobby_C_Initialize final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLobbyBackgroundLevelName_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_Initialize) == 0x000008, "Wrong alignment on AthenaLobby_C_Initialize");
static_assert(sizeof(AthenaLobby_C_Initialize) == 0x000010, "Wrong size on AthenaLobby_C_Initialize");
static_assert(offsetof(AthenaLobby_C_Initialize, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaLobby_C_Initialize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_Initialize, CallFunc_GetLobbyBackgroundLevelName_ReturnValue) == 0x000008, "Member 'AthenaLobby_C_Initialize::CallFunc_GetLobbyBackgroundLevelName_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.Refresh
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobby_C_Refresh final
{
public:
	int32                                         UpdatedPlayerIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_Refresh) == 0x000004, "Wrong alignment on AthenaLobby_C_Refresh");
static_assert(sizeof(AthenaLobby_C_Refresh) == 0x000004, "Wrong size on AthenaLobby_C_Refresh");
static_assert(offsetof(AthenaLobby_C_Refresh, UpdatedPlayerIndex) == 0x000000, "Member 'AthenaLobby_C_Refresh::UpdatedPlayerIndex' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnTeamMemberAdded
// 0x0208 (0x0208 - 0x0000)
struct AthenaLobby_C_OnTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnTeamMemberAdded) == 0x000008, "Wrong alignment on AthenaLobby_C_OnTeamMemberAdded");
static_assert(sizeof(AthenaLobby_C_OnTeamMemberAdded) == 0x000208, "Wrong size on AthenaLobby_C_OnTeamMemberAdded");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberAdded, TeamMemberInfo) == 0x000000, "Member 'AthenaLobby_C_OnTeamMemberAdded::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberAdded, CallFunc_IsActivated_ReturnValue) == 0x000200, "Member 'AthenaLobby_C_OnTeamMemberAdded::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnTeamMemberRemoved
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobby_C_OnTeamMemberRemoved final
{
public:
	int32                                         EmptySlot;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobby_C_OnTeamMemberRemoved) == 0x000004, "Wrong alignment on AthenaLobby_C_OnTeamMemberRemoved");
static_assert(sizeof(AthenaLobby_C_OnTeamMemberRemoved) == 0x000008, "Wrong size on AthenaLobby_C_OnTeamMemberRemoved");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberRemoved, EmptySlot) == 0x000000, "Member 'AthenaLobby_C_OnTeamMemberRemoved::EmptySlot' has a wrong offset!");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberRemoved, CallFunc_IsActivated_ReturnValue) == 0x000004, "Member 'AthenaLobby_C_OnTeamMemberRemoved::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.OnTeamMemberStateChanged
// 0x0200 (0x0200 - 0x0000)
struct AthenaLobby_C_OnTeamMemberStateChanged final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobby_C_OnTeamMemberStateChanged) == 0x000008, "Wrong alignment on AthenaLobby_C_OnTeamMemberStateChanged");
static_assert(sizeof(AthenaLobby_C_OnTeamMemberStateChanged) == 0x000200, "Wrong size on AthenaLobby_C_OnTeamMemberStateChanged");
static_assert(offsetof(AthenaLobby_C_OnTeamMemberStateChanged, TeamMemberInfo) == 0x000000, "Member 'AthenaLobby_C_OnTeamMemberStateChanged::TeamMemberInfo' has a wrong offset!");

// Function AthenaLobby.AthenaLobby_C.RefreshPlayerHeroes
// 0x0268 (0x0268 - 0x0000)
struct AthenaLobby_C_RefreshPlayerHeroes final
{
public:
	int32                                         UpdatedPlayerIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    CallFunc_Array_Get_Item;                           // 0x0018(0x0200)(HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
