#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengesTab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaChallengesTab.AthenaChallengesTab_C.ExecuteUbergraph_AthenaChallengesTab
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnBack_PassThrough;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaChallengeTreeEntry_C*            K2Node_DynamicCast_AsAthena_Challenge_Tree_Entry;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortTimespanDataSource> CallFunc_SetTimespanSource_Value_CastInput;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAthenaAccountContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetCurrentSeasonNumber_ReturnValue;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortChallengeBundleInfo*               K2Node_DynamicCast_AsFort_Challenge_Bundle_Info;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChallengeBundlePage_C*                 CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTimerTimespanDataSource*           CallFunc_ConstructTimespanSource_NewObject;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab");
static_assert(sizeof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab) == 0x0000C0, "Wrong size on AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, EntryPoint) == 0x000000, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_OnBack_PassThrough) == 0x000004, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_OnBack_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_DynamicCast_AsAthena_Challenge_Tree_Entry) == 0x000010, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_DynamicCast_AsAthena_Challenge_Tree_Entry' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_SetTimespanSource_Value_CastInput) == 0x000020, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_SetTimespanSource_Value_CastInput' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetCurrentSeasonNumber_ReturnValue) == 0x000048, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetCurrentSeasonNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetUINavigationManager_ReturnValue) == 0x000050, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_ComponentBoundEvent_Item) == 0x000060, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000068, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_DynamicCast_AsFort_Challenge_Bundle_Info) == 0x000070, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_DynamicCast_AsFort_Challenge_Bundle_Info' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetContext_ReturnValue1) == 0x000088, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_Create_ReturnValue) == 0x000090, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_IsInZone_ReturnValue) == 0x000098, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, Temp_byte_Variable) == 0x00009A, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_GetContext_ReturnValue2) == 0x0000A0, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, Temp_byte_Variable1) == 0x0000A8, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_Event_IsDesignTime) == 0x0000A9, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, Temp_bool_Variable) == 0x0000AA, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_ConstructTimespanSource_NewObject) == 0x0000B0, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_ConstructTimespanSource_NewObject' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, CallFunc_IsMobileGame_ReturnValue) == 0x0000B8, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab, K2Node_Select_Default) == 0x0000B9, "Member 'AthenaChallengesTab_C_ExecuteUbergraph_AthenaChallengesTab::K2Node_Select_Default' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengesTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengesTab_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaChallengesTab_C_PreConstruct");
static_assert(sizeof(AthenaChallengesTab_C_PreConstruct) == 0x000001, "Wrong size on AthenaChallengesTab_C_PreConstruct");
static_assert(offsetof(AthenaChallengesTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaChallengesTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature");
static_assert(sizeof(AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature");
static_assert(offsetof(AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature, Item) == 0x000000, "Member 'AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature::Item' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'AthenaChallengesTab_C_BndEvt__ChallangeTreeView_K2Node_ComponentBoundEvent_40_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.UpdateChallengeViews
// 0x0018 (0x0018 - 0x0000)
struct AthenaChallengesTab_C_UpdateChallengeViews final
{
public:
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortChallengeBundleCategoryInfo*> CallFunc_GetChallengeCategoryInfos_OutCategoryInfos; // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaChallengesTab_C_UpdateChallengeViews) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_UpdateChallengeViews");
static_assert(sizeof(AthenaChallengesTab_C_UpdateChallengeViews) == 0x000018, "Wrong size on AthenaChallengesTab_C_UpdateChallengeViews");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_IsActivated_ReturnValue) == 0x000000, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_UpdateChallengeViews, CallFunc_GetChallengeCategoryInfos_OutCategoryInfos) == 0x000008, "Member 'AthenaChallengesTab_C_UpdateChallengeViews::CallFunc_GetChallengeCategoryInfos_OutCategoryInfos' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.SetupViewedItemData
// 0x0008 (0x0008 - 0x0000)
struct AthenaChallengesTab_C_SetupViewedItemData final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_SetupViewedItemData) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_SetupViewedItemData");
static_assert(sizeof(AthenaChallengesTab_C_SetupViewedItemData) == 0x000008, "Wrong size on AthenaChallengesTab_C_SetupViewedItemData");
static_assert(offsetof(AthenaChallengesTab_C_SetupViewedItemData, Item) == 0x000000, "Member 'AthenaChallengesTab_C_SetupViewedItemData::Item' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.TreeViewGetChildrenForCategory
// 0x0038 (0x0038 - 0x0000)
struct AthenaChallengesTab_C_TreeViewGetChildrenForCategory final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm)
	class UFortChallengeBundleCategoryInfo*       K2Node_DynamicCast_AsFort_Challenge_Bundle_Category_Info; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortChallengeBundleInfo*>       CallFunc_GetChallengeBundleInfos_ReturnValue;      // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_TreeViewGetChildrenForCategory");
static_assert(sizeof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory) == 0x000038, "Wrong size on AthenaChallengesTab_C_TreeViewGetChildrenForCategory");
static_assert(offsetof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory, Item) == 0x000000, "Member 'AthenaChallengesTab_C_TreeViewGetChildrenForCategory::Item' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory, ReturnValue) == 0x000008, "Member 'AthenaChallengesTab_C_TreeViewGetChildrenForCategory::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory, K2Node_DynamicCast_AsFort_Challenge_Bundle_Category_Info) == 0x000018, "Member 'AthenaChallengesTab_C_TreeViewGetChildrenForCategory::K2Node_DynamicCast_AsFort_Challenge_Bundle_Category_Info' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaChallengesTab_C_TreeViewGetChildrenForCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_TreeViewGetChildrenForCategory, CallFunc_GetChallengeBundleInfos_ReturnValue) == 0x000028, "Member 'AthenaChallengesTab_C_TreeViewGetChildrenForCategory::CallFunc_GetChallengeBundleInfos_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.SelectFirstBundle
// 0x0030 (0x0030 - 0x0000)
struct AthenaChallengesTab_C_SelectFirstBundle final
{
public:
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortChallengeBundleCategoryInfo*       K2Node_DynamicCast_AsFort_Challenge_Bundle_Category_Info; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortChallengeBundleInfo*>       CallFunc_GetChallengeBundleInfos_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortChallengeBundleInfo*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_SelectFirstBundle) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_SelectFirstBundle");
static_assert(sizeof(AthenaChallengesTab_C_SelectFirstBundle) == 0x000030, "Wrong size on AthenaChallengesTab_C_SelectFirstBundle");
static_assert(offsetof(AthenaChallengesTab_C_SelectFirstBundle, CallFunc_GetItemAt_ReturnValue) == 0x000000, "Member 'AthenaChallengesTab_C_SelectFirstBundle::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SelectFirstBundle, K2Node_DynamicCast_AsFort_Challenge_Bundle_Category_Info) == 0x000008, "Member 'AthenaChallengesTab_C_SelectFirstBundle::K2Node_DynamicCast_AsFort_Challenge_Bundle_Category_Info' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SelectFirstBundle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaChallengesTab_C_SelectFirstBundle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SelectFirstBundle, CallFunc_GetChallengeBundleInfos_ReturnValue) == 0x000018, "Member 'AthenaChallengesTab_C_SelectFirstBundle::CallFunc_GetChallengeBundleInfos_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SelectFirstBundle, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaChallengesTab_C_SelectFirstBundle::CallFunc_Array_Get_Item' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.SetBackground
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaChallengesTab_C_SetBackground final
{
public:
	bool                                          IsInGame;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select1_Default;                            // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin1;                         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select3_Default;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin3;                         // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_Select4_Default;                            // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select5_Default;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_SetBackground) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_SetBackground");
static_assert(sizeof(AthenaChallengesTab_C_SetBackground) == 0x0000A0, "Wrong size on AthenaChallengesTab_C_SetBackground");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, IsInGame) == 0x000000, "Member 'AthenaChallengesTab_C_SetBackground::IsInGame' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_bool_Variable) == 0x000001, "Member 'AthenaChallengesTab_C_SetBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_byte_Variable) == 0x000002, "Member 'AthenaChallengesTab_C_SetBackground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_byte_Variable1) == 0x000003, "Member 'AthenaChallengesTab_C_SetBackground::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_bool_Variable1) == 0x000004, "Member 'AthenaChallengesTab_C_SetBackground::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_byte_Variable2) == 0x000005, "Member 'AthenaChallengesTab_C_SetBackground::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_byte_Variable3) == 0x000006, "Member 'AthenaChallengesTab_C_SetBackground::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_bool_Variable2) == 0x000007, "Member 'AthenaChallengesTab_C_SetBackground::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_bool_Variable3) == 0x000008, "Member 'AthenaChallengesTab_C_SetBackground::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_bool_Variable4) == 0x000009, "Member 'AthenaChallengesTab_C_SetBackground::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_byte_Variable4) == 0x00000A, "Member 'AthenaChallengesTab_C_SetBackground::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_byte_Variable5) == 0x00000B, "Member 'AthenaChallengesTab_C_SetBackground::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaChallengesTab_C_SetBackground::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_float_Variable) == 0x000018, "Member 'AthenaChallengesTab_C_SetBackground::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, CallFunc_IsInZone_ReturnValue) == 0x00001C, "Member 'AthenaChallengesTab_C_SetBackground::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'AthenaChallengesTab_C_SetBackground::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_Select_Default) == 0x00001E, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_Select1_Default) == 0x00001F, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_float_Variable1) == 0x000020, "Member 'AthenaChallengesTab_C_SetBackground::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_Select2_Default) == 0x000024, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_MakeStruct_Margin) == 0x000028, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_MakeStruct_Margin1) == 0x000038, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_MakeStruct_Margin1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_Select3_Default) == 0x000048, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000058, "Member 'AthenaChallengesTab_C_SetBackground::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000060, "Member 'AthenaChallengesTab_C_SetBackground::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_MakeStruct_Margin2) == 0x000068, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_MakeStruct_Margin2' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_MakeStruct_Margin3) == 0x000078, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_MakeStruct_Margin3' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, Temp_bool_Variable5) == 0x000088, "Member 'AthenaChallengesTab_C_SetBackground::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_Select4_Default) == 0x00008C, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetBackground, K2Node_Select5_Default) == 0x00009C, "Member 'AthenaChallengesTab_C_SetBackground::K2Node_Select5_Default' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.OnBack
// 0x0010 (0x0010 - 0x0000)
struct AthenaChallengesTab_C_OnBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_OnBack) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_OnBack");
static_assert(sizeof(AthenaChallengesTab_C_OnBack) == 0x000010, "Wrong size on AthenaChallengesTab_C_OnBack");
static_assert(offsetof(AthenaChallengesTab_C_OnBack, PassThrough) == 0x000000, "Member 'AthenaChallengesTab_C_OnBack::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_OnBack, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaChallengesTab_C_OnBack::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.InitializeInput
// 0x0030 (0x0030 - 0x0000)
struct AthenaChallengesTab_C_InitializeInput final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengesTab_C_InitializeInput) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_InitializeInput");
static_assert(sizeof(AthenaChallengesTab_C_InitializeInput) == 0x000030, "Wrong size on AthenaChallengesTab_C_InitializeInput");
static_assert(offsetof(AthenaChallengesTab_C_InitializeInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaChallengesTab_C_InitializeInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_InitializeInput, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'AthenaChallengesTab_C_InitializeInput::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_InitializeInput, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaChallengesTab_C_InitializeInput::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_InitializeInput, CallFunc_IsInZone_ReturnValue) == 0x000028, "Member 'AthenaChallengesTab_C_InitializeInput::CallFunc_IsInZone_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.SetupFrontendInfo
// 0x0030 (0x0030 - 0x0000)
struct AthenaChallengesTab_C_SetupFrontendInfo final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaChallengesTab_C_SetupFrontendInfo) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_SetupFrontendInfo");
static_assert(sizeof(AthenaChallengesTab_C_SetupFrontendInfo) == 0x000030, "Wrong size on AthenaChallengesTab_C_SetupFrontendInfo");
static_assert(offsetof(AthenaChallengesTab_C_SetupFrontendInfo, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaChallengesTab_C_SetupFrontendInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupFrontendInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaChallengesTab_C_SetupFrontendInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupFrontendInfo, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'AthenaChallengesTab_C_SetupFrontendInfo::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupFrontendInfo, CallFunc_GetContext_ReturnValue1) == 0x000020, "Member 'AthenaChallengesTab_C_SetupFrontendInfo::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupFrontendInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'AthenaChallengesTab_C_SetupFrontendInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.SetupChallengeBundleInfo
// 0x0048 (0x0048 - 0x0000)
struct AthenaChallengesTab_C_SetupChallengeBundleInfo final
{
public:
	class UChallengeBundlePage_C*                 InChallengeBundlePageWidget;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUISubsystem*                     CallFunc_GetContext_ReturnValue1;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_SetupChallengeBundleInfo) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_SetupChallengeBundleInfo");
static_assert(sizeof(AthenaChallengesTab_C_SetupChallengeBundleInfo) == 0x000048, "Wrong size on AthenaChallengesTab_C_SetupChallengeBundleInfo");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, InChallengeBundlePageWidget) == 0x000000, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::InChallengeBundlePageWidget' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_GetContext_ReturnValue1) == 0x000010, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_GetInputManager_ReturnValue) == 0x000020, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_IsInZone_ReturnValue) == 0x000028, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_GetContext_ReturnValue3) == 0x000030, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_IsMobileGame_ReturnValue) == 0x000038, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_SetupChallengeBundleInfo, CallFunc_GetContext_ReturnValue4) == 0x000040, "Member 'AthenaChallengesTab_C_SetupChallengeBundleInfo::CallFunc_GetContext_ReturnValue4' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.ConstructTimespanSource
// 0x0020 (0x0020 - 0x0000)
struct AthenaChallengesTab_C_ConstructTimespanSource final
{
public:
	class UFortTimerTimespanDataSource*           NewObject;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FTimespan* Result)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortTimerTimespanDataSource*           CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_ConstructTimespanSource) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_ConstructTimespanSource");
static_assert(sizeof(AthenaChallengesTab_C_ConstructTimespanSource) == 0x000020, "Wrong size on AthenaChallengesTab_C_ConstructTimespanSource");
static_assert(offsetof(AthenaChallengesTab_C_ConstructTimespanSource, NewObject) == 0x000000, "Member 'AthenaChallengesTab_C_ConstructTimespanSource::NewObject' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ConstructTimespanSource, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaChallengesTab_C_ConstructTimespanSource::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_ConstructTimespanSource, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'AthenaChallengesTab_C_ConstructTimespanSource::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function AthenaChallengesTab.AthenaChallengesTab_C.GetAthenaEventTime
// 0x0028 (0x0028 - 0x0000)
struct AthenaChallengesTab_C_GetAthenaEventTime final
{
public:
	struct FTimespan                              Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTimeSinceAthenaSeasonStart_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengesTab_C_GetAthenaEventTime) == 0x000008, "Wrong alignment on AthenaChallengesTab_C_GetAthenaEventTime");
static_assert(sizeof(AthenaChallengesTab_C_GetAthenaEventTime) == 0x000028, "Wrong size on AthenaChallengesTab_C_GetAthenaEventTime");
static_assert(offsetof(AthenaChallengesTab_C_GetAthenaEventTime, Result) == 0x000000, "Member 'AthenaChallengesTab_C_GetAthenaEventTime::Result' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_GetAthenaEventTime, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaChallengesTab_C_GetAthenaEventTime::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengesTab_C_GetAthenaEventTime, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'AthenaChallengesTab_C_GetAthenaEventTime::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
