#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemCustomizationSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C
// 0x00A8 (0x0660 - 0x05B8)
class UAthenaItemCustomizationSelector_C final : public UAthenaItemSelectorScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaLockedStyleNotification_C*       LockedNotification;                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MainSafeZone;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_MainContent;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_SaveAndExit;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlotImage;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBox_LockerRoomMode;                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  WidgetSwitcher_InteractionMethod;                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  WidgetSwitcher_ItemEditor;                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               UIManager;                                         // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ProgressModal;                                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShowSaveProgressModalDelegate;                     // 0x0630(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    FavoriteInputActionRow;                            // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         CurrentSubslotIndexBeingPopulated;                 // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPickingStyle;                                     // 0x064C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FadeHeaderBackInTimer;                             // 0x0650(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         HowLongToShowItemHeader;                           // 0x0658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFadingItemHeaderOut;                              // 0x065C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaItemCustomizationSelector(int32 EntryPoint);
	void FadeItemHeaderBackIn();
	void ZoomInputGiven();
	void RotationInputGiven();
	void BndEvt__Picker_ItemSelector_K2Node_ComponentBoundEvent_2_OnUpdateSaveButtonVisuals__DelegateSignature();
	void BndEvt__Picker_ItemSelector_K2Node_ComponentBoundEvent_1_OnUpdateSaveButtonVisuals__DelegateSignature();
	void OnFinsihedItemSetup(const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName, EAthenaCustomizationCategory SelectedCategory);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	void OnTabSelectionChanged(bool bShowingVariants);
	void BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature(const struct FGameplayTag& VariantChannel, const struct FGameplayTag& VariantTag, bool IsOwned);
	void OnActivated();
	void OnSavingItemStarted();
	void OnFinsihedItemSave();
	void BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void Construct();
	void HandleBack(bool* PassThrough);
	void ToggleFavorite(bool* PassThrough);
	class UWidget* GetWidgetForFramingViewedItem();
	void ShowSavingModal();
	void GetCurrentItemCosmeticDefinition(class UAthenaCosmeticItemDefinition** Cosmetic_Item_Definition);
	void UpdateToggleFavoriteVisibility(class UFortItem* Item);
	void UpdateEditStyleButton(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaItemCustomizationSelector_C">();
	}
	static class UAthenaItemCustomizationSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemCustomizationSelector_C>();
	}
};
static_assert(alignof(UAthenaItemCustomizationSelector_C) == 0x000008, "Wrong alignment on UAthenaItemCustomizationSelector_C");
static_assert(sizeof(UAthenaItemCustomizationSelector_C) == 0x000660, "Wrong size on UAthenaItemCustomizationSelector_C");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, UberGraphFrame) == 0x0005B8, "Member 'UAthenaItemCustomizationSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ItemInfoIntroOutro) == 0x0005C0, "Member 'UAthenaItemCustomizationSelector_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, Intro) == 0x0005C8, "Member 'UAthenaItemCustomizationSelector_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, CameraFramingWidget) == 0x0005D0, "Member 'UAthenaItemCustomizationSelector_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, LockedNotification) == 0x0005D8, "Member 'UAthenaItemCustomizationSelector_C::LockedNotification' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, MainSafeZone) == 0x0005E0, "Member 'UAthenaItemCustomizationSelector_C::MainSafeZone' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SB_MainContent) == 0x0005E8, "Member 'UAthenaItemCustomizationSelector_C::SB_MainContent' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SB_SaveAndExit) == 0x0005F0, "Member 'UAthenaItemCustomizationSelector_C::SB_SaveAndExit' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ShortDescriptionText) == 0x0005F8, "Member 'UAthenaItemCustomizationSelector_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, SlotImage) == 0x000600, "Member 'UAthenaItemCustomizationSelector_C::SlotImage' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, TextBox_LockerRoomMode) == 0x000608, "Member 'UAthenaItemCustomizationSelector_C::TextBox_LockerRoomMode' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, WidgetSwitcher_InteractionMethod) == 0x000610, "Member 'UAthenaItemCustomizationSelector_C::WidgetSwitcher_InteractionMethod' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, WidgetSwitcher_ItemEditor) == 0x000618, "Member 'UAthenaItemCustomizationSelector_C::WidgetSwitcher_ItemEditor' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, UIManager) == 0x000620, "Member 'UAthenaItemCustomizationSelector_C::UIManager' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ProgressModal) == 0x000628, "Member 'UAthenaItemCustomizationSelector_C::ProgressModal' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, ShowSaveProgressModalDelegate) == 0x000630, "Member 'UAthenaItemCustomizationSelector_C::ShowSaveProgressModalDelegate' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, FavoriteInputActionRow) == 0x000638, "Member 'UAthenaItemCustomizationSelector_C::FavoriteInputActionRow' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, CurrentSubslotIndexBeingPopulated) == 0x000648, "Member 'UAthenaItemCustomizationSelector_C::CurrentSubslotIndexBeingPopulated' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, bPickingStyle) == 0x00064C, "Member 'UAthenaItemCustomizationSelector_C::bPickingStyle' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, FadeHeaderBackInTimer) == 0x000650, "Member 'UAthenaItemCustomizationSelector_C::FadeHeaderBackInTimer' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, HowLongToShowItemHeader) == 0x000658, "Member 'UAthenaItemCustomizationSelector_C::HowLongToShowItemHeader' has a wrong offset!");
static_assert(offsetof(UAthenaItemCustomizationSelector_C, bFadingItemHeaderOut) == 0x00065C, "Member 'UAthenaItemCustomizationSelector_C::bFadingItemHeaderOut' has a wrong offset!");

}

