#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonLevelConfirmationScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonLevelConfirmationScreen.AthenaSeasonLevelConfirmationScreen_C
// 0x0110 (0x0550 - 0x0440)
class UAthenaSeasonLevelConfirmationScreen_C final : public UFortActivatablePanelWithItemPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaDirectAcquisitonDetails_RefundDisclaimer_C* AthenaDirectAcquisitonDetails_RefundDisclaimer;    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BulkMessageAlertSB;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BulkTierMessage;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ConfirmState;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         DecreasePurchaseTier;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FramingWidget;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         IncreasePurchaseTier;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemRewardsSB;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseBtn;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PurchasingState;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  StateSwitcher;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TierTitle;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuckIcon;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VBuckPurchasePrice;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, class UFortSeasonPassLevelInfo*>  AllBattlePassLevels;                               // 0x04C0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortSeasonPassLevelInfo*               BaseLevel;                                         // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BuyExtraLevels;                                    // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxBattlePassLevel;                                // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BuyTierOfferID;                                    // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MaxExtraLevelsYouCanBuyInOneGo;                    // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonReward_C*                  FirstWidget;                                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Handle_BackAction;                                 // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaSeasonLevelConfirmationScreen(int32 EntryPoint);
	void OnActivated();
	void Construct();
	void BndEvt__DecreasePurchaseTier_K2Node_ComponentBoundEvent_429_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IncreasePurchaseTier_K2Node_ComponentBoundEvent_396_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnPurchaseFinished(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void InitWidgets();
	void Setup(class UFortSeasonPassLevelInfo* Level, TMap<int32, class UFortSeasonPassLevelInfo*>& AllLevels, int32 MaxLevel);
	void GetHeaderText(class FText* Result, int32* TierPurchaseNumber);
	void GetRewards(TArray<class UFortItem*>* Output_Get);
	class FText GetVBuckPrice();
	int32 GetNumberOfTiersBuying();
	void GenerateItemWidgets();
	void ModifyNumberOfTiersToBuy(int32 Delta);
	void HandleBack(bool* bPassThrough);
	void SelectReward();
	class UWidget* GetWidgetForFramingViewedItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonLevelConfirmationScreen_C">();
	}
	static class UAthenaSeasonLevelConfirmationScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonLevelConfirmationScreen_C>();
	}
};
static_assert(alignof(UAthenaSeasonLevelConfirmationScreen_C) == 0x000008, "Wrong alignment on UAthenaSeasonLevelConfirmationScreen_C");
static_assert(sizeof(UAthenaSeasonLevelConfirmationScreen_C) == 0x000550, "Wrong size on UAthenaSeasonLevelConfirmationScreen_C");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, UberGraphFrame) == 0x000440, "Member 'UAthenaSeasonLevelConfirmationScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, AthenaDirectAcquisitonDetails_RefundDisclaimer) == 0x000448, "Member 'UAthenaSeasonLevelConfirmationScreen_C::AthenaDirectAcquisitonDetails_RefundDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, BulkMessageAlertSB) == 0x000450, "Member 'UAthenaSeasonLevelConfirmationScreen_C::BulkMessageAlertSB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, BulkTierMessage) == 0x000458, "Member 'UAthenaSeasonLevelConfirmationScreen_C::BulkTierMessage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, ConfirmState) == 0x000460, "Member 'UAthenaSeasonLevelConfirmationScreen_C::ConfirmState' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, DecreasePurchaseTier) == 0x000468, "Member 'UAthenaSeasonLevelConfirmationScreen_C::DecreasePurchaseTier' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, FramingWidget) == 0x000470, "Member 'UAthenaSeasonLevelConfirmationScreen_C::FramingWidget' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, HeaderText) == 0x000478, "Member 'UAthenaSeasonLevelConfirmationScreen_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, IncreasePurchaseTier) == 0x000480, "Member 'UAthenaSeasonLevelConfirmationScreen_C::IncreasePurchaseTier' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, ItemRewardsSB) == 0x000488, "Member 'UAthenaSeasonLevelConfirmationScreen_C::ItemRewardsSB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, PurchaseBtn) == 0x000490, "Member 'UAthenaSeasonLevelConfirmationScreen_C::PurchaseBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, PurchasingState) == 0x000498, "Member 'UAthenaSeasonLevelConfirmationScreen_C::PurchasingState' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, StateSwitcher) == 0x0004A0, "Member 'UAthenaSeasonLevelConfirmationScreen_C::StateSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, TierTitle) == 0x0004A8, "Member 'UAthenaSeasonLevelConfirmationScreen_C::TierTitle' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, VBuckIcon) == 0x0004B0, "Member 'UAthenaSeasonLevelConfirmationScreen_C::VBuckIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, VBuckPurchasePrice) == 0x0004B8, "Member 'UAthenaSeasonLevelConfirmationScreen_C::VBuckPurchasePrice' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, AllBattlePassLevels) == 0x0004C0, "Member 'UAthenaSeasonLevelConfirmationScreen_C::AllBattlePassLevels' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, BaseLevel) == 0x000510, "Member 'UAthenaSeasonLevelConfirmationScreen_C::BaseLevel' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, BuyExtraLevels) == 0x000518, "Member 'UAthenaSeasonLevelConfirmationScreen_C::BuyExtraLevels' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, MaxBattlePassLevel) == 0x00051C, "Member 'UAthenaSeasonLevelConfirmationScreen_C::MaxBattlePassLevel' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, BuyTierOfferID) == 0x000520, "Member 'UAthenaSeasonLevelConfirmationScreen_C::BuyTierOfferID' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, MaxExtraLevelsYouCanBuyInOneGo) == 0x000530, "Member 'UAthenaSeasonLevelConfirmationScreen_C::MaxExtraLevelsYouCanBuyInOneGo' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, FirstWidget) == 0x000538, "Member 'UAthenaSeasonLevelConfirmationScreen_C::FirstWidget' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelConfirmationScreen_C, Handle_BackAction) == 0x000540, "Member 'UAthenaSeasonLevelConfirmationScreen_C::Handle_BackAction' has a wrong offset!");

}

