#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingPlayButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingPlayButton.AthenaMatchmakingPlayButton_C.ExecuteUbergraph_AthenaMatchmakingPlayButton
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton) == 0x000008, "Wrong alignment on AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton");
static_assert(sizeof(AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton) == 0x000018, "Wrong size on AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton");
static_assert(offsetof(AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton, K2Node_Event_IsDesignTime) == 0x000010, "Member 'AthenaMatchmakingPlayButton_C_ExecuteUbergraph_AthenaMatchmakingPlayButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function AthenaMatchmakingPlayButton.AthenaMatchmakingPlayButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingPlayButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlayButton_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaMatchmakingPlayButton_C_PreConstruct");
static_assert(sizeof(AthenaMatchmakingPlayButton_C_PreConstruct) == 0x000001, "Wrong size on AthenaMatchmakingPlayButton_C_PreConstruct");
static_assert(offsetof(AthenaMatchmakingPlayButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaMatchmakingPlayButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaMatchmakingPlayButton.AthenaMatchmakingPlayButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingPlayButton_C_SetButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaMatchmakingPlayButton_C_SetButtonText) == 0x000008, "Wrong alignment on AthenaMatchmakingPlayButton_C_SetButtonText");
static_assert(sizeof(AthenaMatchmakingPlayButton_C_SetButtonText) == 0x000018, "Wrong size on AthenaMatchmakingPlayButton_C_SetButtonText");
static_assert(offsetof(AthenaMatchmakingPlayButton_C_SetButtonText, InText) == 0x000000, "Member 'AthenaMatchmakingPlayButton_C_SetButtonText::InText' has a wrong offset!");

}

