#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationPicker

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.ExecuteUbergraph_AthenaCustomizationPicker
// 0x0038 (0x0038 - 0x0000)
struct AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetQualifiedFilterDisplayName_ReturnValue; // 0x0008(0x0018)()
	class FText                                   K2Node_Event_EmptyDisplayText;                     // 0x0020(0x0018)(ConstParm)
};
static_assert(alignof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker");
static_assert(sizeof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker) == 0x000038, "Wrong size on AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, EntryPoint) == 0x000000, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, CallFunc_GetQualifiedFilterDisplayName_ReturnValue) == 0x000008, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::CallFunc_GetQualifiedFilterDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker, K2Node_Event_EmptyDisplayText) == 0x000020, "Member 'AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker::K2Node_Event_EmptyDisplayText' has a wrong offset!");

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.OnNoItemsAvailableInFilter
// 0x0018 (0x0018 - 0x0000)
struct AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter final
{
public:
	class FText                                   EmptyDisplayText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter) == 0x000008, "Wrong alignment on AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter");
static_assert(sizeof(AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter) == 0x000018, "Wrong size on AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter");
static_assert(offsetof(AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter, EmptyDisplayText) == 0x000000, "Member 'AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter::EmptyDisplayText' has a wrong offset!");

}

