#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTabsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTabsScreen.AthenaTabsScreen_C
// 0x00E0 (0x0490 - 0x03B0)
class UAthenaTabsScreen_C final : public UFortAthenaTabsScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroTabLabel;                                     // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentTab;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSZAwareImage*                      FriendInviteBang;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMainTabBar;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxContainer;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      LargeMenuButton;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      MainMenuButton;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonContainer;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayContent;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySocial;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZoneContent;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxMenu;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxSocial;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTabLabel;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxVbucks;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Social;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  TopTabContentWidgetSwitcher;                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   LastActiveTabId;                                   // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnclaimedResearchBangThreshold;                    // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           UnclaimedResearchPointsHandle;                     // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTopBar_C*                              TopBar;                                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  HotfixDisableArray;                                // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UCommonButton*>                  HotfixButtonArray;                                 // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaTabsScreen(int32 EntryPoint);
	void BndEvt__LargeMenuButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetOnlineFriendsCount(int32 NewOnlineFriendsCount);
	void SetActiveInvitesCount(int32 NewActiveInvitesCount);
	void ShowReplayBrowser();
	void DisableTabsHotfixedOffTabs(class FName TabId, class UCommonButton* NewParam);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Social_K2Node_ComponentBoundEvent_89_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandleTabContentCreated(class FName TabId, class UCommonUserWidget* TabWidget);
	void OnDeactivated();
	void BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void BndEvt__TopTabList_K2Node_ComponentBoundEvent_0_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void OnActivated();
	void Construct();
	void HandleTabCreated(class FName TabId, class UCommonButton* TabButton);
	void HandleTabSelected(class FName TabName);
	void SetTopBar(class UTopBar_C* InTopbar);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTabsScreen_C">();
	}
	static class UAthenaTabsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTabsScreen_C>();
	}
};
static_assert(alignof(UAthenaTabsScreen_C) == 0x000008, "Wrong alignment on UAthenaTabsScreen_C");
static_assert(sizeof(UAthenaTabsScreen_C) == 0x000490, "Wrong size on UAthenaTabsScreen_C");
static_assert(offsetof(UAthenaTabsScreen_C, UberGraphFrame) == 0x0003B0, "Member 'UAthenaTabsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, IntroTabLabel) == 0x0003B8, "Member 'UAthenaTabsScreen_C::IntroTabLabel' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, CurrentTab) == 0x0003C0, "Member 'UAthenaTabsScreen_C::CurrentTab' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, FriendInviteBang) == 0x0003C8, "Member 'UAthenaTabsScreen_C::FriendInviteBang' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, HBoxMainTabBar) == 0x0003D0, "Member 'UAthenaTabsScreen_C::HBoxMainTabBar' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, HorizontalBoxContainer) == 0x0003D8, "Member 'UAthenaTabsScreen_C::HorizontalBoxContainer' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, LargeMenuButton) == 0x0003E0, "Member 'UAthenaTabsScreen_C::LargeMenuButton' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, MainMenuButton) == 0x0003E8, "Member 'UAthenaTabsScreen_C::MainMenuButton' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, MTXButton) == 0x0003F0, "Member 'UAthenaTabsScreen_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, MTXButtonContainer) == 0x0003F8, "Member 'UAthenaTabsScreen_C::MTXButtonContainer' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, NormalBangWrapper) == 0x000400, "Member 'UAthenaTabsScreen_C::NormalBangWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, OverlayContent) == 0x000408, "Member 'UAthenaTabsScreen_C::OverlayContent' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, OverlaySocial) == 0x000410, "Member 'UAthenaTabsScreen_C::OverlaySocial' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SafeZoneContent) == 0x000418, "Member 'UAthenaTabsScreen_C::SafeZoneContent' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SizeBoxMenu) == 0x000420, "Member 'UAthenaTabsScreen_C::SizeBoxMenu' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SizeBoxSocial) == 0x000428, "Member 'UAthenaTabsScreen_C::SizeBoxSocial' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SizeBoxTabLabel) == 0x000430, "Member 'UAthenaTabsScreen_C::SizeBoxTabLabel' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, SizeBoxVbucks) == 0x000438, "Member 'UAthenaTabsScreen_C::SizeBoxVbucks' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, Social) == 0x000440, "Member 'UAthenaTabsScreen_C::Social' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, TopTabContentWidgetSwitcher) == 0x000448, "Member 'UAthenaTabsScreen_C::TopTabContentWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, LastActiveTabId) == 0x000450, "Member 'UAthenaTabsScreen_C::LastActiveTabId' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, UnclaimedResearchBangThreshold) == 0x000458, "Member 'UAthenaTabsScreen_C::UnclaimedResearchBangThreshold' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, UnclaimedResearchPointsHandle) == 0x000460, "Member 'UAthenaTabsScreen_C::UnclaimedResearchPointsHandle' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, TopBar) == 0x000468, "Member 'UAthenaTabsScreen_C::TopBar' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, HotfixDisableArray) == 0x000470, "Member 'UAthenaTabsScreen_C::HotfixDisableArray' has a wrong offset!");
static_assert(offsetof(UAthenaTabsScreen_C, HotfixButtonArray) == 0x000480, "Member 'UAthenaTabsScreen_C::HotfixButtonArray' has a wrong offset!");

}

