#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingModeButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C.ExecuteUbergraph_AthenaMatchmakingModeButton
// 0x00E8 (0x00E8 - 0x0000)
struct AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                K2Node_Event_TabLabelInfo;                         // 0x0008(0x00A0)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton) == 0x000008, "Wrong alignment on AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton");
static_assert(sizeof(AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton) == 0x0000E8, "Wrong size on AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton");
static_assert(offsetof(AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton, K2Node_Event_TabLabelInfo) == 0x000008, "Member 'AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton::K2Node_Event_TabLabelInfo' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton, K2Node_Event_MyGeometry) == 0x0000A8, "Member 'AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton, K2Node_Event_InDeltaTime) == 0x0000E0, "Member 'AthenaMatchmakingModeButton_C_ExecuteUbergraph_AthenaMatchmakingModeButton::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct AthenaMatchmakingModeButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingModeButton_C_Tick) == 0x000004, "Wrong alignment on AthenaMatchmakingModeButton_C_Tick");
static_assert(sizeof(AthenaMatchmakingModeButton_C_Tick) == 0x00003C, "Wrong size on AthenaMatchmakingModeButton_C_Tick");
static_assert(offsetof(AthenaMatchmakingModeButton_C_Tick, MyGeometry) == 0x000000, "Member 'AthenaMatchmakingModeButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_Tick, InDeltaTime) == 0x000038, "Member 'AthenaMatchmakingModeButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C.SetTabLabelInfo
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaMatchmakingModeButton_C_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingModeButton_C_SetTabLabelInfo) == 0x000008, "Wrong alignment on AthenaMatchmakingModeButton_C_SetTabLabelInfo");
static_assert(sizeof(AthenaMatchmakingModeButton_C_SetTabLabelInfo) == 0x0000A0, "Wrong size on AthenaMatchmakingModeButton_C_SetTabLabelInfo");
static_assert(offsetof(AthenaMatchmakingModeButton_C_SetTabLabelInfo, TabLabelInfo) == 0x000000, "Member 'AthenaMatchmakingModeButton_C_SetTabLabelInfo::TabLabelInfo' has a wrong offset!");

// Function AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C.PlaylistChanged
// 0x01A8 (0x01A8 - 0x0000)
struct AthenaMatchmakingModeButton_C_PlaylistChanged final
{
public:
	class UFortPlaylistAthena*                    NewPlaylist;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OverrideName;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0028(0x0088)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue1;        // 0x00B8(0x0088)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0140(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0178(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0190(0x0018)()
};
static_assert(alignof(AthenaMatchmakingModeButton_C_PlaylistChanged) == 0x000008, "Wrong alignment on AthenaMatchmakingModeButton_C_PlaylistChanged");
static_assert(sizeof(AthenaMatchmakingModeButton_C_PlaylistChanged) == 0x0001A8, "Wrong size on AthenaMatchmakingModeButton_C_PlaylistChanged");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, NewPlaylist) == 0x000000, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::NewPlaylist' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, OverrideName) == 0x000008, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::OverrideName' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_byte_Variable) == 0x000020, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_TextIsEmpty_ReturnValue) == 0x000021, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000022, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000028, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_BooleanOR_ReturnValue) == 0x0000B0, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_MakeBrushFromTexture_ReturnValue1) == 0x0000B8, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_MakeBrushFromTexture_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_TextToUpper_ReturnValue) == 0x000140, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_TextIsEmpty_ReturnValue1) == 0x000158, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_TextIsEmpty_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_bool_Variable) == 0x000159, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_byte_Variable1) == 0x00015A, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_byte_Variable2) == 0x00015B, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_byte_Variable3) == 0x00015C, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, K2Node_Select_Default) == 0x00015D, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_bool_Variable1) == 0x00015E, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_byte_Variable4) == 0x00015F, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, K2Node_Select1_Default) == 0x000160, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_PlayAnimation_ReturnValue) == 0x000168, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_byte_Variable5) == 0x000170, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_bool_Variable2) == 0x000171, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, Temp_bool_Variable3) == 0x000172, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, K2Node_Select2_Default) == 0x000173, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, K2Node_Select3_Default) == 0x000178, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_PlaylistChanged, CallFunc_TextToUpper_ReturnValue1) == 0x000190, "Member 'AthenaMatchmakingModeButton_C_PlaylistChanged::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");

// Function AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C.SetSquadFillText
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingModeButton_C_SetSquadFillText final
{
public:
	bool                                          bFill;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingModeButton_C_SetSquadFillText) == 0x000001, "Wrong alignment on AthenaMatchmakingModeButton_C_SetSquadFillText");
static_assert(sizeof(AthenaMatchmakingModeButton_C_SetSquadFillText) == 0x000001, "Wrong size on AthenaMatchmakingModeButton_C_SetSquadFillText");
static_assert(offsetof(AthenaMatchmakingModeButton_C_SetSquadFillText, bFill) == 0x000000, "Member 'AthenaMatchmakingModeButton_C_SetSquadFillText::bFill' has a wrong offset!");

// Function AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C.RefreshFillText
// 0x0020 (0x0020 - 0x0000)
struct AthenaMatchmakingModeButton_C_RefreshFillText final
{
public:
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMatchmakingFillText_ReturnValue;       // 0x0008(0x0018)()
};
static_assert(alignof(AthenaMatchmakingModeButton_C_RefreshFillText) == 0x000008, "Wrong alignment on AthenaMatchmakingModeButton_C_RefreshFillText");
static_assert(sizeof(AthenaMatchmakingModeButton_C_RefreshFillText) == 0x000020, "Wrong size on AthenaMatchmakingModeButton_C_RefreshFillText");
static_assert(offsetof(AthenaMatchmakingModeButton_C_RefreshFillText, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaMatchmakingModeButton_C_RefreshFillText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingModeButton_C_RefreshFillText, CallFunc_GetMatchmakingFillText_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingModeButton_C_RefreshFillText::CallFunc_GetMatchmakingFillText_ReturnValue' has a wrong offset!");

}

