#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingModeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingModeButton.AthenaMatchmakingModeButton_C
// 0x0068 (0x0B98 - 0x0B30)
class UAthenaMatchmakingModeButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmSelection;                                  // 0x0B38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionFlash;                             // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FillSettingText;                                   // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeGlow;                                      // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GameModeName;                                      // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IconSpacer;                                        // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LTMModeSubIcon;                                    // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubGameModeName;                                   // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubGameModeNameHB;                                 // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FillSquad;                                         // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaMatchmakingModeButton(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void PlaylistChanged(class UFortPlaylistAthena* NewPlaylist, const class FText& OverrideName);
	void SetSquadFillText(bool bFill);
	void RefreshFillText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingModeButton_C">();
	}
	static class UAthenaMatchmakingModeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingModeButton_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingModeButton_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingModeButton_C");
static_assert(sizeof(UAthenaMatchmakingModeButton_C) == 0x000B98, "Wrong size on UAthenaMatchmakingModeButton_C");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, UberGraphFrame) == 0x000B30, "Member 'UAthenaMatchmakingModeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, ConfirmSelection) == 0x000B38, "Member 'UAthenaMatchmakingModeButton_C::ConfirmSelection' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, ConfirmSelectionFlash) == 0x000B40, "Member 'UAthenaMatchmakingModeButton_C::ConfirmSelectionFlash' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, ConfirmSelectionShine) == 0x000B48, "Member 'UAthenaMatchmakingModeButton_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, FillSettingText) == 0x000B50, "Member 'UAthenaMatchmakingModeButton_C::FillSettingText' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, GameModeGlow) == 0x000B58, "Member 'UAthenaMatchmakingModeButton_C::GameModeGlow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, GameModeIcon) == 0x000B60, "Member 'UAthenaMatchmakingModeButton_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, GameModeName) == 0x000B68, "Member 'UAthenaMatchmakingModeButton_C::GameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, IconSpacer) == 0x000B70, "Member 'UAthenaMatchmakingModeButton_C::IconSpacer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, LTMModeSubIcon) == 0x000B78, "Member 'UAthenaMatchmakingModeButton_C::LTMModeSubIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, SubGameModeName) == 0x000B80, "Member 'UAthenaMatchmakingModeButton_C::SubGameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, SubGameModeNameHB) == 0x000B88, "Member 'UAthenaMatchmakingModeButton_C::SubGameModeNameHB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingModeButton_C, FillSquad) == 0x000B90, "Member 'UAthenaMatchmakingModeButton_C::FillSquad' has a wrong offset!");

}

