#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStatsRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaStatsRow.AthenaStatsRow_C
// 0x0038 (0x0278 - 0x0240)
class UAthenaStatsRow_C final : public UFortProfileStatsRow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Name_AthenaStatsRow_C;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   StatName;                                          // 0x0250(0x0018)(Edit, BlueprintVisible)
	class FString                                 BaseGameplayTag;                                   // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaStatsRow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetStatValueAsText(const class FText& StatValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaStatsRow_C">();
	}
	static class UAthenaStatsRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaStatsRow_C>();
	}
};
static_assert(alignof(UAthenaStatsRow_C) == 0x000008, "Wrong alignment on UAthenaStatsRow_C");
static_assert(sizeof(UAthenaStatsRow_C) == 0x000278, "Wrong size on UAthenaStatsRow_C");
static_assert(offsetof(UAthenaStatsRow_C, UberGraphFrame) == 0x000240, "Member 'UAthenaStatsRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaStatsRow_C, Name_AthenaStatsRow_C) == 0x000248, "Member 'UAthenaStatsRow_C::Name_AthenaStatsRow_C' has a wrong offset!");
static_assert(offsetof(UAthenaStatsRow_C, StatName) == 0x000250, "Member 'UAthenaStatsRow_C::StatName' has a wrong offset!");
static_assert(offsetof(UAthenaStatsRow_C, BaseGameplayTag) == 0x000268, "Member 'UAthenaStatsRow_C::BaseGameplayTag' has a wrong offset!");

}

