#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C
// 0x0120 (0x04E0 - 0x03C0)
class UAthenaDirectAcquisitionScreen_C final : public UFortDirectAcquisitionWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Entrance;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         AffilateInfo;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AffiliateName;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderPlatformMTX;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDateTimeTextBlock*               DayCountdown;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFancyToastWidget_C*                    FancyToastWidget;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxOffers;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LargeTileHB;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayProgressSpinner;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             SmallTileGP;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SplitCurrencyText;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherItemsProgress;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOffers;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDateTimeTextBlock*               WeekCountdown;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            FirstOfferGenerated;                               // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TilePadding;                                       // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CycleTimer;                                        // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaDirectAcquisitionOfferWidget_C*> CycledOffersWidgets;                               // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<class FString, class UAthenaDirectAcquisitionOfferWidget_C*> CategorizedOfferWidgets;                           // 0x0478(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FDataTableRowHandle                    AffiliateButton;                                   // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UFortItemDefinition*                    AffiliateRewardItem;                               // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaDirectAcquisitionScreen(int32 EntryPoint);
	void OnDisplayToast(const bool bDisplayToast);
	void OnAffiliateUpdated(const class FString& Param_AffiliateName);
	void Construct();
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, const class FText& CurrencyMessageLocText);
	void ClearOfferWidgets();
	void OnActivated();
	void OnOffersGenerated();
	void OnStartReadingOffers();
	void NoOffersAvailable();
	void GenerateOfferWidget(class UFortStoreFrontOfferInfo* OfferData);
	void Focus();
	void Handle_AffiliateButton(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionScreen_C">();
	}
	static class UAthenaDirectAcquisitionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionScreen_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionScreen_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionScreen_C");
static_assert(sizeof(UAthenaDirectAcquisitionScreen_C) == 0x0004E0, "Wrong size on UAthenaDirectAcquisitionScreen_C");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, UberGraphFrame) == 0x0003C0, "Member 'UAthenaDirectAcquisitionScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, Entrance) == 0x0003C8, "Member 'UAthenaDirectAcquisitionScreen_C::Entrance' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, AffilateInfo) == 0x0003D0, "Member 'UAthenaDirectAcquisitionScreen_C::AffilateInfo' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, AffiliateName) == 0x0003D8, "Member 'UAthenaDirectAcquisitionScreen_C::AffiliateName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, BorderPlatformMTX) == 0x0003E0, "Member 'UAthenaDirectAcquisitionScreen_C::BorderPlatformMTX' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, DayCountdown) == 0x0003E8, "Member 'UAthenaDirectAcquisitionScreen_C::DayCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, FancyToastWidget) == 0x0003F0, "Member 'UAthenaDirectAcquisitionScreen_C::FancyToastWidget' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, HBoxOffers) == 0x0003F8, "Member 'UAthenaDirectAcquisitionScreen_C::HBoxOffers' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, LargeTileHB) == 0x000400, "Member 'UAthenaDirectAcquisitionScreen_C::LargeTileHB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, NoOffersBox) == 0x000408, "Member 'UAthenaDirectAcquisitionScreen_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, OverlayProgressSpinner) == 0x000410, "Member 'UAthenaDirectAcquisitionScreen_C::OverlayProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, ProgressSpinner) == 0x000418, "Member 'UAthenaDirectAcquisitionScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, SmallTileGP) == 0x000420, "Member 'UAthenaDirectAcquisitionScreen_C::SmallTileGP' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, SplitCurrencyText) == 0x000428, "Member 'UAthenaDirectAcquisitionScreen_C::SplitCurrencyText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, SwitcherItemsProgress) == 0x000430, "Member 'UAthenaDirectAcquisitionScreen_C::SwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, VBOffers) == 0x000438, "Member 'UAthenaDirectAcquisitionScreen_C::VBOffers' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, WeekCountdown) == 0x000440, "Member 'UAthenaDirectAcquisitionScreen_C::WeekCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, FirstOfferGenerated) == 0x000448, "Member 'UAthenaDirectAcquisitionScreen_C::FirstOfferGenerated' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, TilePadding) == 0x000450, "Member 'UAthenaDirectAcquisitionScreen_C::TilePadding' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, CycleTimer) == 0x000460, "Member 'UAthenaDirectAcquisitionScreen_C::CycleTimer' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, CycledOffersWidgets) == 0x000468, "Member 'UAthenaDirectAcquisitionScreen_C::CycledOffersWidgets' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, CategorizedOfferWidgets) == 0x000478, "Member 'UAthenaDirectAcquisitionScreen_C::CategorizedOfferWidgets' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, AffiliateButton) == 0x0004C8, "Member 'UAthenaDirectAcquisitionScreen_C::AffiliateButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionScreen_C, AffiliateRewardItem) == 0x0004D8, "Member 'UAthenaDirectAcquisitionScreen_C::AffiliateRewardItem' has a wrong offset!");

}

