#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionMTXDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails
// 0x01C0 (0x01C0 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAccountContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentSeasonNumber_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess1;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             K2Node_CustomEvent_PurchasedItems;                 // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0048(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOfferId_ReturnValue;                   // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue1;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPriceInMTX_ReturnValue;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue2;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetOfferId_ReturnValue1;                  // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue3;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOfferId_ReturnValue2;                  // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOfferPurchaseError                           CallFunc_CanPurchaseOffer_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOfferPurchaseError                           CallFunc_PurchaseOffer_ReturnValue;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_Passthrough;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue4;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiftable_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOfferId_ReturnValue3;                  // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOfferPurchaseError                           CallFunc_CanGiftOffer_ReturnValue;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue5;                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGiftingScreen_C*                       CallFunc_Create_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue1;          // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue5;                // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue6;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate2;             // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x01B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails) == 0x0001C0, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetCurrentSeasonNumber_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetCurrentSeasonNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_CustomEvent_bSuccess1) == 0x000014, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_CustomEvent_bSuccess1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_CustomEvent_PurchasedItems) == 0x000018, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_CustomEvent_PurchasedItems' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue1) == 0x000040, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_MakeStruct_DataTableRowHandle) == 0x000048, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetUINavigationManager_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferInfo_ReturnValue) == 0x000070, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferId_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferInfo_ReturnValue1) == 0x000088, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, Temp_byte_Variable) == 0x000090, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_IsPriceInMTX_ReturnValue) == 0x000091, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_IsPriceInMTX_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferInfo_ReturnValue2) == 0x000098, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_CreateDelegate_OutputDelegate1) == 0x0000A0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferId_ReturnValue1) == 0x0000B0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferId_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, Temp_byte_Variable1) == 0x0000C0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetUINavigationManager_ReturnValue1) == 0x0000C8, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetUINavigationManager_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferInfo_ReturnValue3) == 0x0000D0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, Temp_bool_Variable) == 0x0000D8, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferId_ReturnValue2) == 0x0000E0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferId_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue2) == 0x0000F0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_CanPurchaseOffer_ReturnValue) == 0x0000F8, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_CanPurchaseOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F9, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000100, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue3) == 0x000108, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_ComponentBoundEvent_Button2) == 0x000110, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_PurchaseOffer_ReturnValue) == 0x000118, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_PurchaseOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_HandleBack_Passthrough) == 0x000119, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_HandleBack_Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_ComponentBoundEvent_Button1) == 0x000120, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_IsMobileGame_ReturnValue) == 0x000128, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferInfo_ReturnValue4) == 0x000130, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_IsGiftable_ReturnValue) == 0x000138, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_IsGiftable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_Select_Default) == 0x000139, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferId_ReturnValue3) == 0x000140, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferId_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue4) == 0x000150, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_CanGiftOffer_ReturnValue) == 0x000158, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_CanGiftOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_ComponentBoundEvent_Button) == 0x000160, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_SwitchEnum_CmpSuccess) == 0x000168, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue5) == 0x000170, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000178, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_Create_ReturnValue) == 0x000180, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetUIManagerWidget_ReturnValue1) == 0x000188, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetUIManagerWidget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_IsMobileGame_ReturnValue1) == 0x000190, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_IsMobileGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetOfferInfo_ReturnValue5) == 0x000198, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetOfferInfo_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, CallFunc_GetContext_ReturnValue6) == 0x0001A0, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_CreateDelegate_OutputDelegate2) == 0x0001A8, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails, K2Node_CustomEvent_bSuccess) == 0x0001B8, "Member 'AthenaDirectAcquisitionMTXDetails_C_ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails::K2Node_CustomEvent_bSuccess' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.HandleRealMoneyPurchaseComplete
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete) == 0x000001, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete, bSuccess) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_HandleRealMoneyPurchaseComplete::bSuccess' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_BndEvt__GiftButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.HandlePurchaseComplete
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             PurchasedItems;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete) == 0x000018, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete, bSuccess) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete, PurchasedItems) == 0x000008, "Member 'AthenaDirectAcquisitionMTXDetails_C_HandlePurchaseComplete::PurchasedItems' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_HandleBack) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_HandleBack");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_HandleBack) == 0x000001, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_HandleBack");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_HandleBack, PassThrough) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_HandleBack::PassThrough' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.Init
// 0x0260 (0x0260 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_Init final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	int32                                         CallFunc_GetBaseQuantity_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBonusQuantity_ReturnValue1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0060(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetFortStoreOfferType_ReturnValue;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue2;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortMtxDetailsAttribute>       CallFunc_GetDetailsAttributes_ReturnValue;         // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMtxDetailsAttribute               CallFunc_Array_Get_Item;                           // 0x00A8(0x0030)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue3;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSalePrice_SalePrice;                   // 0x00F8(0x0018)()
	bool                                          CallFunc_GetSalePrice_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNormalPrice_ReturnValue;               // 0x0118(0x0018)()
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0130(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0148(0x0018)()
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue4;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetBackground_ReturnValue;                // 0x016C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMtxGradient                       CallFunc_GetGradient_ReturnValue;                  // 0x017C(0x0020)(NoDestructor)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetDetailsImage_ReturnValue;              // 0x01A0(0x0088)()
	bool                                          Temp_bool_Variable1;                               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     CallFunc_Create_ReturnValue;                       // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue1;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_Init) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_Init");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_Init) == 0x000260, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_Init");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_byte_Variable) == 0x00000C, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_byte_Variable1) == 0x00000D, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_bool_Variable) == 0x00000E, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue1) == 0x000018, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetBonusQuantity_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetDescription_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetBaseQuantity_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetBaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetBonusQuantity_ReturnValue1) == 0x00005C, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetBonusQuantity_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Conv_IntToText_ReturnValue1) == 0x000060, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetFortStoreOfferType_ReturnValue) == 0x000079, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetFortStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue2) == 0x000080, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000088, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetDetailsAttributes_ReturnValue) == 0x000090, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetDetailsAttributes_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0000A0, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_BooleanOR_ReturnValue) == 0x0000D8, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Array_Length_ReturnValue) == 0x0000DC, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0000E0, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x0000E1, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x0000E2, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue3) == 0x0000E8, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_byte_Variable2) == 0x0000F0, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetSalePrice_SalePrice) == 0x0000F8, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetSalePrice_SalePrice' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetSalePrice_ReturnValue) == 0x000110, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetSalePrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, K2Node_Select_Default) == 0x000111, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetNormalPrice_ReturnValue) == 0x000118, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetNormalPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetName_ReturnValue) == 0x000130, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_TextToUpper_ReturnValue) == 0x000148, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue4) == 0x000160, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_byte_Variable3) == 0x000168, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetBackground_ReturnValue) == 0x00016C, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetGradient_ReturnValue) == 0x00017C, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetGradient_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetDetailsImage_ReturnValue) == 0x0001A0, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetDetailsImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_bool_Variable1) == 0x000228, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_byte_Variable4) == 0x000229, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, K2Node_Select1_Default) == 0x00022A, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000230, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetOwningPlayer_ReturnValue) == 0x000238, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_Create_ReturnValue) == 0x000240, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000248, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_byte_Variable5) == 0x000250, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, Temp_bool_Variable2) == 0x000251, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, K2Node_Select2_Default) == 0x000252, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_Init, CallFunc_GetDynamicMaterial_ReturnValue1) == 0x000258, "Member 'AthenaDirectAcquisitionMTXDetails_C_Init::CallFunc_GetDynamicMaterial_ReturnValue1' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.PopDetails
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_PopDetails final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionMTXDetails_C_PopDetails) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionMTXDetails_C_PopDetails");
static_assert(sizeof(AthenaDirectAcquisitionMTXDetails_C_PopDetails) == 0x000008, "Wrong size on AthenaDirectAcquisitionMTXDetails_C_PopDetails");
static_assert(offsetof(AthenaDirectAcquisitionMTXDetails_C_PopDetails, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionMTXDetails_C_PopDetails::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C.InitPurchaseButton
// 0x0038 (0x0038 - 0x0000)
struct AthenaDirectAcquisitionMTXDetails_C_InitPurchaseButton final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPriceInMTX_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
