#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemCustomizationSelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ExecuteUbergraph_AthenaItemCustomizationSelector
// 0x02B8 (0x02B8 - 0x0000)
struct AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable1;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable5;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable6;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable7;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable8;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable9;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable10;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable11;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable12;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable13;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0088(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HandleBack_Passthrough;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable14;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable15;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_VariantChannel;         // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_VariantTag;             // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsOwned;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticItemDefinition*          CallFunc_GetCurrentItemCosmeticDefinition_Cosmetic_Item_Definition; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable16;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCosmeticVariant*                   CallFunc_GetVariantChannel_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetVariantUnlockRequirement_ReturnValue;  // 0x0138(0x0018)()
	bool                                          K2Node_Event_bShowingVariants;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetCurrentItem_ReturnValue;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_Event_SelectedItem;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable17;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_CategoryDisplayName;                  // 0x0178(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ItemDisplayTypeName;                  // 0x0190(0x0018)(ConstParm)
	EAthenaCustomizationCategory                  K2Node_Event_SelectedCategory;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class UItemInfoHeaderWidget_C*                K2Node_DynamicCast_AsItem_Info_Header_Widget;      // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue1;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue1;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  Temp_byte_Variable;                                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0228(0x0088)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue2;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector) == 0x0002B8, "Wrong size on AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, EntryPoint) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable1) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable2) == 0x000020, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable3) == 0x000028, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable4) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable5) == 0x000038, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable6) == 0x000040, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable7) == 0x000048, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable8) == 0x000050, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable9) == 0x000058, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable10) == 0x000060, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable11) == 0x000068, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable11' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable12) == 0x000070, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable12' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable13) == 0x000078, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable13' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_IsClosed_Variable) == 0x000080, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Has_Been_Initd_Variable) == 0x000081, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_MakeStruct_DataTableRowHandle) == 0x000088, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_HandleBack_Passthrough) == 0x0000A8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_HandleBack_Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_TabId) == 0x0000AC, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_TabButton) == 0x0000B8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x0000C0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0000D0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetContext_ReturnValue1) == 0x0000D8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable14) == 0x0000E8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable14' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable15) == 0x0000F0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable15' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_VariantChannel) == 0x0000F8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_VariantChannel' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_VariantTag) == 0x000100, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_VariantTag' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_IsOwned) == 0x000108, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_IsOwned' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetCurrentItemCosmeticDefinition_Cosmetic_Item_Definition) == 0x000110, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetCurrentItemCosmeticDefinition_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable16) == 0x000118, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable16' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue1) == 0x000120, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetVariantChannel_ReturnValue) == 0x000128, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetVariantChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue2) == 0x000130, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetVariantUnlockRequirement_ReturnValue) == 0x000138, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetVariantUnlockRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShowingVariants) == 0x000150, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShowingVariants' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetCurrentItem_ReturnValue) == 0x000158, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_SelectedItem) == 0x000160, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_SelectedItem' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue3) == 0x000168, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_object_Variable17) == 0x000170, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_object_Variable17' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_CategoryDisplayName) == 0x000178, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_ItemDisplayTypeName) == 0x000190, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_ItemDisplayTypeName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_SelectedCategory) == 0x0001A8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_SelectedCategory' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001B0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate1) == 0x0001B8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsItem_Info_Header_Widget) == 0x0001C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsItem_Info_Header_Widget' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess1) == 0x0001D0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate2) == 0x0001D4, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate3) == 0x0001E4, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000200, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_PlayAnimationForward_ReturnValue1) == 0x000208, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_PlayAnimationForward_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_PlayAnimationReverse_ReturnValue1) == 0x000210, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_PlayAnimationReverse_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_byte_Variable) == 0x000218, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Select_Default) == 0x000220, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_MakeStruct_SlateBrush) == 0x000228, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_PlayAnimationReverse_ReturnValue2) == 0x0002B0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_PlayAnimationReverse_ReturnValue2' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.OnFinsihedItemSetup
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemCustomizationSelector_C_OnFinsihedItemSetup final
{
public:
	class FText                                   CategoryDisplayName;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ItemDisplayTypeName;                               // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EAthenaCustomizationCategory                  SelectedCategory;                                  // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_OnFinsihedItemSetup) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_OnFinsihedItemSetup");
static_assert(sizeof(AthenaItemCustomizationSelector_C_OnFinsihedItemSetup) == 0x000038, "Wrong size on AthenaItemCustomizationSelector_C_OnFinsihedItemSetup");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinsihedItemSetup, CategoryDisplayName) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_OnFinsihedItemSetup::CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinsihedItemSetup, ItemDisplayTypeName) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_OnFinsihedItemSetup::ItemDisplayTypeName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinsihedItemSetup, SelectedCategory) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_OnFinsihedItemSetup::SelectedCategory' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.OnCurrentItemChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_OnCurrentItemChanged final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_OnCurrentItemChanged) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_OnCurrentItemChanged");
static_assert(sizeof(AthenaItemCustomizationSelector_C_OnCurrentItemChanged) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_OnCurrentItemChanged");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnCurrentItemChanged, SelectedItem) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_OnCurrentItemChanged::SelectedItem' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.OnTabSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemCustomizationSelector_C_OnTabSelectionChanged final
{
public:
	bool                                          bShowingVariants;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_OnTabSelectionChanged) == 0x000001, "Wrong alignment on AthenaItemCustomizationSelector_C_OnTabSelectionChanged");
static_assert(sizeof(AthenaItemCustomizationSelector_C_OnTabSelectionChanged) == 0x000001, "Wrong size on AthenaItemCustomizationSelector_C_OnTabSelectionChanged");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnTabSelectionChanged, bShowingVariants) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_OnTabSelectionChanged::bShowingVariants' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature final
{
public:
	struct FGameplayTag                           VariantChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VariantTag;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature) == 0x000014, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature, VariantChannel) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature::VariantChannel' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature, VariantTag) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature::VariantTag' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature, IsOwned) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_BndEvt__Picker_VariantSelector_K2Node_ComponentBoundEvent_0_OnVariantChangedEvent__DelegateSignature::IsOwned' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemCustomizationSelector_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_HandleBack) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_HandleBack");
static_assert(sizeof(AthenaItemCustomizationSelector_C_HandleBack) == 0x000010, "Wrong size on AthenaItemCustomizationSelector_C_HandleBack");
static_assert(offsetof(AthenaItemCustomizationSelector_C_HandleBack, PassThrough) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_HandleBack::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_HandleBack, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_HandleBack::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ToggleFavorite
// 0x0040 (0x0040 - 0x0000)
struct AthenaItemCustomizationSelector_C_ToggleFavorite final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetCurrentItem_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFavorite_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ToggleFavorite) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ToggleFavorite");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ToggleFavorite) == 0x000040, "Wrong size on AthenaItemCustomizationSelector_C_ToggleFavorite");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, PassThrough) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetCurrentItem_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, K2Node_DynamicCast_AsFort_Account_Item) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_IsFavorite_ReturnValue) == 0x000028, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_IsFavorite_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetContext_ReturnValue1) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetFeatureState_OutFeatureState) == 0x000039, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetFeatureState_OutReason) == 0x00003A, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, K2Node_SwitchEnum_CmpSuccess) == 0x00003B, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ShowSavingModal
// 0x00D8 (0x00D8 - 0x0000)
struct AthenaItemCustomizationSelector_C_ShowSavingModal final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable1;                               // 0x0018(0x0018)(ConstParm)
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0030(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ShowSavingModal) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ShowSavingModal");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ShowSavingModal) == 0x0000D8, "Wrong size on AthenaItemCustomizationSelector_C_ShowSavingModal");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, Temp_text_Variable) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, Temp_text_Variable1) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_NoResourceBrush_ReturnValue) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0000D0, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.GetCurrentItemCosmeticDefinition
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition final
{
public:
	class UAthenaCosmeticItemDefinition*          Cosmetic_Item_Definition;                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetCurrentItem_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticAccountItem*             K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition");
static_assert(sizeof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition) == 0x000038, "Wrong size on AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, Cosmetic_Item_Definition) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, CallFunc_GetCurrentItem_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000020, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000028, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.UpdateToggleFavoriteVisibility
// 0x0030 (0x0030 - 0x0000)
struct AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInputActionHandler_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility");
static_assert(sizeof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility) == 0x000030, "Wrong size on AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, Item) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_HasInputActionHandler_ReturnValue) == 0x000009, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_HasInputActionHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_IsValid_ReturnValue1) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
