#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingKnobsModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingKnobsModal.AthenaMatchmakingKnobsModal_C
// 0x0050 (0x04C0 - 0x0470)
class UAthenaMatchmakingKnobsModal_C final : public UFortMatchmakingKnobsModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ModalContent;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         DebugOptions;                                      // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                        ListItems;                                         // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaMatchmakingKnobsModal(int32 EntryPoint);
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Close();
	void OnInputModeChanged(bool bUsingGamepad);
	void Construct();
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingKnobsModal_C">();
	}
	static class UAthenaMatchmakingKnobsModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingKnobsModal_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingKnobsModal_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingKnobsModal_C");
static_assert(sizeof(UAthenaMatchmakingKnobsModal_C) == 0x0004C0, "Wrong size on UAthenaMatchmakingKnobsModal_C");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, UberGraphFrame) == 0x000470, "Member 'UAthenaMatchmakingKnobsModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Out) == 0x000478, "Member 'UAthenaMatchmakingKnobsModal_C::Out' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, In) == 0x000480, "Member 'UAthenaMatchmakingKnobsModal_C::In' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ConfirmSelectionShine) == 0x000488, "Member 'UAthenaMatchmakingKnobsModal_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Lightbox) == 0x000490, "Member 'UAthenaMatchmakingKnobsModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ModalContent) == 0x000498, "Member 'UAthenaMatchmakingKnobsModal_C::ModalContent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, DebugOptions) == 0x0004A0, "Member 'UAthenaMatchmakingKnobsModal_C::DebugOptions' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ListItems) == 0x0004B0, "Member 'UAthenaMatchmakingKnobsModal_C::ListItems' has a wrong offset!");

}

