#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferWidget

#include "Basic.hpp"

#include "GameSubCatalog_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget
// 0x01A8 (0x01A8 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             K2Node_CustomEvent_PurchasedItems;                 // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               K2Node_DynamicCast_AsFort_Store_Front_Offer_Info;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferDetailsWidget_C* CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionMTXDetails_C*   CallFunc_Create_ReturnValue1;                      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue1;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems)> K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOfferIndexAndCountText_OfferIndex;     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_OfferDisplayCount; // 0x0110(0x0018)()
	int32                                         CallFunc_GetOfferIndexAndCountText_NextOfferIndex; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount; // 0x0130(0x0018)()
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOfferIndexAndCountText_OfferIndex1;    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_OfferDisplayCount1; // 0x0160(0x0018)()
	int32                                         CallFunc_GetOfferIndexAndCountText_NextOfferIndex1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount1; // 0x0180(0x0018)()
	bool                                          CallFunc_HasGroupedOffers_ReturnValue;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGroupedOffers_ReturnValue1;            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget) == 0x0001A8, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CustomEvent_bSuccess) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CustomEvent_PurchasedItems) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CustomEvent_PurchasedItems' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_PlayAnimation_ReturnValue1) == 0x000030, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_ListItemObject) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_DynamicCast_AsFort_Store_Front_Offer_Info) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_DynamicCast_AsFort_Store_Front_Offer_Info' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferInfo_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Create_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Create_ReturnValue1) == 0x000070, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetContext_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetUIManagerWidget_ReturnValue1) == 0x000088, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetUIManagerWidget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_bIsSelected) == 0x000090, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_IsMobileGame_ReturnValue) == 0x000091, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_IsMobileGame_ReturnValue1) == 0x0000A4, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_IsMobileGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x0000A8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_bIsExpanded) == 0x0000B0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_PlayAnimation_ReturnValue2) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_MyGeometry) == 0x0000C4, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_InDeltaTime) == 0x0000FC, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000100, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_IsValid_ReturnValue1) == 0x000101, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000104, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferIndex) == 0x000108, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferDisplayCount) == 0x000110, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferDisplayCount' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferIndex) == 0x000128, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount) == 0x000130, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_FMax_ReturnValue) == 0x000148, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Get_Item) == 0x000150, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferIndex1) == 0x000158, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferIndex1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferDisplayCount1) == 0x000160, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferDisplayCount1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferIndex1) == 0x000178, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferIndex1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount1) == 0x000180, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_HasGroupedOffers_ReturnValue) == 0x000198, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_HasGroupedOffers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_HasGroupedOffers_ReturnValue1) == 0x000199, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_HasGroupedOffers_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00019A, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00019C, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x0001A0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_Tick) == 0x000004, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_Tick");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_Tick) == 0x00003C, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_Tick");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_Tick, MyGeometry) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.HandleOfferPurchaseComplete
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             PurchasedItems;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete, bSuccess) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete, PurchasedItems) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete::PurchasedItems' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.OfferSet
// 0x00E0 (0x00E0 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_OfferSet final
{
public:
	TDelegate<void(class UObject* Object)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetTileImage_ReturnValue;                 // 0x0020(0x0088)()
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDisplayAsset_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue;         // 0x00B8(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_OfferSet) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_OfferSet");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_OfferSet) == 0x0000E0, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_OfferSet");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetTileImage_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetTileImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetFirstGrantItemDefinition_ReturnValue) == 0x0000A8, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetFirstGrantItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_HasDisplayAsset_ReturnValue) == 0x0000B0, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_HasDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OfferSet, CallFunc_GetLargePreviewImage_ReturnValue) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferWidget_C_OfferSet::CallFunc_GetLargePreviewImage_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateAvailability
// 0x0148 (0x0148 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue1;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOfferId_ReturnValue;                   // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOwned_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantityRemaining_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0018)()
	int32                                         K2Node_Select1_Default;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00E0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0110(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x0130(0x0018)()
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability) == 0x000148, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable) == 0x000004, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable1) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable1) == 0x00000C, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable2) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable3) == 0x000014, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_text_Variable) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue1) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferId_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsUnique_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsOwned_ReturnValue) == 0x000059, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select_Default) == 0x00005C, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetQuantityRemaining_ReturnValue) == 0x000060, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetQuantityRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select1_Default) == 0x000080, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_MakeArray_Array) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_MakeLiteralText_ReturnValue) == 0x0000E0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_MakeLiteralText_ReturnValue1) == 0x000110, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable2) == 0x000128, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select2_Default) == 0x000130, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetupPrice
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetupPrice final
{
public:
	int32                                         PriceIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemCount_C*                           PriceWidget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPriceItem_RequiredItemCount;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetPriceItem_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetupPrice");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice) == 0x000030, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetupPrice");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, PriceIndex) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::PriceIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, PriceWidget) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::PriceWidget' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetPriceItem_RequiredItemCount) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetPriceItem_RequiredItemCount' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetPriceItem_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetPriceItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.LargeImageLoaded
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded final
{
public:
	class UObject*                                LoadedObject;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, LoadedObject) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::LoadedObject' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, K2Node_DynamicCast_AsTexture_2D) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000011, "Member 'AthenaDirectAcquisitionOfferWidget_C_LargeImageLoaded::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateName
// 0x0098 (0x0098 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateName final
{
public:
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_HasCatalogOfferName_CatalogOfferName;     // 0x0008(0x0018)()
	bool                                          CallFunc_HasCatalogOfferName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0028(0x0018)()
	ECatalogOfferType                             CallFunc_GetOfferType_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetShortName_ReturnValue;                 // 0x0048(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0060(0x0018)()
	class FText                                   CallFunc_GetItemTypeText_ReturnValue;              // 0x0078(0x0018)()
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLockedByRequirement_ReturnValue;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateName) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateName");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateName) == 0x000098, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateName");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetOfferInfo_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_HasCatalogOfferName_CatalogOfferName) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_HasCatalogOfferName_CatalogOfferName' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_HasCatalogOfferName_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_HasCatalogOfferName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_TextToUpper_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetOfferType_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetShortName_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetShortName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_TextToUpper_ReturnValue1) == 0x000060, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_GetItemTypeText_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_GetItemTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_IsUnique_ReturnValue) == 0x000090, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_IsLockedByRequirement_ReturnValue) == 0x000091, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_IsLockedByRequirement_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateName, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateName::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateShortDescription
// 0x0158 (0x0158 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateShortDescription final
{
public:
	class FText                                   CallFunc_Bundle_Short_Text_Text;                   // 0x0000(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
