#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonAboutWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C
// 0x0098 (0x0468 - 0x03D0)
class UAthenaSeasonAboutWidget_C final : public UFortCMSInfoCarousel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RewardGridIntro;                                   // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CarouselIntro;                                     // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaBattlePassAnimatedLogo_C*        AthenaBattlePassAnimatedLogo;                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      BackButton;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BreadCrumbsNavHB;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      FAQButton;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    LeftAction;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PageActionsHB;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USeasonRewardsGridWidget*               RewardsGrid;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    RightAction;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSwipePanel*                        SwipePanel;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    LeftInputAction;                                   // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    RightInputAction;                                  // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class USoundBase*                             About_Sound;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AboutSoundAudioComponent;                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSeasonAboutWidget(int32 EntryPoint);
	void BndEvt__FortSwipePanel_0_K2Node_ComponentBoundEvent_33_OnFortSwipeEvent__DelegateSignature();
	void BndEvt__FortSwipePanel_0_K2Node_ComponentBoundEvent_23_OnFortSwipeEvent__DelegateSignature();
	void HandleWidgetCreated(class UWidget* Widget, class UFortItem* Item);
	void Construct();
	void OnDeactivated();
	void OnActivated();
	void BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandlePageRight(bool* bPassThrough);
	void HandlePageLeft(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonAboutWidget_C">();
	}
	static class UAthenaSeasonAboutWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonAboutWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonAboutWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonAboutWidget_C");
static_assert(sizeof(UAthenaSeasonAboutWidget_C) == 0x000468, "Wrong size on UAthenaSeasonAboutWidget_C");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, UberGraphFrame) == 0x0003D0, "Member 'UAthenaSeasonAboutWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, RewardGridIntro) == 0x0003D8, "Member 'UAthenaSeasonAboutWidget_C::RewardGridIntro' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, CarouselIntro) == 0x0003E0, "Member 'UAthenaSeasonAboutWidget_C::CarouselIntro' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, AthenaBattlePassAnimatedLogo) == 0x0003E8, "Member 'UAthenaSeasonAboutWidget_C::AthenaBattlePassAnimatedLogo' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, BackButton) == 0x0003F0, "Member 'UAthenaSeasonAboutWidget_C::BackButton' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, BreadCrumbsNavHB) == 0x0003F8, "Member 'UAthenaSeasonAboutWidget_C::BreadCrumbsNavHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, FAQButton) == 0x000400, "Member 'UAthenaSeasonAboutWidget_C::FAQButton' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, LeftAction) == 0x000408, "Member 'UAthenaSeasonAboutWidget_C::LeftAction' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, Lightbox) == 0x000410, "Member 'UAthenaSeasonAboutWidget_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, PageActionsHB) == 0x000418, "Member 'UAthenaSeasonAboutWidget_C::PageActionsHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, RewardsGrid) == 0x000420, "Member 'UAthenaSeasonAboutWidget_C::RewardsGrid' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, RightAction) == 0x000428, "Member 'UAthenaSeasonAboutWidget_C::RightAction' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, SwipePanel) == 0x000430, "Member 'UAthenaSeasonAboutWidget_C::SwipePanel' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, LeftInputAction) == 0x000438, "Member 'UAthenaSeasonAboutWidget_C::LeftInputAction' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, RightInputAction) == 0x000448, "Member 'UAthenaSeasonAboutWidget_C::RightInputAction' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, About_Sound) == 0x000458, "Member 'UAthenaSeasonAboutWidget_C::About_Sound' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonAboutWidget_C, AboutSoundAudioComponent) == 0x000460, "Member 'UAthenaSeasonAboutWidget_C::AboutSoundAudioComponent' has a wrong offset!");

}

