#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaStatsTab

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaStatsTab.AthenaStatsTab_C.ExecuteUbergraph_AthenaStatsTab
// 0x0258 (0x0258 - 0x0000)
struct AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanShowStats_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpProfileAthena*                  CallFunc_GetAthenaProfile_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeasonMatchXpBoost_ReturnValue;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowStats_bCanShowStats;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpProfileAthena*                  CallFunc_GetAthenaProfile_ReturnValue1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeasonFriendMatchXpBoost_ReturnValue;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowStats_bCanShowStats1;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0128(0x0040)(HasGetValueTypeHash)
	class UAthenaAccountContext*                  CallFunc_GetContext_ReturnValue3;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_GetCurrentSeasonName_ReturnValue;         // 0x0180(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0198(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x01B0(0x0018)()
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPublicAccountInfo                 CallFunc_GetCurrentlyViewedAccountInfo_Result;     // 0x01D0(0x0034)(NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_Passthrough;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0218(0x0018)()
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab) == 0x000008, "Wrong alignment on AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab");
static_assert(sizeof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab) == 0x000258, "Wrong size on AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, EntryPoint) == 0x000000, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_bool_Variable) == 0x000010, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_CanShowStats_ReturnValue) == 0x000011, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_CanShowStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_byte_Variable) == 0x000012, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_byte_Variable1) == 0x000013, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_bool_Variable1) == 0x000014, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_Select_Default) == 0x000015, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_byte_Variable2) == 0x000016, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_byte_Variable3) == 0x000017, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_bool_Variable2) == 0x000018, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_Select1_Default) == 0x000019, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_byte_Variable4) == 0x00001A, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, Temp_byte_Variable5) == 0x00001B, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue1) == 0x000028, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetAthenaProfile_ReturnValue) == 0x000040, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetAthenaProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetSeasonMatchXpBoost_ReturnValue) == 0x000048, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetSeasonMatchXpBoost_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_MakeArray_Array) == 0x0000A8, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_Event_bWasSuccessful) == 0x0000D0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_ComponentBoundEvent_TabId) == 0x0000D4, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_IsActivated_ReturnValue) == 0x0000DC, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_PlayAnimation_ReturnValue1) == 0x0000E8, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue2) == 0x0000F0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_CanShowStats_bCanShowStats) == 0x0000F8, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_CanShowStats_bCanShowStats' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetAthenaProfile_ReturnValue1) == 0x000100, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetAthenaProfile_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetSeasonFriendMatchXpBoost_ReturnValue) == 0x000108, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetSeasonFriendMatchXpBoost_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_CanShowStats_bCanShowStats1) == 0x00010C, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_CanShowStats_bCanShowStats1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Conv_IntToText_ReturnValue1) == 0x000110, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_MakeStruct_FormatArgumentData1) == 0x000128, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue3) == 0x000168, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_MakeArray_Array1) == 0x000170, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetCurrentSeasonName_ReturnValue) == 0x000180, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetCurrentSeasonName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Format_ReturnValue1) == 0x000198, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_TextToUpper_ReturnValue) == 0x0001B0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue4) == 0x0001C8, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetCurrentlyViewedAccountInfo_Result) == 0x0001D0, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetCurrentlyViewedAccountInfo_Result' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_ComponentBoundEvent_Button2) == 0x000208, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_HandleBack_Passthrough) == 0x000210, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_HandleBack_Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_Conv_IntToText_ReturnValue2) == 0x000218, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_IsMobileGame_ReturnValue) == 0x000230, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_Select2_Default) == 0x000231, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_ComponentBoundEvent_Button1) == 0x000238, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_ComponentBoundEvent_Button) == 0x000240, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, CallFunc_GetContext_ReturnValue5) == 0x000248, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab, K2Node_CustomEvent_bNewInputType) == 0x000250, "Member 'AthenaStatsTab_C_ExecuteUbergraph_AthenaStatsTab::K2Node_CustomEvent_bNewInputType' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.OnInputMethodChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct AthenaStatsTab_C_OnInputMethodChanged_Event_0 final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong alignment on AthenaStatsTab_C_OnInputMethodChanged_Event_0");
static_assert(sizeof(AthenaStatsTab_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong size on AthenaStatsTab_C_OnInputMethodChanged_Event_0");
static_assert(offsetof(AthenaStatsTab_C_OnInputMethodChanged_Event_0, bNewInputType) == 0x000000, "Member 'AthenaStatsTab_C_OnInputMethodChanged_Event_0::bNewInputType' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaStatsTab_C_BndEvt__BacchusClose3Button_K2Node_ComponentBoundEvent_36_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaStatsTab_C_BndEvt__BacchusClose2Button_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaStatsTab_C_BndEvt__BacchusCloseButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000004, "Wrong alignment on AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(sizeof(AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(offsetof(AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature, TabId) == 0x000000, "Member 'AthenaStatsTab_C_BndEvt__StatsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature::TabId' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.OnQueryFinished
// 0x0001 (0x0001 - 0x0000)
struct AthenaStatsTab_C_OnQueryFinished final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaStatsTab_C_OnQueryFinished) == 0x000001, "Wrong alignment on AthenaStatsTab_C_OnQueryFinished");
static_assert(sizeof(AthenaStatsTab_C_OnQueryFinished) == 0x000001, "Wrong size on AthenaStatsTab_C_OnQueryFinished");
static_assert(offsetof(AthenaStatsTab_C_OnQueryFinished, bWasSuccessful) == 0x000000, "Member 'AthenaStatsTab_C_OnQueryFinished::bWasSuccessful' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.CanShowStats
// 0x0018 (0x0018 - 0x0000)
struct AthenaStatsTab_C_CanShowStats final
{
public:
	bool                                          bCanShowStats;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowStats_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaStatsTab_C_CanShowStats) == 0x000008, "Wrong alignment on AthenaStatsTab_C_CanShowStats");
static_assert(sizeof(AthenaStatsTab_C_CanShowStats) == 0x000018, "Wrong size on AthenaStatsTab_C_CanShowStats");
static_assert(offsetof(AthenaStatsTab_C_CanShowStats, bCanShowStats) == 0x000000, "Member 'AthenaStatsTab_C_CanShowStats::bCanShowStats' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_CanShowStats, CallFunc_IsMobileGame_ReturnValue) == 0x000001, "Member 'AthenaStatsTab_C_CanShowStats::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_CanShowStats, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaStatsTab_C_CanShowStats::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_CanShowStats, CallFunc_CanShowStats_ReturnValue) == 0x000010, "Member 'AthenaStatsTab_C_CanShowStats::CallFunc_CanShowStats_ReturnValue' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct AthenaStatsTab_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaStatsTab_C_HandleBack) == 0x000008, "Wrong alignment on AthenaStatsTab_C_HandleBack");
static_assert(sizeof(AthenaStatsTab_C_HandleBack) == 0x000010, "Wrong size on AthenaStatsTab_C_HandleBack");
static_assert(offsetof(AthenaStatsTab_C_HandleBack, PassThrough) == 0x000000, "Member 'AthenaStatsTab_C_HandleBack::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_HandleBack, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaStatsTab_C_HandleBack::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaStatsTab.AthenaStatsTab_C.Init Back Action
// 0x0028 (0x0028 - 0x0000)
struct AthenaStatsTab_C_Init_Back_Action final
{
public:
	bool                                          CallFunc_HasInputActionHandler_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaStatsTab_C_Init_Back_Action) == 0x000008, "Wrong alignment on AthenaStatsTab_C_Init_Back_Action");
static_assert(sizeof(AthenaStatsTab_C_Init_Back_Action) == 0x000028, "Wrong size on AthenaStatsTab_C_Init_Back_Action");
static_assert(offsetof(AthenaStatsTab_C_Init_Back_Action, CallFunc_HasInputActionHandler_ReturnValue) == 0x000000, "Member 'AthenaStatsTab_C_Init_Back_Action::CallFunc_HasInputActionHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_Init_Back_Action, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'AthenaStatsTab_C_Init_Back_Action::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaStatsTab_C_Init_Back_Action, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'AthenaStatsTab_C_Init_Back_Action::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
