#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonAboutWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C.ExecuteUbergraph_AthenaSeasonAboutWidget
// 0x00F8 (0x00F8 - 0x0000)
struct AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandlePageLeft_bPassThrough;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)(ConstParm)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget, class UFortItem* Item)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UHelpPanel_C*                           CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue1;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager1;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_CustomEvent_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonReward_C*                  K2Node_DynamicCast_AsAthena_Season_Reward;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate1;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandlePageRight_bPassThrough;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget) == 0x000008, "Wrong alignment on AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget");
static_assert(sizeof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget) == 0x0000F8, "Wrong size on AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, EntryPoint) == 0x000000, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_HandlePageLeft_bPassThrough) == 0x000004, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_HandlePageLeft_bPassThrough' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_ComponentBoundEvent_Button1) == 0x000008, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, Temp_text_Variable) == 0x000018, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_DynamicCast_AsUIManager) == 0x000038, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_Create_ReturnValue) == 0x000060, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_GetUIManagerWidget_ReturnValue1) == 0x000068, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_GetUIManagerWidget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_DynamicCast_AsUIManager1) == 0x000070, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_DynamicCast_AsUIManager1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_GetContext_ReturnValue) == 0x000080, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_CustomEvent_Widget) == 0x000088, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_CustomEvent_Item) == 0x000090, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_DynamicCast_AsAthena_Season_Reward) == 0x000098, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_DynamicCast_AsAthena_Season_Reward' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_DynamicCast_bSuccess2) == 0x0000A0, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_CreateDelegate_OutputDelegate1) == 0x0000A4, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B4, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_PlayAnimation_ReturnValue1) == 0x0000D0, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_CreateSound2D_ReturnValue) == 0x0000D8, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_GetContext_ReturnValue1) == 0x0000E8, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget, CallFunc_HandlePageRight_bPassThrough) == 0x0000F0, "Member 'AthenaSeasonAboutWidget_C_ExecuteUbergraph_AthenaSeasonAboutWidget::CallFunc_HandlePageRight_bPassThrough' has a wrong offset!");

// Function AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C.HandleWidgetCreated
// 0x0010 (0x0010 - 0x0000)
struct AthenaSeasonAboutWidget_C_HandleWidgetCreated final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonAboutWidget_C_HandleWidgetCreated) == 0x000008, "Wrong alignment on AthenaSeasonAboutWidget_C_HandleWidgetCreated");
static_assert(sizeof(AthenaSeasonAboutWidget_C_HandleWidgetCreated) == 0x000010, "Wrong size on AthenaSeasonAboutWidget_C_HandleWidgetCreated");
static_assert(offsetof(AthenaSeasonAboutWidget_C_HandleWidgetCreated, Widget) == 0x000000, "Member 'AthenaSeasonAboutWidget_C_HandleWidgetCreated::Widget' has a wrong offset!");
static_assert(offsetof(AthenaSeasonAboutWidget_C_HandleWidgetCreated, Item) == 0x000008, "Member 'AthenaSeasonAboutWidget_C_HandleWidgetCreated::Item' has a wrong offset!");

// Function AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C.BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_49_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonAboutWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C.HandlePageRight
// 0x0001 (0x0001 - 0x0000)
struct AthenaSeasonAboutWidget_C_HandlePageRight final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonAboutWidget_C_HandlePageRight) == 0x000001, "Wrong alignment on AthenaSeasonAboutWidget_C_HandlePageRight");
static_assert(sizeof(AthenaSeasonAboutWidget_C_HandlePageRight) == 0x000001, "Wrong size on AthenaSeasonAboutWidget_C_HandlePageRight");
static_assert(offsetof(AthenaSeasonAboutWidget_C_HandlePageRight, bPassThrough) == 0x000000, "Member 'AthenaSeasonAboutWidget_C_HandlePageRight::bPassThrough' has a wrong offset!");

// Function AthenaSeasonAboutWidget.AthenaSeasonAboutWidget_C.HandlePageLeft
// 0x0001 (0x0001 - 0x0000)
struct AthenaSeasonAboutWidget_C_HandlePageLeft final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonAboutWidget_C_HandlePageLeft) == 0x000001, "Wrong alignment on AthenaSeasonAboutWidget_C_HandlePageLeft");
static_assert(sizeof(AthenaSeasonAboutWidget_C_HandlePageLeft) == 0x000001, "Wrong size on AthenaSeasonAboutWidget_C_HandlePageLeft");
static_assert(offsetof(AthenaSeasonAboutWidget_C_HandlePageLeft, bPassThrough) == 0x000000, "Member 'AthenaSeasonAboutWidget_C_HandlePageLeft::bPassThrough' has a wrong offset!");

}

