#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengeTreeEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaChallengeTreeEntry.AthenaChallengeTreeEntry_C
// 0x00E0 (0x0C20 - 0x0B40)
class UAthenaChallengeTreeEntry_C final : public UFortChallengeBundleTreeItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               BattleStars;                                       // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattleStarsCheck;                                  // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BattleStarSwitcher;                                // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattleStarTracker;                                 // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BundleNumber;                                      // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BundleSB;                                          // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BundleType;                                        // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChallengeBundleCategoryHeader_C*       ChallengeBundleCategoryHeader;                     // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChallengeProgressWidget_C*             ChallengeProgressWidget;                           // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ChaseRewardCard;                                   // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ExpansionIndicator;                                // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          FillCB;                                            // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          GradCB;                                            // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HeaderHB;                                          // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemCardOverlay;                                   // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemIcon*                          ItemIcon;                                          // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LockCheckSwitcher;                                 // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChallengeBundleLockedReasonDisplay_C*  LockedReasonDisplay;                               // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainEntryTypeSwitcher;                             // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MiddleSectionSwitcher;                             // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MidSectionCompleteVB;                              // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MidSectionLockedVB;                                // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper;                                 // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          OutlineCB;                                         // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          RewardBoxCB;                                       // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardSpacingLine;                                 // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaChallengeTreeEntry(int32 EntryPoint);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnHovered();
	void SetupAsChallengeBundle(class UFortChallengeBundleInfo* Bundle);
	void SetupAsChallengeBundleSchedule(class UFortChallengeBundleCategoryInfo* Schedule);
	void UpdateHeaderCategoryStyle(class UFortChallengeBundleCategoryInfo* CategoryInfo);
	void UpdateBundleStyle(class UFortChallengeBundleInfo* BundleInfo);
	void UpdateBundleData(class UFortChallengeBundleInfo* BundleInfo);
	void UpdateReward();
	class UFortItem* GetRewardToShow();
	void SetTimespanSource(TScriptInterface<class IFortTimespanDataSource> Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaChallengeTreeEntry_C">();
	}
	static class UAthenaChallengeTreeEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengeTreeEntry_C>();
	}
};
static_assert(alignof(UAthenaChallengeTreeEntry_C) == 0x000008, "Wrong alignment on UAthenaChallengeTreeEntry_C");
static_assert(sizeof(UAthenaChallengeTreeEntry_C) == 0x000C20, "Wrong size on UAthenaChallengeTreeEntry_C");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, UberGraphFrame) == 0x000B40, "Member 'UAthenaChallengeTreeEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BattleStars) == 0x000B48, "Member 'UAthenaChallengeTreeEntry_C::BattleStars' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BattleStarsCheck) == 0x000B50, "Member 'UAthenaChallengeTreeEntry_C::BattleStarsCheck' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BattleStarSwitcher) == 0x000B58, "Member 'UAthenaChallengeTreeEntry_C::BattleStarSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BattleStarTracker) == 0x000B60, "Member 'UAthenaChallengeTreeEntry_C::BattleStarTracker' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BundleNumber) == 0x000B68, "Member 'UAthenaChallengeTreeEntry_C::BundleNumber' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BundleSB) == 0x000B70, "Member 'UAthenaChallengeTreeEntry_C::BundleSB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, BundleType) == 0x000B78, "Member 'UAthenaChallengeTreeEntry_C::BundleType' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, ChallengeBundleCategoryHeader) == 0x000B80, "Member 'UAthenaChallengeTreeEntry_C::ChallengeBundleCategoryHeader' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, ChallengeProgressWidget) == 0x000B88, "Member 'UAthenaChallengeTreeEntry_C::ChallengeProgressWidget' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, ChaseRewardCard) == 0x000B90, "Member 'UAthenaChallengeTreeEntry_C::ChaseRewardCard' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, ExpansionIndicator) == 0x000B98, "Member 'UAthenaChallengeTreeEntry_C::ExpansionIndicator' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, FillCB) == 0x000BA0, "Member 'UAthenaChallengeTreeEntry_C::FillCB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, Glow) == 0x000BA8, "Member 'UAthenaChallengeTreeEntry_C::Glow' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, GradCB) == 0x000BB0, "Member 'UAthenaChallengeTreeEntry_C::GradCB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, HeaderHB) == 0x000BB8, "Member 'UAthenaChallengeTreeEntry_C::HeaderHB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, ItemCardOverlay) == 0x000BC0, "Member 'UAthenaChallengeTreeEntry_C::ItemCardOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, ItemIcon) == 0x000BC8, "Member 'UAthenaChallengeTreeEntry_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, LockCheckSwitcher) == 0x000BD0, "Member 'UAthenaChallengeTreeEntry_C::LockCheckSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, LockedReasonDisplay) == 0x000BD8, "Member 'UAthenaChallengeTreeEntry_C::LockedReasonDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, MainEntryTypeSwitcher) == 0x000BE0, "Member 'UAthenaChallengeTreeEntry_C::MainEntryTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, MiddleSectionSwitcher) == 0x000BE8, "Member 'UAthenaChallengeTreeEntry_C::MiddleSectionSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, MidSectionCompleteVB) == 0x000BF0, "Member 'UAthenaChallengeTreeEntry_C::MidSectionCompleteVB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, MidSectionLockedVB) == 0x000BF8, "Member 'UAthenaChallengeTreeEntry_C::MidSectionLockedVB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, NormalBangWrapper) == 0x000C00, "Member 'UAthenaChallengeTreeEntry_C::NormalBangWrapper' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, OutlineCB) == 0x000C08, "Member 'UAthenaChallengeTreeEntry_C::OutlineCB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, RewardBoxCB) == 0x000C10, "Member 'UAthenaChallengeTreeEntry_C::RewardBoxCB' has a wrong offset!");
static_assert(offsetof(UAthenaChallengeTreeEntry_C, RewardSpacingLine) == 0x000C18, "Member 'UAthenaChallengeTreeEntry_C::RewardSpacingLine' has a wrong offset!");

}

