#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReplayBrowserTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.ExecuteUbergraph_AthenaReplayBrowserTab
// 0x0390 (0x0390 - 0x0000)
struct AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result5;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName5;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result4;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName4;                    // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable1;                               // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable1;                               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result3;                        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName3;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable2;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable2;                               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result2;                        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName2;                    // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate3;             // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable3;                               // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable3;                               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result1;                        // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName1;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable4;                               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate5;             // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable5;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable6;                               // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAthenaReplayBrowserRowProxyInstance* K2Node_Event_RowProxy1;                            // 0x0110(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
	class UObject*                                K2Node_ComponentBoundEvent_Item2;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAthenaReplayBrowserRowProxyInstance* K2Node_Event_RowProxy;                             // 0x0150(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item1;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0170(0x0018)()
	EFortDialogResult                             K2Node_CustomEvent_Result7;                        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName7;                    // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue2; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable6;                               // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Reason3;                              // 0x01A8(0x0018)(ConstParm)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue3; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate6;             // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Reason2;                              // 0x01E0(0x0018)(ConstParm)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue4; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Reason1;                              // 0x0200(0x0018)(ConstParm)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue5; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x2];                                      // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText NewName)>          K2Node_CreateDelegate_OutputDelegate7;             // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0234(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable7;                               // 0x0254(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Reason;                               // 0x0260(0x0018)(ConstParm)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue6; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAnyActionsOutstanding_ReturnValue;     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0298(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result6;                        // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName6;                    // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate9;             // 0x02CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x02E0(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Message;                              // 0x02F8(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue1;           // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0348(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue7; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreAnyActionsOutstanding_ReturnValue1;    // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreAnyActionsOutstanding_ReturnValue2;    // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreAnyActionsOutstanding_ReturnValue3;    // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingModalsConfirmationsErrors_ReturnValue; // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable7;                               // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab");
static_assert(sizeof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab) == 0x000390, "Wrong size on AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, EntryPoint) == 0x000000, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result5) == 0x000004, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName5) == 0x000008, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable) == 0x000020, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable) == 0x000028, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result4) == 0x000029, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName4) == 0x00002C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate1) == 0x000034, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable1) == 0x000044, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable1) == 0x00004C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result3) == 0x00004D, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName3) == 0x000050, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable2) == 0x000068, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable2) == 0x000070, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result2) == 0x000071, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName2) == 0x000074, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate3) == 0x00007C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable3) == 0x00008C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable3) == 0x000094, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_GetContext_ReturnValue) == 0x000098, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000A0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate4) == 0x0000A4, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B4, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result1) == 0x0000B5, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName1) == 0x0000B8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable4) == 0x0000C0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable4) == 0x0000C8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0000C9, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate5) == 0x0000CC, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result) == 0x0000DC, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName) == 0x0000E0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable5) == 0x0000E8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable5) == 0x0000F0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0000F1, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x0000F8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable6) == 0x000104, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue1) == 0x00010C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_RowProxy1) == 0x000110, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_RowProxy1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue2) == 0x000118, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue3) == 0x000119, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_ComponentBoundEvent_Item2) == 0x000138, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_ComponentBoundEvent_Item2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue1) == 0x000140, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue4) == 0x000148, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_RowProxy) == 0x000150, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_RowProxy' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_bUsingGamepad) == 0x000158, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue5) == 0x000159, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_ComponentBoundEvent_Item1) == 0x000160, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_ComponentBoundEvent_Item1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_BooleanNOR_ReturnValue) == 0x000168, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Conv_StringToText_ReturnValue1) == 0x000170, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result7) == 0x000188, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName7) == 0x00018C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue2) == 0x000198, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue6) == 0x0001A0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable6) == 0x0001A1, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x0001A2, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_Reason3) == 0x0001A8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_Reason3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue3) == 0x0001C0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate6) == 0x0001C8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue7) == 0x0001D8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_Reason2) == 0x0001E0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_Reason2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue4) == 0x0001F8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_Reason1) == 0x000200, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_Reason1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue5) == 0x000218, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue8) == 0x000220, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue9) == 0x000221, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate7) == 0x000224, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate8) == 0x000234, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_ComponentBoundEvent_Item) == 0x000248, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_ComponentBoundEvent_bIsSelected) == 0x000250, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_name_Variable7) == 0x000254, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_name_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_Reason) == 0x000260, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue6) == 0x000278, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue10) == 0x000280, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_ComponentBoundEvent_Button) == 0x000288, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_AreAnyActionsOutstanding_ReturnValue) == 0x000290, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_AreAnyActionsOutstanding_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_MakeLiteralText_ReturnValue) == 0x000298, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Conv_TextToString_ReturnValue) == 0x0002B0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_Result6) == 0x0002C0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_Result6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CustomEvent_ResultName6) == 0x0002C4, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CustomEvent_ResultName6' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_CreateDelegate_OutputDelegate9) == 0x0002CC, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_Title) == 0x0002E0, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, K2Node_Event_Message) == 0x0002F8, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Conv_TextToString_ReturnValue1) == 0x000310, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Conv_TextToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Concat_StrStr_ReturnValue) == 0x000320, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Concat_StrStr_ReturnValue1) == 0x000330, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsActivated_ReturnValue) == 0x000340, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Conv_StringToText_ReturnValue2) == 0x000348, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue7) == 0x000360, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsValid_ReturnValue11) == 0x000368, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_AreAnyActionsOutstanding_ReturnValue1) == 0x000369, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_AreAnyActionsOutstanding_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_AreAnyActionsOutstanding_ReturnValue2) == 0x00036A, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_AreAnyActionsOutstanding_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_AreAnyActionsOutstanding_ReturnValue3) == 0x00036B, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_AreAnyActionsOutstanding_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_Not_PreBool_ReturnValue) == 0x00036C, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000370, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_BooleanAND_ReturnValue) == 0x000378, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_IsShowingModalsConfirmationsErrors_ReturnValue) == 0x000379, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_IsShowingModalsConfirmationsErrors_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, Temp_byte_Variable7) == 0x00037A, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_GetContext_ReturnValue1) == 0x000380, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000388, "Member 'AthenaReplayBrowserTab_C_ExecuteUbergraph_AthenaReplayBrowserTab::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.ShowDeleteInvalidDialog
// 0x0030 (0x0030 - 0x0000)
struct AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   MESSAGE;                                           // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog");
static_assert(sizeof(AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog) == 0x000030, "Wrong size on AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog");
static_assert(offsetof(AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog, Title) == 0x000000, "Member 'AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog::Title' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog, MESSAGE) == 0x000018, "Member 'AthenaReplayBrowserTab_C_ShowDeleteInvalidDialog::MESSAGE' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaReplayBrowserTab_C_BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.OnPlayFailed
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayBrowserTab_C_OnPlayFailed final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayBrowserTab_C_OnPlayFailed) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_OnPlayFailed");
static_assert(sizeof(AthenaReplayBrowserTab_C_OnPlayFailed) == 0x000018, "Wrong size on AthenaReplayBrowserTab_C_OnPlayFailed");
static_assert(offsetof(AthenaReplayBrowserTab_C_OnPlayFailed, Reason) == 0x000000, "Member 'AthenaReplayBrowserTab_C_OnPlayFailed::Reason' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature");
static_assert(sizeof(AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature) == 0x000010, "Wrong size on AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature");
static_assert(offsetof(AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature, Item) == 0x000000, "Member 'AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature, bIsSelected) == 0x000008, "Member 'AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature::bIsSelected' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.OnSaveFailed
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayBrowserTab_C_OnSaveFailed final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayBrowserTab_C_OnSaveFailed) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_OnSaveFailed");
static_assert(sizeof(AthenaReplayBrowserTab_C_OnSaveFailed) == 0x000018, "Wrong size on AthenaReplayBrowserTab_C_OnSaveFailed");
static_assert(offsetof(AthenaReplayBrowserTab_C_OnSaveFailed, Reason) == 0x000000, "Member 'AthenaReplayBrowserTab_C_OnSaveFailed::Reason' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.OnRenameFailed
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayBrowserTab_C_OnRenameFailed final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayBrowserTab_C_OnRenameFailed) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_OnRenameFailed");
static_assert(sizeof(AthenaReplayBrowserTab_C_OnRenameFailed) == 0x000018, "Wrong size on AthenaReplayBrowserTab_C_OnRenameFailed");
static_assert(offsetof(AthenaReplayBrowserTab_C_OnRenameFailed, Reason) == 0x000000, "Member 'AthenaReplayBrowserTab_C_OnRenameFailed::Reason' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.OnDeleteFailed
// 0x0018 (0x0018 - 0x0000)
struct AthenaReplayBrowserTab_C_OnDeleteFailed final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaReplayBrowserTab_C_OnDeleteFailed) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_OnDeleteFailed");
static_assert(sizeof(AthenaReplayBrowserTab_C_OnDeleteFailed) == 0x000018, "Wrong size on AthenaReplayBrowserTab_C_OnDeleteFailed");
static_assert(offsetof(AthenaReplayBrowserTab_C_OnDeleteFailed, Reason) == 0x000000, "Member 'AthenaReplayBrowserTab_C_OnDeleteFailed::Reason' has a wrong offset!");

// Function AthenaReplayBrowserTab.AthenaReplayBrowserTab_C.BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaReplayBrowserTab_C_BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature");
