#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Beam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Beam.B_Beam_C
// 0x0088 (0x03B8 - 0x0330)
class AB_Beam_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_SoulDrailNew;                                    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_StripUnitX3;                                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_StripUnit;                                       // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Lerp_2C3D51D8433B77DC5B14568974B696A3;  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2C3D51D8433B77DC5B14568974B696A3; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID2;                                              // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID3;                                              // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationB;                                         // 0x0390(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationA;                                         // 0x039C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 TargetSkMesh;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Beam(int32 EntryPoint);
	void CE_Trigger();
	void Update_Offset();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void UpdateBeamPosAndRot(const class AActor* AimTarget, const struct FLinearColor& SimulateOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Beam_C">();
	}
	static class AB_Beam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Beam_C>();
	}
};
static_assert(alignof(AB_Beam_C) == 0x000008, "Wrong alignment on AB_Beam_C");
static_assert(sizeof(AB_Beam_C) == 0x0003B8, "Wrong size on AB_Beam_C");
static_assert(offsetof(AB_Beam_C, UberGraphFrame) == 0x000330, "Member 'AB_Beam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, P_SoulDrailNew) == 0x000338, "Member 'AB_Beam_C::P_SoulDrailNew' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, S_StripUnitX3) == 0x000340, "Member 'AB_Beam_C::S_StripUnitX3' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, StaticMesh) == 0x000348, "Member 'AB_Beam_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, S_StripUnit) == 0x000350, "Member 'AB_Beam_C::S_StripUnit' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, DefaultSceneRoot) == 0x000358, "Member 'AB_Beam_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, Timeline_0_Lerp_2C3D51D8433B77DC5B14568974B696A3) == 0x000360, "Member 'AB_Beam_C::Timeline_0_Lerp_2C3D51D8433B77DC5B14568974B696A3' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, Timeline_0__Direction_2C3D51D8433B77DC5B14568974B696A3) == 0x000364, "Member 'AB_Beam_C::Timeline_0__Direction_2C3D51D8433B77DC5B14568974B696A3' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, Timeline_0) == 0x000368, "Member 'AB_Beam_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, TargetActor) == 0x000370, "Member 'AB_Beam_C::TargetActor' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, Mid) == 0x000378, "Member 'AB_Beam_C::Mid' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, MID2) == 0x000380, "Member 'AB_Beam_C::MID2' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, MID3) == 0x000388, "Member 'AB_Beam_C::MID3' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, LocationB) == 0x000390, "Member 'AB_Beam_C::LocationB' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, LocationA) == 0x00039C, "Member 'AB_Beam_C::LocationA' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, NewVar_0) == 0x0003A8, "Member 'AB_Beam_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AB_Beam_C, TargetSkMesh) == 0x0003B0, "Member 'AB_Beam_C::TargetSkMesh' has a wrong offset!");

}

