#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_Athena_EnvCampFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_BGA_Athena_EnvCampFire.B_BGA_Athena_EnvCampFire_C
// 0x00E0 (0x0848 - 0x0768)
class AB_BGA_Athena_EnvCampFire_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        FireLoc;                                           // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wood;                                              // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FirePitEmpty;                                      // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              InteractingPawn;                                   // 0x0798(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeenUsed;                                          // 0x07A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A1[0x3];                                      // 0x07A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DousedSmokeLife;                                   // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_DousedSmokeLife;                               // 0x07A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HotfixedEnabled;                                   // 0x07C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DestroyIfDisabled;                                 // 0x07C9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Destroyed;                                         // 0x07CA(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_7CB[0x5];                                      // 0x07CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HotfixEnabled;                                 // 0x07D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                TraceOffset;                                       // 0x07F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Season7Campfire;                                   // 0x07FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CustomSpecialS7Tags;                               // 0x0800(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SpecialS7FireTime;                                 // 0x0820(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_824[0x4];                                      // 0x0824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DousedSmokeWispTimer;                              // 0x0828(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        S7SuccessEmitter;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S7SuccessSound;                                    // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockInteraction;                                  // 0x0840(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_841[0x3];                                      // 0x0841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LitRepBool;                                        // 0x0844(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_BGA_Athena_EnvCampFire(int32 EntryPoint);
	void HandleCharacterVariantTransition(class AFortPawn* TransitioningPawn);
	void Server_QuestObjectiveUpdated(class AFortPlayerController* Controller, const class UFortQuestItemDefinition* QuestDef, class FName BackendName, int32 CompletionCount, bool ObjectiveCompleted, bool QuestCompleted);
	void KillDouseSmokeWisp();
	void SpecialS7LightsFireAfterOut();
	void BlueprintOnInteract(const class AFortPawn* Param_InteractingPawn);
	void CheckDestroyDisabled();
	void Light();
	void GoOut();
	void HandleBoundDestroyed();
	void BindToFloor();
	void BuildingActorDestroyedCleanUp(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Start();
	void ReceiveBeginPlay();
	void OnReady_9F4554BE40FCB41157835B9AD897EE69(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void UserConstructionScript();
	void SetSheetValues();
	bool RowToBool(const struct FScalableFloat& Input);
	void CheckIfUserIsSpecialS7(class AFortPawn* PawnWhoLitFire, bool* UserIsSpecial);
	void OnRep_Destroyed();
	void OnRep_LitRepBool();

	bool BlueprintCanInteract(const class AFortPawn* Param_InteractingPawn) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* Param_InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_BGA_Athena_EnvCampFire_C">();
	}
	static class AB_BGA_Athena_EnvCampFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_BGA_Athena_EnvCampFire_C>();
	}
};
static_assert(alignof(AB_BGA_Athena_EnvCampFire_C) == 0x000008, "Wrong alignment on AB_BGA_Athena_EnvCampFire_C");
static_assert(sizeof(AB_BGA_Athena_EnvCampFire_C) == 0x000848, "Wrong size on AB_BGA_Athena_EnvCampFire_C");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, UberGraphFrame) == 0x000768, "Member 'AB_BGA_Athena_EnvCampFire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Cylinder) == 0x000770, "Member 'AB_BGA_Athena_EnvCampFire_C::Cylinder' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, FireLoc) == 0x000778, "Member 'AB_BGA_Athena_EnvCampFire_C::FireLoc' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Wood) == 0x000780, "Member 'AB_BGA_Athena_EnvCampFire_C::Wood' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, FirePitEmpty) == 0x000788, "Member 'AB_BGA_Athena_EnvCampFire_C::FirePitEmpty' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DefaultSceneRoot) == 0x000790, "Member 'AB_BGA_Athena_EnvCampFire_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, InteractingPawn) == 0x000798, "Member 'AB_BGA_Athena_EnvCampFire_C::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, BeenUsed) == 0x0007A0, "Member 'AB_BGA_Athena_EnvCampFire_C::BeenUsed' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DousedSmokeLife) == 0x0007A4, "Member 'AB_BGA_Athena_EnvCampFire_C::DousedSmokeLife' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_DousedSmokeLife) == 0x0007A8, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_DousedSmokeLife' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, HotfixedEnabled) == 0x0007C8, "Member 'AB_BGA_Athena_EnvCampFire_C::HotfixedEnabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DestroyIfDisabled) == 0x0007C9, "Member 'AB_BGA_Athena_EnvCampFire_C::DestroyIfDisabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Destroyed) == 0x0007CA, "Member 'AB_BGA_Athena_EnvCampFire_C::Destroyed' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_HotfixEnabled) == 0x0007D0, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_HotfixEnabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, TraceOffset) == 0x0007F0, "Member 'AB_BGA_Athena_EnvCampFire_C::TraceOffset' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Season7Campfire) == 0x0007FC, "Member 'AB_BGA_Athena_EnvCampFire_C::Season7Campfire' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, CustomSpecialS7Tags) == 0x000800, "Member 'AB_BGA_Athena_EnvCampFire_C::CustomSpecialS7Tags' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, SpecialS7FireTime) == 0x000820, "Member 'AB_BGA_Athena_EnvCampFire_C::SpecialS7FireTime' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DousedSmokeWispTimer) == 0x000828, "Member 'AB_BGA_Athena_EnvCampFire_C::DousedSmokeWispTimer' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, S7SuccessEmitter) == 0x000830, "Member 'AB_BGA_Athena_EnvCampFire_C::S7SuccessEmitter' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, S7SuccessSound) == 0x000838, "Member 'AB_BGA_Athena_EnvCampFire_C::S7SuccessSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, BlockInteraction) == 0x000840, "Member 'AB_BGA_Athena_EnvCampFire_C::BlockInteraction' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, LitRepBool) == 0x000844, "Member 'AB_BGA_Athena_EnvCampFire_C::LitRepBool' has a wrong offset!");

}

