#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Melee_Generic

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Melee_Generic.B_Melee_Generic_C
// 0x0130 (0x0AB8 - 0x0988)
class AB_Melee_Generic_C : public AFortWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0988(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               IdleFX;                                            // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SwingFX;                                           // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               AnimTrial;                                         // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               AnimTrail_PSC;                                     // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UParticleSystemComponent*               MeleeHeavy_PSC;                                    // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UParticleSystem*                        IdleFX_Template;                                   // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Idle_Effect;                                   // 0x09C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_9C1[0x7];                                      // 0x09C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Idle_Effect;                                       // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   IdleFXAttachSocket;                                // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               IdleFX_Location_Rule;                              // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Idle_FX_Rotation_Rule;                             // 0x09D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Idle_FX_Scale_Rule;                                // 0x09DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DB[0x5];                                      // 0x09DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Swing_FX_Template;                                 // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Swing_Effect;                                  // 0x09E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_9E9[0x7];                                      // 0x09E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Swing_Effect;                                      // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   SwingFXSocket;                                     // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               SwingFX_Location_Rule;                             // 0x0A00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Swing_FX_Rotation_Rule;                            // 0x0A01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               Swing_FX_Scale_Rule;                               // 0x0A02(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAnimTrails;                                     // 0x0A03(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_A04[0x4];                                      // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Anim_Trail_Template;                               // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        AnimTrailsParticles;                               // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   FirstSocketName;                                   // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   Second_Socket_Name;                                // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   OverrideFirstSocketName;                           // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   OverrideSecond_Socket_Name;                        // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Width;                                             // 0x0A38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_A3C[0x4];                                      // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MeleeHeavy_ParticleSystem;                         // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x0A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x0A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A59[0x7];                                      // 0x0A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Idle_Effect_Component;                             // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   PokeAnimations;                                    // 0x0A68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               WeaponMID;                                         // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Alteration_Ambient_PS;                             // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class USoundBase*                             MeleeHeavy_Sound;                                  // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Melee_Heavy_Launch_Gameplay_Cue_Tag_Override;      // 0x0A90(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Melee_Heavy_Impact_Gameplay_Cue_Tag_Override;      // 0x0A98(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Effects_Color_Level;                               // 0x0AA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Swing_Effect_Component;                            // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Melee_Generic(int32 EntryPoint);
	void OnWeaponDetached();
	void OnWeaponVisibilityChanged(bool bVisible);
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod, class UMaterialInstanceDynamic* DynamicMaterialInstance);
	void OnWeaponAttached();
	void OnEquippedWeaponDestory();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UParticleSystemComponent* SpawnedPSC);
	void PlayRClickImpacts();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void ReceiveBeginPlay();
	void FootStepRight();
	void FootStepLeft();
	void MeleeSwingLeft();
	void MeleeSwingRight();
	void OnLoaded_CB594210420542B302428F8181D85E48(class UObject* Loaded);
	void UserConstructionScript();
	void SetWpnRarity();
	void SetActiveAlterationIdleParticles(bool Active, bool Reset);
	void Melee_Effect_Color(struct FVector* Melee_Color_Set);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Melee_Generic_C">();
	}
	static class AB_Melee_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Melee_Generic_C>();
	}
};
static_assert(alignof(AB_Melee_Generic_C) == 0x000008, "Wrong alignment on AB_Melee_Generic_C");
static_assert(sizeof(AB_Melee_Generic_C) == 0x000AB8, "Wrong size on AB_Melee_Generic_C");
static_assert(offsetof(AB_Melee_Generic_C, UberGraphFrame) == 0x000988, "Member 'AB_Melee_Generic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, IdleFX) == 0x000990, "Member 'AB_Melee_Generic_C::IdleFX' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, SwingFX) == 0x000998, "Member 'AB_Melee_Generic_C::SwingFX' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, AnimTrial) == 0x0009A0, "Member 'AB_Melee_Generic_C::AnimTrial' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, AnimTrail_PSC) == 0x0009A8, "Member 'AB_Melee_Generic_C::AnimTrail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, MeleeHeavy_PSC) == 0x0009B0, "Member 'AB_Melee_Generic_C::MeleeHeavy_PSC' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, IdleFX_Template) == 0x0009B8, "Member 'AB_Melee_Generic_C::IdleFX_Template' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Has_Idle_Effect) == 0x0009C0, "Member 'AB_Melee_Generic_C::Has_Idle_Effect' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Idle_Effect) == 0x0009C8, "Member 'AB_Melee_Generic_C::Idle_Effect' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, IdleFXAttachSocket) == 0x0009D0, "Member 'AB_Melee_Generic_C::IdleFXAttachSocket' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, IdleFX_Location_Rule) == 0x0009D8, "Member 'AB_Melee_Generic_C::IdleFX_Location_Rule' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Idle_FX_Rotation_Rule) == 0x0009D9, "Member 'AB_Melee_Generic_C::Idle_FX_Rotation_Rule' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Idle_FX_Scale_Rule) == 0x0009DA, "Member 'AB_Melee_Generic_C::Idle_FX_Scale_Rule' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Swing_FX_Template) == 0x0009E0, "Member 'AB_Melee_Generic_C::Swing_FX_Template' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Has_Swing_Effect) == 0x0009E8, "Member 'AB_Melee_Generic_C::Has_Swing_Effect' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Swing_Effect) == 0x0009F0, "Member 'AB_Melee_Generic_C::Swing_Effect' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, SwingFXSocket) == 0x0009F8, "Member 'AB_Melee_Generic_C::SwingFXSocket' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, SwingFX_Location_Rule) == 0x000A00, "Member 'AB_Melee_Generic_C::SwingFX_Location_Rule' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Swing_FX_Rotation_Rule) == 0x000A01, "Member 'AB_Melee_Generic_C::Swing_FX_Rotation_Rule' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Swing_FX_Scale_Rule) == 0x000A02, "Member 'AB_Melee_Generic_C::Swing_FX_Scale_Rule' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, UseAnimTrails) == 0x000A03, "Member 'AB_Melee_Generic_C::UseAnimTrails' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Anim_Trail_Template) == 0x000A08, "Member 'AB_Melee_Generic_C::Anim_Trail_Template' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, AnimTrailsParticles) == 0x000A10, "Member 'AB_Melee_Generic_C::AnimTrailsParticles' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, FirstSocketName) == 0x000A18, "Member 'AB_Melee_Generic_C::FirstSocketName' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Second_Socket_Name) == 0x000A20, "Member 'AB_Melee_Generic_C::Second_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, OverrideFirstSocketName) == 0x000A28, "Member 'AB_Melee_Generic_C::OverrideFirstSocketName' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, OverrideSecond_Socket_Name) == 0x000A30, "Member 'AB_Melee_Generic_C::OverrideSecond_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Width) == 0x000A38, "Member 'AB_Melee_Generic_C::Width' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, MeleeHeavy_ParticleSystem) == 0x000A40, "Member 'AB_Melee_Generic_C::MeleeHeavy_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, WeaponDurabilityDestroyEffect) == 0x000A48, "Member 'AB_Melee_Generic_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, WeaponDurabilityDestroyEffectIcon) == 0x000A50, "Member 'AB_Melee_Generic_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, UseDestroyEffect) == 0x000A58, "Member 'AB_Melee_Generic_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Idle_Effect_Component) == 0x000A60, "Member 'AB_Melee_Generic_C::Idle_Effect_Component' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, PokeAnimations) == 0x000A68, "Member 'AB_Melee_Generic_C::PokeAnimations' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, WeaponMID) == 0x000A78, "Member 'AB_Melee_Generic_C::WeaponMID' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Alteration_Ambient_PS) == 0x000A80, "Member 'AB_Melee_Generic_C::Alteration_Ambient_PS' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, MeleeHeavy_Sound) == 0x000A88, "Member 'AB_Melee_Generic_C::MeleeHeavy_Sound' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Melee_Heavy_Launch_Gameplay_Cue_Tag_Override) == 0x000A90, "Member 'AB_Melee_Generic_C::Melee_Heavy_Launch_Gameplay_Cue_Tag_Override' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Melee_Heavy_Impact_Gameplay_Cue_Tag_Override) == 0x000A98, "Member 'AB_Melee_Generic_C::Melee_Heavy_Impact_Gameplay_Cue_Tag_Override' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Effects_Color_Level) == 0x000AA0, "Member 'AB_Melee_Generic_C::Effects_Color_Level' has a wrong offset!");
static_assert(offsetof(AB_Melee_Generic_C, Swing_Effect_Component) == 0x000AB0, "Member 'AB_Melee_Generic_C::Swing_Effect_Component' has a wrong offset!");

}

