#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Dual_Generic_FerretVehicle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "En_ShellTypes_01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "E_MountedTurret_FireStates_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_Dual_Generic_FerretVehicle.B_Ranged_Dual_Generic_FerretVehicle_C
// 0x01A0 (0x0E88 - 0x0CE8)
class AB_Ranged_Dual_Generic_FerretVehicle_C : public AFortWeaponRangedDualFerret
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               LeftReload_Empty_;                                 // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LeftShells_Empty_;                                 // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LeftMuzzle_Empty_;                                 // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Reload_Empty_;                                     // 0x0D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Shells_empty_;                                     // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScopeMesh1P;                                       // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Muzzle_Empty_;                                     // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x0D40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_Reload_Particles;                              // 0x0D41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D42[0x6];                                      // 0x0D42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Reload_ParticleSystem;                             // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x0D50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x0D54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnFire_;                                  // 0x0D58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnReload_;                                // 0x0D59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnPump_;                                  // 0x0D5A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5B[0x5];                                      // 0x0D5B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ShellsParticleSystemTemplate;                      // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReloadSocketName;                                  // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortAIPawn*>                    Array_Of_Active_Enemy_AI;                          // 0x0D70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Scope_Minus_Render_Enemies_To_Custom_Depth_Buffer; // 0x0D80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D81[0x3];                                      // 0x0D81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shells_Socket_Name;                                // 0x0D84(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	En_ShellTypes_01                              ShellTypeSelect;                                   // 0x0D8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8D[0x3];                                      // 0x0D8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shells_Spawn_Rate_Scale;                           // 0x0D90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShellsRotationRate;                                // 0x0D94(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Velocity;                                   // 0x0DA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Gravity;                                    // 0x0DAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Lifetime;                                   // 0x0DB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Size;                                       // 0x0DBC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Time_Dilation;                              // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Scope_Vignette_Blur_Screen_Percentage;      // 0x0DCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scope_Camera_Offset_Amount;                        // 0x0DD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SmallShells;                                       // 0x0DD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MediumShells;                                      // 0x0DD5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LargeShells;                                       // 0x0DD6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShotgunShells;                                     // 0x0DD7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnergyShells;                                      // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD9[0x3];                                      // 0x0DD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inherit_Parent_Velocity;                           // 0x0DDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Radius;                                // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Height;                                // 0x0DE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugShellsSocket_;                                // 0x0DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_2_Post_Processes_For_the_Scope;                // 0x0DE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_DEA[0x6];                                      // 0x0DEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_ScopeZoomIn;                                 // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ScopeZoomOut;                                // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Alteration_Ambient_PS;                             // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x0E08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Wind_Enabled;                                   // 0x0E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E29[0x7];                                      // 0x0E29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MuzzleWindParticleSystem;                          // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem1P;                            // 0x0E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  DownScopePostProcessSpawned;                       // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  DownScopePostProcessSpawned2;                      // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MuzzleWindParticleSpawned;                         // 0x0E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDualWeaponHand                               LastHandFired;                                     // 0x0E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E59[0x7];                                      // 0x0E59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           StartHeatingTimer;                                 // 0x0E68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           StartCoolingTimer;                                 // 0x0E70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_MountedTurret_FireStates                    FireState;                                         // 0x0E78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E79[0x7];                                      // 0x0E79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_OnFailToFireWhenOverheated;                  // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Ranged_Dual_Generic_FerretVehicle(int32 EntryPoint);
	void OnLocalFailedToFireWhenOverheated();
	void OnFinishedCooling();
	void OnStartCooling();
	void OnStartHeating();
	void OnStartOverheated();
	void BindOnHandFired();
	void HandFired(EDualWeaponHand Hand, bool bPersistantFire);
	void ShowWeapon();
	void HideWeapon();
	void ShowWeaponMesh();
	void HideWeaponMesh();
	void OnWeaponVisibilityChanged(bool bVisible);
	void ReceiveBeginPlay();
	void SetWeaponPierceThrough_ClientRep(bool Enable, int32 TargetLimit);
	void SetWeaponPierceThrough(bool Enable, int32 TargetLimit);
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod, class UMaterialInstanceDynamic* DynamicMaterialInstance);
	void OnInitAlteration(class UFortAlterationItemDefinition* NewAlteration);
	void OnWeaponAttached();
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32 StencilBufferValue);
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnStopWeaponFireFX();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnLoaded_607D4740428DAC9F999AC1B4F83B4A3D(class UObject* Loaded);
	void OnLoaded_92820178444994F3AB627D80A31FB0A5(class UObject* Loaded);
	void OnLoaded_00847B7345FF13DB7E708BB0E4235B9C(class UObject* Loaded);
	void OnLoaded_CA78C0DE4D818E45A12F6FAF524A1859(class UObject* Loaded);
	void UserConstructionScript();
	void AddRandomScale(bool OffHand);
	void SetWpnRarity();
	void Muzzle_Flash_FX(bool Persistent_Fire, bool OffHand);
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void UpdateShellEmittersFX(class UParticleSystemComponent* PS);
	void SetupShellFX();
	void DeactivateShellsFX();
	void ActivateShellsFX(bool Bool, bool OffHand);
	void ActivateReloadSmokeFX();
	void DeactivateReloadSmokeFX();
	void DeactivateMuzzleFX();
	void ActivateOrDeactivateWindParticle(bool bNewActive);
	void HideReticle();
	void ShowReticle();
	void SetActiveAlterationIdleParticles(bool Active, bool Reset);
	void SetPostProcessParams(float InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_Dual_Generic_FerretVehicle_C">();
	}
	static class AB_Ranged_Dual_Generic_FerretVehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_Dual_Generic_FerretVehicle_C>();
	}
};
static_assert(alignof(AB_Ranged_Dual_Generic_FerretVehicle_C) == 0x000008, "Wrong alignment on AB_Ranged_Dual_Generic_FerretVehicle_C");
static_assert(sizeof(AB_Ranged_Dual_Generic_FerretVehicle_C) == 0x000E88, "Wrong size on AB_Ranged_Dual_Generic_FerretVehicle_C");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, UberGraphFrame) == 0x000CE8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, LeftReload_Empty_) == 0x000CF0, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::LeftReload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, LeftShells_Empty_) == 0x000CF8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::LeftShells_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, LeftMuzzle_Empty_) == 0x000D00, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::LeftMuzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Reload_Empty_) == 0x000D08, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Reload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_empty_) == 0x000D10, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ScopeMesh1P) == 0x000D18, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ScopeMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Muzzle_Empty_) == 0x000D20, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Muzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, MuzzleParticleSystem) == 0x000D28, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::MuzzleParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, WeaponDurabilityDestroyEffect) == 0x000D30, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, WeaponDurabilityDestroyEffectIcon) == 0x000D38, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, UseDestroyEffect) == 0x000D40, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Use_Reload_Particles) == 0x000D41, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Use_Reload_Particles' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Reload_ParticleSystem) == 0x000D48, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Reload_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, LastPlayFXTime) == 0x000D50, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::LastPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, MinPlayFXTime) == 0x000D54, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::MinPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, UseShellsOnFire_) == 0x000D58, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::UseShellsOnFire_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, UseShellsOnReload_) == 0x000D59, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::UseShellsOnReload_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, UseShellsOnPump_) == 0x000D5A, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::UseShellsOnPump_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ShellsParticleSystemTemplate) == 0x000D60, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ShellsParticleSystemTemplate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ReloadSocketName) == 0x000D68, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ReloadSocketName' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Array_Of_Active_Enemy_AI) == 0x000D70, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Array_Of_Active_Enemy_AI' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Scope_Minus_Render_Enemies_To_Custom_Depth_Buffer) == 0x000D80, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Scope_Minus_Render_Enemies_To_Custom_Depth_Buffer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Socket_Name) == 0x000D84, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ShellTypeSelect) == 0x000D8C, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ShellTypeSelect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Spawn_Rate_Scale) == 0x000D90, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Spawn_Rate_Scale' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ShellsRotationRate) == 0x000D94, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ShellsRotationRate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Velocity) == 0x000DA0, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Gravity) == 0x000DAC, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Gravity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Lifetime) == 0x000DB8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Size) == 0x000DBC, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Size' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Shells_Time_Dilation) == 0x000DC8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Shells_Time_Dilation' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Target_Scope_Vignette_Blur_Screen_Percentage) == 0x000DCC, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Target_Scope_Vignette_Blur_Screen_Percentage' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Scope_Camera_Offset_Amount) == 0x000DD0, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Scope_Camera_Offset_Amount' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, SmallShells) == 0x000DD4, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::SmallShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, MediumShells) == 0x000DD5, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::MediumShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, LargeShells) == 0x000DD6, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::LargeShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ShotgunShells) == 0x000DD7, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ShotgunShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, EnergyShells) == 0x000DD8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::EnergyShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Inherit_Parent_Velocity) == 0x000DDC, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Inherit_Parent_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Cylindrical_Radius) == 0x000DE0, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Cylindrical_Radius' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Cylindrical_Height) == 0x000DE4, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Cylindrical_Height' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, DebugShellsSocket_) == 0x000DE8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::DebugShellsSocket_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Use_2_Post_Processes_For_the_Scope) == 0x000DE9, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Use_2_Post_Processes_For_the_Scope' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Sound_ScopeZoomIn) == 0x000DF0, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Sound_ScopeZoomIn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Sound_ScopeZoomOut) == 0x000DF8, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Sound_ScopeZoomOut' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Alteration_Ambient_PS) == 0x000E00, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Alteration_Ambient_PS' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, ReticleHUDElementTags) == 0x000E08, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::ReticleHUDElementTags' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Is_Wind_Enabled) == 0x000E28, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Is_Wind_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, MuzzleWindParticleSystem) == 0x000E30, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::MuzzleWindParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, MuzzleParticleSystem1P) == 0x000E38, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::MuzzleParticleSystem1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, DownScopePostProcessSpawned) == 0x000E40, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::DownScopePostProcessSpawned' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, DownScopePostProcessSpawned2) == 0x000E48, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::DownScopePostProcessSpawned2' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, MuzzleWindParticleSpawned) == 0x000E50, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::MuzzleWindParticleSpawned' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, LastHandFired) == 0x000E58, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::LastHandFired' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, PlayerPawn) == 0x000E60, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, StartHeatingTimer) == 0x000E68, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::StartHeatingTimer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, StartCoolingTimer) == 0x000E70, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::StartCoolingTimer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, FireState) == 0x000E78, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::FireState' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Dual_Generic_FerretVehicle_C, Sound_OnFailToFireWhenOverheated) == 0x000E80, "Member 'AB_Ranged_Dual_Generic_FerretVehicle_C::Sound_OnFailToFireWhenOverheated' has a wrong offset!");

}

