#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TimeLineDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_TimeLineDecal.B_TimeLineDecal_C
// 0x0030 (0x0360 - 0x0330)
class AB_TimeLineDecal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Time_8976492442EE7DF41645EDBAB6FCEB40;  // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_WaveOffset_8976492442EE7DF41645EDBAB6FCEB40; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Intensity_8976492442EE7DF41645EDBAB6FCEB40; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_8976492442EE7DF41645EDBAB6FCEB40; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalMID;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_TimeLineDecal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_TimeLineDecal_C">();
	}
	static class AB_TimeLineDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_TimeLineDecal_C>();
	}
};
static_assert(alignof(AB_TimeLineDecal_C) == 0x000008, "Wrong alignment on AB_TimeLineDecal_C");
static_assert(sizeof(AB_TimeLineDecal_C) == 0x000360, "Wrong size on AB_TimeLineDecal_C");
static_assert(offsetof(AB_TimeLineDecal_C, UberGraphFrame) == 0x000330, "Member 'AB_TimeLineDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, Decal) == 0x000338, "Member 'AB_TimeLineDecal_C::Decal' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, Timeline_0_Time_8976492442EE7DF41645EDBAB6FCEB40) == 0x000340, "Member 'AB_TimeLineDecal_C::Timeline_0_Time_8976492442EE7DF41645EDBAB6FCEB40' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, Timeline_0_WaveOffset_8976492442EE7DF41645EDBAB6FCEB40) == 0x000344, "Member 'AB_TimeLineDecal_C::Timeline_0_WaveOffset_8976492442EE7DF41645EDBAB6FCEB40' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, Timeline_0_Intensity_8976492442EE7DF41645EDBAB6FCEB40) == 0x000348, "Member 'AB_TimeLineDecal_C::Timeline_0_Intensity_8976492442EE7DF41645EDBAB6FCEB40' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, Timeline_0__Direction_8976492442EE7DF41645EDBAB6FCEB40) == 0x00034C, "Member 'AB_TimeLineDecal_C::Timeline_0__Direction_8976492442EE7DF41645EDBAB6FCEB40' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, Timeline_0) == 0x000350, "Member 'AB_TimeLineDecal_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AB_TimeLineDecal_C, DecalMID) == 0x000358, "Member 'AB_TimeLineDecal_C::DecalMID' has a wrong offset!");

}

