#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TimeLineDecal

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_TimeLineDecal.B_TimeLineDecal_C.ExecuteUbergraph_B_TimeLineDecal
// 0x0004 (0x0004 - 0x0000)
struct B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal) == 0x000004, "Wrong alignment on B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal");
static_assert(sizeof(B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal) == 0x000004, "Wrong size on B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal");
static_assert(offsetof(B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal, EntryPoint) == 0x000000, "Member 'B_TimeLineDecal_C_ExecuteUbergraph_B_TimeLineDecal::EntryPoint' has a wrong offset!");

// Function B_TimeLineDecal.B_TimeLineDecal_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct B_TimeLineDecal_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TimeLineDecal_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_TimeLineDecal_C_UserConstructionScript");
static_assert(sizeof(B_TimeLineDecal_C_UserConstructionScript) == 0x000008, "Wrong size on B_TimeLineDecal_C_UserConstructionScript");
static_assert(offsetof(B_TimeLineDecal_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'B_TimeLineDecal_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

