#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TNT_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_TNT_Athena.B_TNT_Athena_C.Spline Point Locations
// 0x00B0 (0x00B0 - 0x0000)
struct B_TNT_Athena_C_Spline_Point_Locations final
{
public:
	TArray<struct FVector>                        Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue1;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue1;    // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue3;           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue2;    // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue3;    // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(B_TNT_Athena_C_Spline_Point_Locations) == 0x000010, "Wrong alignment on B_TNT_Athena_C_Spline_Point_Locations");
static_assert(sizeof(B_TNT_Athena_C_Spline_Point_Locations) == 0x0000B0, "Wrong size on B_TNT_Athena_C_Spline_Point_Locations");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, Array) == 0x000000, "Member 'B_TNT_Athena_C_Spline_Point_Locations::Array' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue) == 0x000040, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue1) == 0x00004C, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue) == 0x000058, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue1) == 0x000064, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue2) == 0x000070, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue3) == 0x00007C, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue2) == 0x000088, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue3) == 0x000094, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, K2Node_MakeArray_Array) == 0x0000A0, "Member 'B_TNT_Athena_C_Spline_Point_Locations::K2Node_MakeArray_Array' has a wrong offset!");

}

