#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionVehicleTileItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FortExpeditionVehicleTileItemWidget.BP_FortExpeditionVehicleTileItemWidget_C
// 0x0038 (0x0B78 - 0x0B40)
class UBP_FortExpeditionVehicleTileItemWidget_C final : public UFortExpeditionVehicleTileItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBasicRatingWidget_C*                   BasicRatingWidget;                                 // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Name_BP_FortExpeditionVehicleTileItemWidget_C;     // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VehicleIcon;                                       // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   SquadIdName;                                       // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnVehicleSelected;                                 // 0x0B68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnVehicleSelected__DelegateSignature(class FName Param_SquadId);
	void ExecuteUbergraph_BP_FortExpeditionVehicleTileItemWidget(int32 EntryPoint);
	void BP_OnClicked();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void Set_Icon(const class FName& Param_SquadId);
	void Set_Rating(const class FName& Param_SquadId);
	void Set_Name(const class FName Param_SquadId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FortExpeditionVehicleTileItemWidget_C">();
	}
	static class UBP_FortExpeditionVehicleTileItemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FortExpeditionVehicleTileItemWidget_C>();
	}
};
static_assert(alignof(UBP_FortExpeditionVehicleTileItemWidget_C) == 0x000008, "Wrong alignment on UBP_FortExpeditionVehicleTileItemWidget_C");
static_assert(sizeof(UBP_FortExpeditionVehicleTileItemWidget_C) == 0x000B78, "Wrong size on UBP_FortExpeditionVehicleTileItemWidget_C");
static_assert(offsetof(UBP_FortExpeditionVehicleTileItemWidget_C, UberGraphFrame) == 0x000B40, "Member 'UBP_FortExpeditionVehicleTileItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionVehicleTileItemWidget_C, BasicRatingWidget) == 0x000B48, "Member 'UBP_FortExpeditionVehicleTileItemWidget_C::BasicRatingWidget' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionVehicleTileItemWidget_C, Name_BP_FortExpeditionVehicleTileItemWidget_C) == 0x000B50, "Member 'UBP_FortExpeditionVehicleTileItemWidget_C::Name_BP_FortExpeditionVehicleTileItemWidget_C' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionVehicleTileItemWidget_C, VehicleIcon) == 0x000B58, "Member 'UBP_FortExpeditionVehicleTileItemWidget_C::VehicleIcon' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionVehicleTileItemWidget_C, SquadIdName) == 0x000B60, "Member 'UBP_FortExpeditionVehicleTileItemWidget_C::SquadIdName' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionVehicleTileItemWidget_C, OnVehicleSelected) == 0x000B68, "Member 'UBP_FortExpeditionVehicleTileItemWidget_C::OnVehicleSelected' has a wrong offset!");

}

