#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hex_PARENT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.ExecuteUbergraph_BP_Hex_PARENT
// 0x0650 (0x0650 - 0x0000)
struct BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTilePlayable_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TeamPower;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PersonalPower;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue3; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_IsTileValidForMarkedQuest_OutMarkedQuest; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTileValidForMarkedQuest_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidMissionData_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATheaterCamera_Blueprint_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTileHidden_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTileLocked_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue1;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPublicAccountInfo                 CallFunc_GetCurrentlyViewedAccountInfo_Result;     // 0x00A8(0x0034)(NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue2;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue1;         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue1;           // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName EventName, float EmitterTime, int32 ParticleTime, const struct FVector& Location, const struct FVector& Velocity, const struct FVector& Direction)> K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable1;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable2;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_Select_Default;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATheaterCamera_Blueprint_C*             CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Get_Conning_Color_For_Specific_Difficulty_Difficulty_Linear_Color; // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Conning_Color_For_Specific_Difficulty_Invalid; // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMissionDetails                    CallFunc_GetTileMissionDetails_MissionDetails;     // 0x01A8(0x0168)()
	bool                                          CallFunc_GetTileMissionDetails_ReturnValue;        // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color; // 0x0324(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Conning_Color_From_Difficulty_Value_Success; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText; // 0x0338(0x0018)()
	int32                                         CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 TeamPower, int32 PersonalPower)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName1;                     // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime1;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location1;                      // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity1;                      // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x03AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime;                    // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ParticleTime;                   // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Direction;                      // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue7;                  // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMissionDetails                    CallFunc_GetTileMissionDetails_MissionDetails1;    // 0x03E8(0x0168)()
	bool                                          CallFunc_GetTileMissionDetails_ReturnValue1;       // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_Material_Instance_Dynamic;      // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_Unique_Net_Id;                  // 0x0570(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfoForPlayer_Result;          // 0x05A0(0x0040)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue1;           // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBannerColorPrimaryColorFromRowName_ReturnValue; // 0x05F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue; // 0x0600(0x0028)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBannerColorSecondaryColorFromRowName_ReturnValue; // 0x0628(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate4;             // 0x0638(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsTeamRatingDataValid_ReturnValue;        // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT");
static_assert(sizeof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT) == 0x000650, "Wrong size on BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, EntryPoint) == 0x000000, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsTilePlayable_ReturnValue) == 0x000005, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsTilePlayable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_TeamPower) == 0x000008, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_TeamPower' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_PersonalPower) == 0x00000C, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_PersonalPower' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000018, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000020, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_CreateDynamicMaterialInstance_ReturnValue3) == 0x000028, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_CreateDynamicMaterialInstance_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_NewCamera) == 0x000030, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_NewCamera' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_OldCamera) == 0x000031, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_OldCamera' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000032, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000033, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000034, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000035, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsTileValidForMarkedQuest_OutMarkedQuest) == 0x000038, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsTileValidForMarkedQuest_OutMarkedQuest' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsTileValidForMarkedQuest_ReturnValue) == 0x000040, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsTileValidForMarkedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_HasValidMissionData_ReturnValue) == 0x000041, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_HasValidMissionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_RandomFloatInRange_ReturnValue) == 0x00005C, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsTileHidden_ReturnValue) == 0x000060, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsTileHidden_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsTileLocked_ReturnValue) == 0x000061, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsTileLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetPlayerController_ReturnValue1) == 0x000070, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, Temp_object_Variable) == 0x000078, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_DynamicCast_AsTexture_2D) == 0x000088, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue) == 0x000098, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue1) == 0x0000A0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetCurrentlyViewedAccountInfo_Result) == 0x0000A8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetCurrentlyViewedAccountInfo_Result' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000DC, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000DD, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue2) == 0x0000E0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_BooleanAND_ReturnValue) == 0x0000E8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetCurrentInputType_ReturnValue1) == 0x0000E9, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetCurrentInputType_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_NotEqual_ByteByte_ReturnValue1) == 0x0000EA, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_NotEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_BooleanAND_ReturnValue1) == 0x0000EB, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CreateDelegate_OutputDelegate1) == 0x0000FC, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue3) == 0x000110, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, Temp_object_Variable1) == 0x000118, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_RandomFloatInRange_ReturnValue1) == 0x000120, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000128, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_SpawnSoundAttached_ReturnValue1) == 0x000130, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_SpawnSoundAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000138, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_RandomFloatInRange_ReturnValue3) == 0x00013C, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, Temp_object_Variable2) == 0x000140, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, Temp_bool_Variable) == 0x000148, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_Select_Default) == 0x000150, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, Temp_int_Array_Index_Variable) == 0x000158, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue4) == 0x000160, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Array_Get_Item) == 0x000168, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Get_Conning_Color_For_Specific_Difficulty_Difficulty_Linear_Color) == 0x000174, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Get_Conning_Color_For_Specific_Difficulty_Difficulty_Linear_Color' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Get_Conning_Color_For_Specific_Difficulty_Invalid) == 0x000184, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Get_Conning_Color_For_Specific_Difficulty_Invalid' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000188, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CreateDelegate_OutputDelegate2) == 0x000194, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetTileMissionDetails_MissionDetails) == 0x0001A8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetTileMissionDetails_MissionDetails' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetTileMissionDetails_ReturnValue) == 0x000310, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetTileMissionDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue5) == 0x000318, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000320, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color) == 0x000324, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Get_Conning_Color_From_Difficulty_Value_Success) == 0x000334, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Get_Conning_Color_From_Difficulty_Value_Success' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText) == 0x000338, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue) == 0x000350, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_MakeLiteralByte_ReturnValue) == 0x000354, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CreateDelegate_OutputDelegate3) == 0x000358, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, Temp_int_Loop_Counter_Variable) == 0x000368, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Less_IntInt_ReturnValue) == 0x00036C, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Add_IntInt_ReturnValue) == 0x000370, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue6) == 0x000378, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000380, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_EventName1) == 0x000388, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_EventName1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_EmitterTime1) == 0x000390, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_EmitterTime1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Location1) == 0x000394, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Location1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Velocity1) == 0x0003A0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Velocity1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_EventName) == 0x0003AC, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_EmitterTime) == 0x0003B4, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_ParticleTime) == 0x0003B8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_ParticleTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Location) == 0x0003BC, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Velocity) == 0x0003C8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Direction) == 0x0003D4, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetContext_ReturnValue7) == 0x0003E0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetTileMissionDetails_MissionDetails1) == 0x0003E8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetTileMissionDetails_MissionDetails1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetTileMissionDetails_ReturnValue1) == 0x000550, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetTileMissionDetails_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_DynamicCast_AsTexture) == 0x000558, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_DynamicCast_bSuccess1) == 0x000560, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Material_Instance_Dynamic) == 0x000568, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CustomEvent_Unique_Net_Id) == 0x000570, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CustomEvent_Unique_Net_Id' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000598, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetHomeBaseInfoForPlayer_Result) == 0x0005A0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetHomeBaseInfoForPlayer_Result' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Conv_StringToName_ReturnValue) == 0x0005E0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_Conv_StringToName_ReturnValue1) == 0x0005E8, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_Conv_StringToName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetBannerColorPrimaryColorFromRowName_ReturnValue) == 0x0005F0, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetBannerColorPrimaryColorFromRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue) == 0x000600, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetBannerLargeIconAssetFromRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_GetBannerColorSecondaryColorFromRowName_ReturnValue) == 0x000628, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_GetBannerColorSecondaryColorFromRowName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, K2Node_CreateDelegate_OutputDelegate4) == 0x000638, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT, CallFunc_IsTeamRatingDataValid_ReturnValue) == 0x000648, "Member 'BP_Hex_PARENT_C_ExecuteUbergraph_BP_Hex_PARENT::CallFunc_IsTeamRatingDataValid_ReturnValue' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.AsyncUpdateBanner
// 0x0030 (0x0030 - 0x0000)
struct BP_Hex_PARENT_C_AsyncUpdateBanner final
{
public:
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       Unique_Net_Id;                                     // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_AsyncUpdateBanner) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_AsyncUpdateBanner");
static_assert(sizeof(BP_Hex_PARENT_C_AsyncUpdateBanner) == 0x000030, "Wrong size on BP_Hex_PARENT_C_AsyncUpdateBanner");
static_assert(offsetof(BP_Hex_PARENT_C_AsyncUpdateBanner, Material_Instance_Dynamic) == 0x000000, "Member 'BP_Hex_PARENT_C_AsyncUpdateBanner::Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_AsyncUpdateBanner, Unique_Net_Id) == 0x000008, "Member 'BP_Hex_PARENT_C_AsyncUpdateBanner::Unique_Net_Id' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.MissionLightningOff
// 0x0034 (0x0034 - 0x0000)
struct BP_Hex_PARENT_C_MissionLightningOff final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParticleTime;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_MissionLightningOff) == 0x000004, "Wrong alignment on BP_Hex_PARENT_C_MissionLightningOff");
static_assert(sizeof(BP_Hex_PARENT_C_MissionLightningOff) == 0x000034, "Wrong size on BP_Hex_PARENT_C_MissionLightningOff");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, EventName) == 0x000000, "Member 'BP_Hex_PARENT_C_MissionLightningOff::EventName' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, EmitterTime) == 0x000008, "Member 'BP_Hex_PARENT_C_MissionLightningOff::EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, ParticleTime) == 0x00000C, "Member 'BP_Hex_PARENT_C_MissionLightningOff::ParticleTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, Location) == 0x000010, "Member 'BP_Hex_PARENT_C_MissionLightningOff::Location' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, Velocity) == 0x00001C, "Member 'BP_Hex_PARENT_C_MissionLightningOff::Velocity' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightningOff, Direction) == 0x000028, "Member 'BP_Hex_PARENT_C_MissionLightningOff::Direction' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.MissionLightning
// 0x0024 (0x0024 - 0x0000)
struct BP_Hex_PARENT_C_MissionLightning final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_MissionLightning) == 0x000004, "Wrong alignment on BP_Hex_PARENT_C_MissionLightning");
static_assert(sizeof(BP_Hex_PARENT_C_MissionLightning) == 0x000024, "Wrong size on BP_Hex_PARENT_C_MissionLightning");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, EventName) == 0x000000, "Member 'BP_Hex_PARENT_C_MissionLightning::EventName' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, EmitterTime) == 0x000008, "Member 'BP_Hex_PARENT_C_MissionLightning::EmitterTime' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, Location) == 0x00000C, "Member 'BP_Hex_PARENT_C_MissionLightning::Location' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_MissionLightning, Velocity) == 0x000018, "Member 'BP_Hex_PARENT_C_MissionLightning::Velocity' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HandleFrontendCameraChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_Hex_PARENT_C_HandleFrontendCameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_HandleFrontendCameraChanged) == 0x000001, "Wrong alignment on BP_Hex_PARENT_C_HandleFrontendCameraChanged");
static_assert(sizeof(BP_Hex_PARENT_C_HandleFrontendCameraChanged) == 0x000002, "Wrong size on BP_Hex_PARENT_C_HandleFrontendCameraChanged");
static_assert(offsetof(BP_Hex_PARENT_C_HandleFrontendCameraChanged, NewCamera) == 0x000000, "Member 'BP_Hex_PARENT_C_HandleFrontendCameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleFrontendCameraChanged, OldCamera) == 0x000001, "Member 'BP_Hex_PARENT_C_HandleFrontendCameraChanged::OldCamera' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.HandleTeamPowerChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Hex_PARENT_C_HandleTeamPowerChanged final
{
public:
	int32                                         TeamPower;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PersonalPower;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_HandleTeamPowerChanged) == 0x000004, "Wrong alignment on BP_Hex_PARENT_C_HandleTeamPowerChanged");
static_assert(sizeof(BP_Hex_PARENT_C_HandleTeamPowerChanged) == 0x000008, "Wrong size on BP_Hex_PARENT_C_HandleTeamPowerChanged");
static_assert(offsetof(BP_Hex_PARENT_C_HandleTeamPowerChanged, TeamPower) == 0x000000, "Member 'BP_Hex_PARENT_C_HandleTeamPowerChanged::TeamPower' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_HandleTeamPowerChanged, PersonalPower) == 0x000004, "Member 'BP_Hex_PARENT_C_HandleTeamPowerChanged::PersonalPower' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.OnLoaded_192496DB41CC2100CC1C729DB594CEF8
// 0x0008 (0x0008 - 0x0000)
struct BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8) == 0x000008, "Wrong alignment on BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8");
static_assert(sizeof(BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8) == 0x000008, "Wrong size on BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8");
static_assert(offsetof(BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8, Loaded) == 0x000000, "Member 'BP_Hex_PARENT_C_OnLoaded_192496DB41CC2100CC1C729DB594CEF8::Loaded' has a wrong offset!");

// Function BP_Hex_PARENT.BP_Hex_PARENT_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct BP_Hex_PARENT_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hex_PARENT_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Hex_PARENT_C_UserConstructionScript");
static_assert(sizeof(BP_Hex_PARENT_C_UserConstructionScript) == 0x000070, "Wrong size on BP_Hex_PARENT_C_UserConstructionScript");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_Hex_PARENT_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000048, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000050, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hex_PARENT_C_UserConstructionScript, CallFunc_Array_LastIndex_ReturnValue) == 0x000058, "Member 'BP_Hex_PARENT_C_UserConstructionScript::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
