#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CareerScreen

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CareerScreen.CareerScreen_C.ExecuteUbergraph_CareerScreen
// 0x0148 (0x0148 - 0x0000)
struct CareerScreen_C_ExecuteUbergraph_CareerScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaLeaderboardTab_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaReplayBrowserTab_C*              CallFunc_Create_ReturnValue1;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue2;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URootProfileStatsScreen_C*              CallFunc_Create_ReturnValue2;                      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0070(0x0028)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue3;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaStatsTab_C*                      CallFunc_Create_ReturnValue3;                      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue4;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue4;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URecentMatchesStatScreen_C*             CallFunc_Create_ReturnValue4;                      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue1;            // 0x00D8(0x0028)(HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFirstInteractableWidget_Widget;        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CareerScreen_C_ExecuteUbergraph_CareerScreen) == 0x000008, "Wrong alignment on CareerScreen_C_ExecuteUbergraph_CareerScreen");
static_assert(sizeof(CareerScreen_C_ExecuteUbergraph_CareerScreen) == 0x000148, "Wrong size on CareerScreen_C_ExecuteUbergraph_CareerScreen");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, EntryPoint) == 0x000000, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetOwningPlayer_ReturnValue1) == 0x000020, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetOwningPlayer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_IsMobileGame_ReturnValue) == 0x000028, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Create_ReturnValue1) == 0x000030, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_IsMobileGame_ReturnValue1) == 0x000038, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_IsMobileGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_IsMobileGame_ReturnValue2) == 0x000039, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_IsMobileGame_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetUIManagerWidget_ReturnValue1) == 0x000040, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetUIManagerWidget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000048, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000050, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000058, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Create_ReturnValue2) == 0x000068, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetGameAccountId_ReturnValue) == 0x000070, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetOwningPlayer_ReturnValue3) == 0x000098, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetUIManagerWidget_ReturnValue3) == 0x0000A0, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetUIManagerWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Create_ReturnValue3) == 0x0000A8, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetUIManagerWidget_ReturnValue4) == 0x0000B0, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetUIManagerWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetOwningPlayer_ReturnValue4) == 0x0000B8, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetOwningPlayer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_DynamicCast_AsFort_Player_Controller1) == 0x0000C0, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_DynamicCast_AsFort_Player_Controller1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_DynamicCast_bSuccess1) == 0x0000C8, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_Create_ReturnValue4) == 0x0000D0, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_Create_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetGameAccountId_ReturnValue1) == 0x0000D8, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetGameAccountId_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_ComponentBoundEvent_Button4) == 0x000100, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_ComponentBoundEvent_Button3) == 0x000108, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_ComponentBoundEvent_Button2) == 0x000110, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_ComponentBoundEvent_Button1) == 0x000118, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, K2Node_ComponentBoundEvent_Button) == 0x000120, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetUINavigationManager_ReturnValue) == 0x000128, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetFirstInteractableWidget_Widget) == 0x000130, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetFirstInteractableWidget_Widget' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_GetContext_ReturnValue) == 0x000138, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ExecuteUbergraph_CareerScreen, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'CareerScreen_C_ExecuteUbergraph_CareerScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CareerScreen_C_BndEvt__RecentGamesBtn_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CareerScreen_C_BndEvt__ReplaysBtn_K2Node_ComponentBoundEvent_262_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CareerScreen_C_BndEvt__LeaderboardsBtn_K2Node_ComponentBoundEvent_245_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CareerScreen_C_BndEvt__ProfileBtn_K2Node_ComponentBoundEvent_228_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CareerScreen_C_BndEvt__ProfileStatsBtn_K2Node_ComponentBoundEvent_211_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.SetupButtonStates
// 0x0030 (0x0030 - 0x0000)
struct CareerScreen_C_SetupButtonStates final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           Temp_byte_Variable4;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIFeatureState                           Temp_byte_Variable5;                               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_SetupButtonStates) == 0x000008, "Wrong alignment on CareerScreen_C_SetupButtonStates");
static_assert(sizeof(CareerScreen_C_SetupButtonStates) == 0x000030, "Wrong size on CareerScreen_C_SetupButtonStates");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_byte_Variable) == 0x000000, "Member 'CareerScreen_C_SetupButtonStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_byte_Variable1) == 0x000001, "Member 'CareerScreen_C_SetupButtonStates::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_byte_Variable2) == 0x000002, "Member 'CareerScreen_C_SetupButtonStates::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_byte_Variable3) == 0x000003, "Member 'CareerScreen_C_SetupButtonStates::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_byte_Variable4) == 0x000004, "Member 'CareerScreen_C_SetupButtonStates::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_bool_Variable) == 0x000005, "Member 'CareerScreen_C_SetupButtonStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_bool_Variable1) == 0x000006, "Member 'CareerScreen_C_SetupButtonStates::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_bool_Variable2) == 0x000007, "Member 'CareerScreen_C_SetupButtonStates::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_bool_Variable3) == 0x000008, "Member 'CareerScreen_C_SetupButtonStates::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'CareerScreen_C_SetupButtonStates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, CallFunc_GetFeatureState_OutFeatureState) == 0x000018, "Member 'CareerScreen_C_SetupButtonStates::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, CallFunc_GetFeatureState_OutReason) == 0x000019, "Member 'CareerScreen_C_SetupButtonStates::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000020, "Member 'CareerScreen_C_SetupButtonStates::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, K2Node_Select_Default) == 0x000028, "Member 'CareerScreen_C_SetupButtonStates::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'CareerScreen_C_SetupButtonStates::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, CallFunc_Not_PreBool_ReturnValue1) == 0x00002A, "Member 'CareerScreen_C_SetupButtonStates::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, Temp_byte_Variable5) == 0x00002B, "Member 'CareerScreen_C_SetupButtonStates::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_SetupButtonStates, K2Node_Select1_Default) == 0x00002C, "Member 'CareerScreen_C_SetupButtonStates::K2Node_Select1_Default' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.GetFirstInteractableWidget
// 0x0030 (0x0030 - 0x0000)
struct CareerScreen_C_GetFirstInteractableWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_DynamicCast_AsCommon_Button;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInteractionEnabled_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CareerScreen_C_GetFirstInteractableWidget) == 0x000008, "Wrong alignment on CareerScreen_C_GetFirstInteractableWidget");
static_assert(sizeof(CareerScreen_C_GetFirstInteractableWidget) == 0x000030, "Wrong size on CareerScreen_C_GetFirstInteractableWidget");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, Widget) == 0x000000, "Member 'CareerScreen_C_GetFirstInteractableWidget::Widget' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, Temp_int_Variable) == 0x000008, "Member 'CareerScreen_C_GetFirstInteractableWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x00000C, "Member 'CareerScreen_C_GetFirstInteractableWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'CareerScreen_C_GetFirstInteractableWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'CareerScreen_C_GetFirstInteractableWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'CareerScreen_C_GetFirstInteractableWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, K2Node_DynamicCast_AsCommon_Button) == 0x000020, "Member 'CareerScreen_C_GetFirstInteractableWidget::K2Node_DynamicCast_AsCommon_Button' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CareerScreen_C_GetFirstInteractableWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, CallFunc_IsInteractionEnabled_ReturnValue) == 0x000029, "Member 'CareerScreen_C_GetFirstInteractableWidget::CallFunc_IsInteractionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_GetFirstInteractableWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'CareerScreen_C_GetFirstInteractableWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CareerScreen.CareerScreen_C.ApplyHotfixButtonStates
// 0x0048 (0x0048 - 0x0000)
struct CareerScreen_C_ApplyHotfixButtonStates final
{
public:
	class UCommonButton*                          SelectedButton;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRuntimeOptionTabStateInfo>     CallFunc_GetDisabledFrontendNavigationTabs_ReturnValue; // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeOptionTabStateInfo             CallFunc_Array_Get_Item;                           // 0x0034(0x000C)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CareerScreen_C_ApplyHotfixButtonStates) == 0x000008, "Wrong alignment on CareerScreen_C_ApplyHotfixButtonStates");
static_assert(sizeof(CareerScreen_C_ApplyHotfixButtonStates) == 0x000048, "Wrong size on CareerScreen_C_ApplyHotfixButtonStates");
static_assert(offsetof(CareerScreen_C_ApplyHotfixButtonStates, SelectedButton) == 0x000000, "Member 'CareerScreen_C_ApplyHotfixButtonStates::SelectedButton' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ApplyHotfixButtonStates, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CareerScreen_C_ApplyHotfixButtonStates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CareerScreen_C_ApplyHotfixButtonStates, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'CareerScreen_C_ApplyHotfixButtonStates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
