#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Blade_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CBGA_Blade_Athena.CBGA_Blade_Athena_C
// 0x0040 (0x0808 - 0x07C8)
class ACBGA_Blade_Athena_C final : public ABuildingGameplayActorBlade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_IBlade_Pull_SwordOnly;                           // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Sword;                                             // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientLooping;                                    // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PickupBeam;                                        // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BeamFX;                                            // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CBGA_Blade_Athena(int32 EntryPoint);
	void OnPullAborted();
	void OnPullStart();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetDrawDistance();

	bool BlueprintCanInteract(const class AFortPawn* Param_InteractingPawn) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* Param_InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CBGA_Blade_Athena_C">();
	}
	static class ACBGA_Blade_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBGA_Blade_Athena_C>();
	}
};
static_assert(alignof(ACBGA_Blade_Athena_C) == 0x000008, "Wrong alignment on ACBGA_Blade_Athena_C");
static_assert(sizeof(ACBGA_Blade_Athena_C) == 0x000808, "Wrong size on ACBGA_Blade_Athena_C");
static_assert(offsetof(ACBGA_Blade_Athena_C, UberGraphFrame) == 0x0007C8, "Member 'ACBGA_Blade_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, Box) == 0x0007D0, "Member 'ACBGA_Blade_Athena_C::Box' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, P_IBlade_Pull_SwordOnly) == 0x0007D8, "Member 'ACBGA_Blade_Athena_C::P_IBlade_Pull_SwordOnly' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, Sword) == 0x0007E0, "Member 'ACBGA_Blade_Athena_C::Sword' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, AmbientLooping) == 0x0007E8, "Member 'ACBGA_Blade_Athena_C::AmbientLooping' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, Capsule) == 0x0007F0, "Member 'ACBGA_Blade_Athena_C::Capsule' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, PickupBeam) == 0x0007F8, "Member 'ACBGA_Blade_Athena_C::PickupBeam' has a wrong offset!");
static_assert(offsetof(ACBGA_Blade_Athena_C, BeamFX) == 0x000800, "Member 'ACBGA_Blade_Athena_C::BeamFX' has a wrong offset!");

}

