#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Blade_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CBGA_Blade_Athena.CBGA_Blade_Athena_C.ExecuteUbergraph_CBGA_Blade_Athena
// 0x0060 (0x0060 - 0x0000)
struct CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue1;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena) == 0x000008, "Wrong alignment on CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena");
static_assert(sizeof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena) == 0x000060, "Wrong size on CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, EntryPoint) == 0x000000, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000010, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00001C, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000028, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000030, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, K2Node_Event_EndPlayReason) == 0x000038, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_IsActive_ReturnValue) == 0x000039, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_IsValid_ReturnValue1) == 0x00003B, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00003C, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_K2_GetActorRotation_ReturnValue1) == 0x000048, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_K2_GetActorRotation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x000058, "Member 'CBGA_Blade_Athena_C_ExecuteUbergraph_CBGA_Blade_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");

// Function CBGA_Blade_Athena.CBGA_Blade_Athena_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct CBGA_Blade_Athena_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Blade_Athena_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on CBGA_Blade_Athena_C_ReceiveEndPlay");
static_assert(sizeof(CBGA_Blade_Athena_C_ReceiveEndPlay) == 0x000001, "Wrong size on CBGA_Blade_Athena_C_ReceiveEndPlay");
static_assert(offsetof(CBGA_Blade_Athena_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'CBGA_Blade_Athena_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function CBGA_Blade_Athena.CBGA_Blade_Athena_C.SetDrawDistance
// 0x0070 (0x0070 - 0x0000)
struct CBGA_Blade_Athena_C_SetDrawDistance final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetComponentsByClass_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CBGA_Blade_Athena_C_SetDrawDistance) == 0x000008, "Wrong alignment on CBGA_Blade_Athena_C_SetDrawDistance");
static_assert(sizeof(CBGA_Blade_Athena_C_SetDrawDistance) == 0x000070, "Wrong size on CBGA_Blade_Athena_C_SetDrawDistance");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, Temp_bool_Variable) == 0x000000, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, Temp_float_Variable) == 0x000010, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, Temp_bool_Variable1) == 0x000014, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_GetNumericCVar_OutValue) == 0x000028, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_GetNumericCVar_ReturnValue) == 0x00002C, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_Array_Get_Item) == 0x000030, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, K2Node_Select_Default) == 0x00003C, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000044, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_GetGameState_ReturnValue) == 0x000050, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000058, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, K2Node_Select1_Default) == 0x000064, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_SetDrawDistance, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'CBGA_Blade_Athena_C_SetDrawDistance::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function CBGA_Blade_Athena.CBGA_Blade_Athena_C.BlueprintCanInteract
// 0x0050 (0x0050 - 0x0000)
struct CBGA_Blade_Athena_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasControlledRCPawn_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortRemoteControlledPawnAthena*        K2Node_DynamicCast_AsFort_Remote_Controlled_Pawn_Athena; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CBGA_Blade_Athena_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on CBGA_Blade_Athena_C_BlueprintCanInteract");
static_assert(sizeof(CBGA_Blade_Athena_C_BlueprintCanInteract) == 0x000050, "Wrong size on CBGA_Blade_Athena_C_BlueprintCanInteract");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, Param_InteractingPawn) == 0x000000, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, ReturnValue) == 0x000008, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, PlayerPawn) == 0x000010, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::PlayerPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_HasControlledRCPawn_ReturnValue) == 0x000021, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_HasControlledRCPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, K2Node_DynamicCast_AsFort_Remote_Controlled_Pawn_Athena) == 0x000028, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::K2Node_DynamicCast_AsFort_Remote_Controlled_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000038, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000048, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue1) == 0x000049, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue2) == 0x00004A, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue1) == 0x00004C, "Member 'CBGA_Blade_Athena_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function CBGA_Blade_Athena.CBGA_Blade_Athena_C.BlueprintGetInteractionString
// 0x0020 (0x0020 - 0x0000)
struct CBGA_Blade_Athena_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        Param_InteractingPawn;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(CBGA_Blade_Athena_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on CBGA_Blade_Athena_C_BlueprintGetInteractionString");
static_assert(sizeof(CBGA_Blade_Athena_C_BlueprintGetInteractionString) == 0x000020, "Wrong size on CBGA_Blade_Athena_C_BlueprintGetInteractionString");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintGetInteractionString, Param_InteractingPawn) == 0x000000, "Member 'CBGA_Blade_Athena_C_BlueprintGetInteractionString::Param_InteractingPawn' has a wrong offset!");
static_assert(offsetof(CBGA_Blade_Athena_C_BlueprintGetInteractionString, ReturnValue) == 0x000008, "Member 'CBGA_Blade_Athena_C_BlueprintGetInteractionString::ReturnValue' has a wrong offset!");

}

