#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeQuestWidget

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeQuestWidget.ChallengeQuestWidget_C
// 0x0108 (0x0340 - 0x0238)
class UChallengeQuestWidget_C final : public UCommonUserWidget
{
public:
	class UOverlay*                               BattleStars;                                       // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ChainIndex;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ChainLength;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ChallengeContent;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClaimedCheck;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDailyQuestProgressWidget_C*            DailyQuestProgressWidget;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDailyQuestRewardInfo_C*                DailyQuestRewardInfo;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HardTag;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HiddenQuestGlow;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LeftImage;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LinearChainQuest;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MidContentSwitcher;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MidProgressVB;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MidUnknownVB;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ProgressBar;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ProgressText;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChallengeBundleLockedReasonDisplay_C*  QuestLockedReason;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RewardSwitcher;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TaskName;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest;                                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestObjectiveInfo*>        VisibleObjectives;                                 // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortQuestItemDefinition*               QuestDefinition;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UFortPersistentResourceItemDefinition> StarsItemDefinition;                               // 0x0308(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TScriptInterface<class IFortTimespanDataSource> TimeSpanSource;                                    // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetQuestItem(class UFortQuestItem* Param_Quest, class UFortQuestItemDefinition* Param_QuestDefinition, class UFortChallengeBundleInfo* Bundle);
	void StyleAsComplete();
	void StyleAsIncomplete();
	void UpdateProgress();
	EFortQuestState GetQuestState();
	void GetAchievedCount(int32* OutTotalAchievedCount, int32* OutTotalRequiredCount);
	void UpdateName();
	void StyleAsInvalid();
	void StyleAsLocked(const class FText& LockedText, class UFortChallengeBundleInfo* BundleInfo, class UFortQuestItem* QuestItem, class UFortQuestItemDefinition* QuestDef);
	void StyleAsLinearChain(int32 Param_ChainLength, int32 Param_ChainIndex);
	void GetTimeSpanValue(struct FTimespan* OutTimeSpan);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeQuestWidget_C">();
	}
	static class UChallengeQuestWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeQuestWidget_C>();
	}
};
static_assert(alignof(UChallengeQuestWidget_C) == 0x000008, "Wrong alignment on UChallengeQuestWidget_C");
static_assert(sizeof(UChallengeQuestWidget_C) == 0x000340, "Wrong size on UChallengeQuestWidget_C");
static_assert(offsetof(UChallengeQuestWidget_C, BattleStars) == 0x000238, "Member 'UChallengeQuestWidget_C::BattleStars' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, ChainIndex) == 0x000240, "Member 'UChallengeQuestWidget_C::ChainIndex' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, ChainLength) == 0x000248, "Member 'UChallengeQuestWidget_C::ChainLength' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, ChallengeContent) == 0x000250, "Member 'UChallengeQuestWidget_C::ChallengeContent' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, ClaimedCheck) == 0x000258, "Member 'UChallengeQuestWidget_C::ClaimedCheck' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, CommonTextBlock_2) == 0x000260, "Member 'UChallengeQuestWidget_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, DailyQuestProgressWidget) == 0x000268, "Member 'UChallengeQuestWidget_C::DailyQuestProgressWidget' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, DailyQuestRewardInfo) == 0x000270, "Member 'UChallengeQuestWidget_C::DailyQuestRewardInfo' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, Glow) == 0x000278, "Member 'UChallengeQuestWidget_C::Glow' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, HardTag) == 0x000280, "Member 'UChallengeQuestWidget_C::HardTag' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, HiddenQuestGlow) == 0x000288, "Member 'UChallengeQuestWidget_C::HiddenQuestGlow' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, Image_0) == 0x000290, "Member 'UChallengeQuestWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, LeftImage) == 0x000298, "Member 'UChallengeQuestWidget_C::LeftImage' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, LinearChainQuest) == 0x0002A0, "Member 'UChallengeQuestWidget_C::LinearChainQuest' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, MidContentSwitcher) == 0x0002A8, "Member 'UChallengeQuestWidget_C::MidContentSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, MidProgressVB) == 0x0002B0, "Member 'UChallengeQuestWidget_C::MidProgressVB' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, MidUnknownVB) == 0x0002B8, "Member 'UChallengeQuestWidget_C::MidUnknownVB' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, ProgressBar) == 0x0002C0, "Member 'UChallengeQuestWidget_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, ProgressText) == 0x0002C8, "Member 'UChallengeQuestWidget_C::ProgressText' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, QuestLockedReason) == 0x0002D0, "Member 'UChallengeQuestWidget_C::QuestLockedReason' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, RewardSwitcher) == 0x0002D8, "Member 'UChallengeQuestWidget_C::RewardSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, TaskName) == 0x0002E0, "Member 'UChallengeQuestWidget_C::TaskName' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, Quest) == 0x0002E8, "Member 'UChallengeQuestWidget_C::Quest' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, VisibleObjectives) == 0x0002F0, "Member 'UChallengeQuestWidget_C::VisibleObjectives' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, QuestDefinition) == 0x000300, "Member 'UChallengeQuestWidget_C::QuestDefinition' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, StarsItemDefinition) == 0x000308, "Member 'UChallengeQuestWidget_C::StarsItemDefinition' has a wrong offset!");
static_assert(offsetof(UChallengeQuestWidget_C, TimeSpanSource) == 0x000330, "Member 'UChallengeQuestWidget_C::TimeSpanSource' has a wrong offset!");

}

