#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeProgressWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeProgressWidget.ChallengeProgressWidget_C
// 0x0190 (0x03C8 - 0x0238)
class UChallengeProgressWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                ArrowLeftSpacer;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                ArrowRightSpacer;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BarSizeSB;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderXPBar;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CompletionSwitcher;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ProgressValue;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment1;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment10;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment11;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment12;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment13;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment14;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment15;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment16;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment17;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment18;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment19;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment2;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment3;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment4;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment5;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment6;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment7;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment8;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Segment9;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_0;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_1;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_2;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_3;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_4;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_5;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_6;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_7;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_8;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_9;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_10;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_11;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_12;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_13;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_14;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_15;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_16;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_17;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_18;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_19;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Unlock;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 XpBar;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowText;                                          // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowBar;                                           // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSmallProgressBar;                                // 0x03C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ChallengeProgressWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Update(int32 Achieved, int32 Required, float PercentComplete, float ThresholdPercent);
	void SegmentHack(int32 NumSegments);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeProgressWidget_C">();
	}
	static class UChallengeProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeProgressWidget_C>();
	}
};
static_assert(alignof(UChallengeProgressWidget_C) == 0x000008, "Wrong alignment on UChallengeProgressWidget_C");
static_assert(sizeof(UChallengeProgressWidget_C) == 0x0003C8, "Wrong size on UChallengeProgressWidget_C");
static_assert(offsetof(UChallengeProgressWidget_C, UberGraphFrame) == 0x000238, "Member 'UChallengeProgressWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, ArrowLeftSpacer) == 0x000240, "Member 'UChallengeProgressWidget_C::ArrowLeftSpacer' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, ArrowRightSpacer) == 0x000248, "Member 'UChallengeProgressWidget_C::ArrowRightSpacer' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, BarSizeSB) == 0x000250, "Member 'UChallengeProgressWidget_C::BarSizeSB' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, BorderXPBar) == 0x000258, "Member 'UChallengeProgressWidget_C::BorderXPBar' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Check) == 0x000260, "Member 'UChallengeProgressWidget_C::Check' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, CompletionSwitcher) == 0x000268, "Member 'UChallengeProgressWidget_C::CompletionSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, ProgressValue) == 0x000270, "Member 'UChallengeProgressWidget_C::ProgressValue' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment1) == 0x000278, "Member 'UChallengeProgressWidget_C::Segment1' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment10) == 0x000280, "Member 'UChallengeProgressWidget_C::Segment10' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment11) == 0x000288, "Member 'UChallengeProgressWidget_C::Segment11' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment12) == 0x000290, "Member 'UChallengeProgressWidget_C::Segment12' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment13) == 0x000298, "Member 'UChallengeProgressWidget_C::Segment13' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment14) == 0x0002A0, "Member 'UChallengeProgressWidget_C::Segment14' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment15) == 0x0002A8, "Member 'UChallengeProgressWidget_C::Segment15' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment16) == 0x0002B0, "Member 'UChallengeProgressWidget_C::Segment16' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment17) == 0x0002B8, "Member 'UChallengeProgressWidget_C::Segment17' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment18) == 0x0002C0, "Member 'UChallengeProgressWidget_C::Segment18' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment19) == 0x0002C8, "Member 'UChallengeProgressWidget_C::Segment19' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment2) == 0x0002D0, "Member 'UChallengeProgressWidget_C::Segment2' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment3) == 0x0002D8, "Member 'UChallengeProgressWidget_C::Segment3' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment4) == 0x0002E0, "Member 'UChallengeProgressWidget_C::Segment4' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment5) == 0x0002E8, "Member 'UChallengeProgressWidget_C::Segment5' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment6) == 0x0002F0, "Member 'UChallengeProgressWidget_C::Segment6' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment7) == 0x0002F8, "Member 'UChallengeProgressWidget_C::Segment7' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment8) == 0x000300, "Member 'UChallengeProgressWidget_C::Segment8' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Segment9) == 0x000308, "Member 'UChallengeProgressWidget_C::Segment9' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_0) == 0x000310, "Member 'UChallengeProgressWidget_C::Spacer_0' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_1) == 0x000318, "Member 'UChallengeProgressWidget_C::Spacer_1' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_2) == 0x000320, "Member 'UChallengeProgressWidget_C::Spacer_2' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_3) == 0x000328, "Member 'UChallengeProgressWidget_C::Spacer_3' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_4) == 0x000330, "Member 'UChallengeProgressWidget_C::Spacer_4' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_5) == 0x000338, "Member 'UChallengeProgressWidget_C::Spacer_5' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_6) == 0x000340, "Member 'UChallengeProgressWidget_C::Spacer_6' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_7) == 0x000348, "Member 'UChallengeProgressWidget_C::Spacer_7' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_8) == 0x000350, "Member 'UChallengeProgressWidget_C::Spacer_8' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_9) == 0x000358, "Member 'UChallengeProgressWidget_C::Spacer_9' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_10) == 0x000360, "Member 'UChallengeProgressWidget_C::Spacer_10' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_11) == 0x000368, "Member 'UChallengeProgressWidget_C::Spacer_11' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_12) == 0x000370, "Member 'UChallengeProgressWidget_C::Spacer_12' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_13) == 0x000378, "Member 'UChallengeProgressWidget_C::Spacer_13' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_14) == 0x000380, "Member 'UChallengeProgressWidget_C::Spacer_14' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_15) == 0x000388, "Member 'UChallengeProgressWidget_C::Spacer_15' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_16) == 0x000390, "Member 'UChallengeProgressWidget_C::Spacer_16' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_17) == 0x000398, "Member 'UChallengeProgressWidget_C::Spacer_17' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_18) == 0x0003A0, "Member 'UChallengeProgressWidget_C::Spacer_18' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Spacer_19) == 0x0003A8, "Member 'UChallengeProgressWidget_C::Spacer_19' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, Unlock) == 0x0003B0, "Member 'UChallengeProgressWidget_C::Unlock' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, XpBar) == 0x0003B8, "Member 'UChallengeProgressWidget_C::XpBar' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, ShowText) == 0x0003C0, "Member 'UChallengeProgressWidget_C::ShowText' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, ShowBar) == 0x0003C1, "Member 'UChallengeProgressWidget_C::ShowBar' has a wrong offset!");
static_assert(offsetof(UChallengeProgressWidget_C, IsSmallProgressBar) == 0x0003C2, "Member 'UChallengeProgressWidget_C::IsSmallProgressBar' has a wrong offset!");

}

