#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeBundlePage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeBundlePage.ChallengeBundlePage_C
// 0x0210 (0x0538 - 0x0328)
class UChallengeBundlePage_C final : public UFortChallengeBundleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro_0;                                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          One4DaysQuestCB;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           One4DaysQuestPanel;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BacchusCloseOverlay;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BaseQuestCB;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BaseQuestPanel;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattlePassLocked;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BattlePassQuestCB;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BattlePassQuestPanel;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderBackground;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChallengeProgressWidget_C*             ChallengeProgressWidget;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ClaimRewardsButton;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CrownGlow;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          FNBirthdayQuestCB;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FNBirthdayQuestPanel;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          FortnitemaresQuestCB;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FortnitemaresStyleQuestPanel;                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HandGlow;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           HeistQuestPannel;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          HiestQuestCB;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGlow;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_20;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_24;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_29;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_33;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeaderWidget;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LockCheckSwitcher;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 MainReward;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainViewItemInfoOverlay;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NeowizQuestCB;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NeowizQuestPanel;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         PageNextButton;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         PagePreviousButton;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         PanelButton;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PCBIcon;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestListTitle;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             QuestScrollBox;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RewardText;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          SkullTrooperQuestCB;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SkullTrooperStyleQuestPanel;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpacingLine;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChallengeBundleLockedReasonDisplay_C*  Status_Locked;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Status_ProgressVB;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        StatusSwitcher;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSwipePanel*                        SwipePanel;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TomatoHeadStyleQuestCB;                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TomatoHeadStyleQuestPanel;                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBattlePassLocked;                               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TopBattlePassQuestCB;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TopBattlePassQuestPanel;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopEdge;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopEdge1;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopEdge2;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopEdge3;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          VBucksQuestCB;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBucksQuestPanel;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaChallengesTab_C*                 AthenaChallengesTab;                               // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTimerTimespanDataSource*           TimerTimespanSource;                               // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeBundlePage(int32 EntryPoint);
	void OnDeactivated();
	void OnInitialized();
	void Construct();
	void OnActivated();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_26_OnFortSwipeEvent__DelegateSignature();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_11_OnFortSwipeEvent__DelegateSignature();
	void OnBundleUpdated();
	void BndEvt__PanelButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__PageNextButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__PagePreviousButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void UpdateBundle();
	void UpdateQuests();
	void ClaimNextQuestReward();
	void RegisterEventListeners();
	void CreateQuestWidget(class UFortQuestItem* Quest, class UFortQuestItemDefinition* QuestDefinition, class UPanelWidget* Panel);
	void HandleBack(bool* PassThrough);
	void Play_Intro();
	void Initial_Reset();
	void UpdateQuestList(EChallengeBundleQuestVisualStyle Visual_Style, class UPanelWidget* Panel, class UPanelWidget* Container, bool* HasClaimableQuests);
	void SetBackground();
	void ConstructTimespanSource(class UFortTimerTimespanDataSource** NewObject);

	void GetAthenaEventTime(struct FTimespan* Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeBundlePage_C">();
	}
	static class UChallengeBundlePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeBundlePage_C>();
	}
};
static_assert(alignof(UChallengeBundlePage_C) == 0x000008, "Wrong alignment on UChallengeBundlePage_C");
static_assert(sizeof(UChallengeBundlePage_C) == 0x000538, "Wrong size on UChallengeBundlePage_C");
static_assert(offsetof(UChallengeBundlePage_C, UberGraphFrame) == 0x000328, "Member 'UChallengeBundlePage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Intro_0) == 0x000330, "Member 'UChallengeBundlePage_C::Intro_0' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Intro) == 0x000338, "Member 'UChallengeBundlePage_C::Intro' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, One4DaysQuestCB) == 0x000340, "Member 'UChallengeBundlePage_C::One4DaysQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, One4DaysQuestPanel) == 0x000348, "Member 'UChallengeBundlePage_C::One4DaysQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BacchusCloseOverlay) == 0x000350, "Member 'UChallengeBundlePage_C::BacchusCloseOverlay' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BaseQuestCB) == 0x000358, "Member 'UChallengeBundlePage_C::BaseQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BaseQuestPanel) == 0x000360, "Member 'UChallengeBundlePage_C::BaseQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BattlePassLocked) == 0x000368, "Member 'UChallengeBundlePage_C::BattlePassLocked' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BattlePassQuestCB) == 0x000370, "Member 'UChallengeBundlePage_C::BattlePassQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BattlePassQuestPanel) == 0x000378, "Member 'UChallengeBundlePage_C::BattlePassQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, BorderBackground) == 0x000380, "Member 'UChallengeBundlePage_C::BorderBackground' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, ChallengeProgressWidget) == 0x000388, "Member 'UChallengeBundlePage_C::ChallengeProgressWidget' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, ClaimRewardsButton) == 0x000390, "Member 'UChallengeBundlePage_C::ClaimRewardsButton' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, CrownGlow) == 0x000398, "Member 'UChallengeBundlePage_C::CrownGlow' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, FNBirthdayQuestCB) == 0x0003A0, "Member 'UChallengeBundlePage_C::FNBirthdayQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, FNBirthdayQuestPanel) == 0x0003A8, "Member 'UChallengeBundlePage_C::FNBirthdayQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, FortnitemaresQuestCB) == 0x0003B0, "Member 'UChallengeBundlePage_C::FortnitemaresQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, FortnitemaresStyleQuestPanel) == 0x0003B8, "Member 'UChallengeBundlePage_C::FortnitemaresStyleQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, HandGlow) == 0x0003C0, "Member 'UChallengeBundlePage_C::HandGlow' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, HeistQuestPannel) == 0x0003C8, "Member 'UChallengeBundlePage_C::HeistQuestPannel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, HiestQuestCB) == 0x0003D0, "Member 'UChallengeBundlePage_C::HiestQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, IconGlow) == 0x0003D8, "Member 'UChallengeBundlePage_C::IconGlow' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_8) == 0x0003E0, "Member 'UChallengeBundlePage_C::Image_8' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_14) == 0x0003E8, "Member 'UChallengeBundlePage_C::Image_14' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_20) == 0x0003F0, "Member 'UChallengeBundlePage_C::Image_20' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_24) == 0x0003F8, "Member 'UChallengeBundlePage_C::Image_24' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_29) == 0x000400, "Member 'UChallengeBundlePage_C::Image_29' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_31) == 0x000408, "Member 'UChallengeBundlePage_C::Image_31' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_32) == 0x000410, "Member 'UChallengeBundlePage_C::Image_32' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Image_33) == 0x000418, "Member 'UChallengeBundlePage_C::Image_33' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, ItemInfoHeaderWidget) == 0x000420, "Member 'UChallengeBundlePage_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, LockCheckSwitcher) == 0x000428, "Member 'UChallengeBundlePage_C::LockCheckSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, MainReward) == 0x000430, "Member 'UChallengeBundlePage_C::MainReward' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, MainViewItemInfoOverlay) == 0x000438, "Member 'UChallengeBundlePage_C::MainViewItemInfoOverlay' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, NeowizQuestCB) == 0x000440, "Member 'UChallengeBundlePage_C::NeowizQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, NeowizQuestPanel) == 0x000448, "Member 'UChallengeBundlePage_C::NeowizQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, PageNextButton) == 0x000450, "Member 'UChallengeBundlePage_C::PageNextButton' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, PagePreviousButton) == 0x000458, "Member 'UChallengeBundlePage_C::PagePreviousButton' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, PanelButton) == 0x000460, "Member 'UChallengeBundlePage_C::PanelButton' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, PCBIcon) == 0x000468, "Member 'UChallengeBundlePage_C::PCBIcon' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, QuestListTitle) == 0x000470, "Member 'UChallengeBundlePage_C::QuestListTitle' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, QuestScrollBox) == 0x000478, "Member 'UChallengeBundlePage_C::QuestScrollBox' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, RewardText) == 0x000480, "Member 'UChallengeBundlePage_C::RewardText' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, SafeZone_0) == 0x000488, "Member 'UChallengeBundlePage_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, SkullTrooperQuestCB) == 0x000490, "Member 'UChallengeBundlePage_C::SkullTrooperQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, SkullTrooperStyleQuestPanel) == 0x000498, "Member 'UChallengeBundlePage_C::SkullTrooperStyleQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, SpacingLine) == 0x0004A0, "Member 'UChallengeBundlePage_C::SpacingLine' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Status_Locked) == 0x0004A8, "Member 'UChallengeBundlePage_C::Status_Locked' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Status_ProgressVB) == 0x0004B0, "Member 'UChallengeBundlePage_C::Status_ProgressVB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, StatusSwitcher) == 0x0004B8, "Member 'UChallengeBundlePage_C::StatusSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, SwipePanel) == 0x0004C0, "Member 'UChallengeBundlePage_C::SwipePanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, Title) == 0x0004C8, "Member 'UChallengeBundlePage_C::Title' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TomatoHeadStyleQuestCB) == 0x0004D0, "Member 'UChallengeBundlePage_C::TomatoHeadStyleQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TomatoHeadStyleQuestPanel) == 0x0004D8, "Member 'UChallengeBundlePage_C::TomatoHeadStyleQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopBattlePassLocked) == 0x0004E0, "Member 'UChallengeBundlePage_C::TopBattlePassLocked' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopBattlePassQuestCB) == 0x0004E8, "Member 'UChallengeBundlePage_C::TopBattlePassQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopBattlePassQuestPanel) == 0x0004F0, "Member 'UChallengeBundlePage_C::TopBattlePassQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopEdge) == 0x0004F8, "Member 'UChallengeBundlePage_C::TopEdge' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopEdge1) == 0x000500, "Member 'UChallengeBundlePage_C::TopEdge1' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopEdge2) == 0x000508, "Member 'UChallengeBundlePage_C::TopEdge2' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TopEdge3) == 0x000510, "Member 'UChallengeBundlePage_C::TopEdge3' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, VBucksQuestCB) == 0x000518, "Member 'UChallengeBundlePage_C::VBucksQuestCB' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, VBucksQuestPanel) == 0x000520, "Member 'UChallengeBundlePage_C::VBucksQuestPanel' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, AthenaChallengesTab) == 0x000528, "Member 'UChallengeBundlePage_C::AthenaChallengesTab' has a wrong offset!");
static_assert(offsetof(UChallengeBundlePage_C, TimerTimespanSource) == 0x000530, "Member 'UChallengeBundlePage_C::TimerTimespanSource' has a wrong offset!");

}

