#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeSubgameButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChangeSubgameButton.ChangeSubgameButton_C
// 0x0028 (0x0260 - 0x0238)
class UChangeSubgameButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ChangeSubgame;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnClicked__DelegateSignature();
	void ExecuteUbergraph_ChangeSubgameButton(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Destruct();
	void BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void DialogResult_3A1F478D47C301F9F1E029927174E059(EFortDialogResult Result, class FName ResultName);
	void Change_Main_Menu_Music_State(bool Set_Lobby_Music_State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChangeSubgameButton_C">();
	}
	static class UChangeSubgameButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeSubgameButton_C>();
	}
};
static_assert(alignof(UChangeSubgameButton_C) == 0x000008, "Wrong alignment on UChangeSubgameButton_C");
static_assert(sizeof(UChangeSubgameButton_C) == 0x000260, "Wrong size on UChangeSubgameButton_C");
static_assert(offsetof(UChangeSubgameButton_C, UberGraphFrame) == 0x000238, "Member 'UChangeSubgameButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChangeSubgameButton_C, ChangeSubgame) == 0x000240, "Member 'UChangeSubgameButton_C::ChangeSubgame' has a wrong offset!");
static_assert(offsetof(UChangeSubgameButton_C, SizeBoxContainer) == 0x000248, "Member 'UChangeSubgameButton_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(UChangeSubgameButton_C, OnClicked) == 0x000250, "Member 'UChangeSubgameButton_C::OnClicked' has a wrong offset!");

}

