#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChatWidget.ChatWidget_C
// 0x0070 (0x03C8 - 0x0358)
class UChatWidget_C final : public UFortChatPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ConsoleChatShortcut;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DEPRECATED_CursorModeSwitcher;                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HudContentHBox;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseUserListAction;                               // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    OpenUserListAction;                                // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CurrentUserListAction;                             // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bEnteringChat;                                     // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnEnteredChat;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnEnteredChat__DelegateSignature(bool EnteredChat);
	void ExecuteUbergraph_ChatWidget(int32 EntryPoint);
	void HandleInputMethodChanged(bool bUsingGamepad);
	void OnDeactivated();
	void OnActivated();
	void BndEvt__FortChat_K2Node_ComponentBoundEvent_66_OnChatEnteredDelegate__DelegateSignature(bool Param_bEnteringChat);
	void BndEvt__FortChat_K2Node_ComponentBoundEvent_0_OnUserListChangedDelegate__DelegateSignature(bool bOpen);
	void Construct();
	void Destruct();
	void Set_Chat_Visibility(ESlateVisibility New_Visibility);
	void Set_Chat_Shortcut_Visibility(ESlateVisibility New_Visibility);
	void UpdateChatUserListIcon(bool Open);
	void HandeChatEnteredEvent(bool Param_bEnteringChat);
	void HandleShowChatWindow(EFortUIFeature Feature, EFortUIFeatureState FeatureState, EFortUIFeatureStateReason FeatureStateReason);
	void HandleCursorModeChanged(bool bEnabled, class FName ActionName, class UUserWidget* Widget);
	void BindDelegates();
	void InitializeChat();
	void HandleExitPressed(bool* Handled);
	void HandleLeftTabPressed(bool* Handled);
	void HandleRightTabPressed(bool* Handled);
	void HandleControllerSendMessagePressed(bool* Handled);
	void HandlePreShowConfirmationDialog(class UFortUIManagerWidget_NUI* Source, struct FFortDialogDescription_NUI& DialogDescription);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChatWidget_C">();
	}
	static class UChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWidget_C>();
	}
};
static_assert(alignof(UChatWidget_C) == 0x000008, "Wrong alignment on UChatWidget_C");
static_assert(sizeof(UChatWidget_C) == 0x0003C8, "Wrong size on UChatWidget_C");
static_assert(offsetof(UChatWidget_C, UberGraphFrame) == 0x000358, "Member 'UChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, ConsoleChatShortcut) == 0x000360, "Member 'UChatWidget_C::ConsoleChatShortcut' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, DEPRECATED_CursorModeSwitcher) == 0x000368, "Member 'UChatWidget_C::DEPRECATED_CursorModeSwitcher' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, HudContentHBox) == 0x000370, "Member 'UChatWidget_C::HudContentHBox' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, KeybindWidget) == 0x000378, "Member 'UChatWidget_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CloseUserListAction) == 0x000380, "Member 'UChatWidget_C::CloseUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, OpenUserListAction) == 0x000390, "Member 'UChatWidget_C::OpenUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, CurrentUserListAction) == 0x0003A0, "Member 'UChatWidget_C::CurrentUserListAction' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, bEnteringChat) == 0x0003B0, "Member 'UChatWidget_C::bEnteringChat' has a wrong offset!");
static_assert(offsetof(UChatWidget_C, OnEnteredChat) == 0x0003B8, "Member 'UChatWidget_C::OnEnteredChat' has a wrong offset!");

}

