#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckPlayerBanStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CheckPlayerBanStatus.CheckPlayerBanStatus_C
// 0x0058 (0x03E8 - 0x0390)
class ACheckPlayerBanStatus_C final : public AFortScriptedAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlayerBannedModal_C*                   BannedModal;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMcpBanInfo                            CurrBanInfo;                                       // 0x03A8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CheckPlayerBanStatus(int32 EntryPoint);
	void Execute(const struct FFortScriptedActionParams& Params_0);
	void UserConstructionScript();
	void ShowBan();
	void OnActionCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CheckPlayerBanStatus_C">();
	}
	static class ACheckPlayerBanStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACheckPlayerBanStatus_C>();
	}
};
static_assert(alignof(ACheckPlayerBanStatus_C) == 0x000008, "Wrong alignment on ACheckPlayerBanStatus_C");
static_assert(sizeof(ACheckPlayerBanStatus_C) == 0x0003E8, "Wrong size on ACheckPlayerBanStatus_C");
static_assert(offsetof(ACheckPlayerBanStatus_C, UberGraphFrame) == 0x000390, "Member 'ACheckPlayerBanStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACheckPlayerBanStatus_C, DefaultSceneRoot) == 0x000398, "Member 'ACheckPlayerBanStatus_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACheckPlayerBanStatus_C, BannedModal) == 0x0003A0, "Member 'ACheckPlayerBanStatus_C::BannedModal' has a wrong offset!");
static_assert(offsetof(ACheckPlayerBanStatus_C, CurrBanInfo) == 0x0003A8, "Member 'ACheckPlayerBanStatus_C::CurrBanInfo' has a wrong offset!");

}

