#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CMSImageSlideShow

#include "Basic.hpp"


namespace SDK::Params
{

// Function CMSImageSlideShow.CMSImageSlideShow_C.ExecuteUbergraph_CMSImageSlideShow
// 0x0048 (0x0048 - 0x0000)
struct CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCMSImage_C*                            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_CustomEvent_MediaUrls;                      // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow) == 0x000008, "Wrong alignment on CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow");
static_assert(sizeof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow) == 0x000048, "Wrong size on CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, EntryPoint) == 0x000000, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::EntryPoint' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, CallFunc_Create_ReturnValue) == 0x000010, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, K2Node_CustomEvent_MediaUrls) == 0x000018, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::K2Node_CustomEvent_MediaUrls' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, CallFunc_Array_Get_Item) == 0x000030, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'CMSImageSlideShow_C_ExecuteUbergraph_CMSImageSlideShow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CMSImageSlideShow.CMSImageSlideShow_C.SetMediaURLs
// 0x0010 (0x0010 - 0x0000)
struct CMSImageSlideShow_C_SetMediaURLs final
{
public:
	TArray<class FString>                         MediaURLs;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(CMSImageSlideShow_C_SetMediaURLs) == 0x000008, "Wrong alignment on CMSImageSlideShow_C_SetMediaURLs");
static_assert(sizeof(CMSImageSlideShow_C_SetMediaURLs) == 0x000010, "Wrong size on CMSImageSlideShow_C_SetMediaURLs");
static_assert(offsetof(CMSImageSlideShow_C_SetMediaURLs, MediaURLs) == 0x000000, "Member 'CMSImageSlideShow_C_SetMediaURLs::MediaURLs' has a wrong offset!");

}

