#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeIslandDescriptionPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.ExecuteUbergraph_CreativeIslandDescriptionPanel
// 0x00E8 (0x00E8 - 0x0000)
struct CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Error;                                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0018)()
	bool                                          K2Node_Event_bSuccess;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select1_Default;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel) == 0x0000E8, "Wrong size on CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, EntryPoint) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, Temp_bool_Variable) == 0x000004, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, Temp_byte_Variable) == 0x000018, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, Temp_byte_Variable1) == 0x000019, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, Temp_bool_Variable1) == 0x00001A, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, Temp_int_Variable) == 0x00001C, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, Temp_int_Variable1) == 0x000020, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_ComponentBoundEvent_Button4) == 0x000028, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_ComponentBoundEvent_Button3) == 0x000030, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_ComponentBoundEvent_Button2) == 0x000040, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_Event_bShow) == 0x000048, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_Event_Error) == 0x000050, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_Event_Error' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_Select_Default) == 0x000060, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_Event_bSuccess) == 0x000080, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_Event_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_IsVisible_ReturnValue) == 0x0000C0, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_ComponentBoundEvent_Button1) == 0x0000C8, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_ComponentBoundEvent_Button) == 0x0000D0, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, CallFunc_GetRuntimeOptions_ReturnValue) == 0x0000D8, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel, K2Node_Select1_Default) == 0x0000E0, "Member 'CreativeIslandDescriptionPanel_C_ExecuteUbergraph_CreativeIslandDescriptionPanel::K2Node_Select1_Default' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_BndEvt__UserActionMenuInputButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.OnSaveCallBack
// 0x0001 (0x0001 - 0x0000)
struct CreativeIslandDescriptionPanel_C_OnSaveCallBack final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_OnSaveCallBack) == 0x000001, "Wrong alignment on CreativeIslandDescriptionPanel_C_OnSaveCallBack");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_OnSaveCallBack) == 0x000001, "Wrong size on CreativeIslandDescriptionPanel_C_OnSaveCallBack");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_OnSaveCallBack, bSuccess) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_OnSaveCallBack::bSuccess' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.ShowError
// 0x0010 (0x0010 - 0x0000)
struct CreativeIslandDescriptionPanel_C_ShowError final
{
public:
	class FString                                 Param_Error;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_ShowError) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_ShowError");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_ShowError) == 0x000010, "Wrong size on CreativeIslandDescriptionPanel_C_ShowError");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ShowError, Param_Error) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_ShowError::Param_Error' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.ShowSpinner
// 0x0001 (0x0001 - 0x0000)
struct CreativeIslandDescriptionPanel_C_ShowSpinner final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_ShowSpinner) == 0x000001, "Wrong alignment on CreativeIslandDescriptionPanel_C_ShowSpinner");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_ShowSpinner) == 0x000001, "Wrong size on CreativeIslandDescriptionPanel_C_ShowSpinner");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ShowSpinner, bShow) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_ShowSpinner::bShow' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_C_3_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct CreativeIslandDescriptionPanel_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_OnFocusReceived) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_OnFocusReceived");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_OnFocusReceived) == 0x0001B8, "Wrong size on CreativeIslandDescriptionPanel_C_OnFocusReceived");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CreativeIslandDescriptionPanel_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CreativeIslandDescriptionPanel_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_OnFocusReceived, CallFunc_GetUINavigationManager_ReturnValue) == 0x0000F8, "Member 'CreativeIslandDescriptionPanel_C_OnFocusReceived::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'CreativeIslandDescriptionPanel_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.DoCustomNavigation_0
// 0x0048 (0x0048 - 0x0000)
struct CreativeIslandDescriptionPanel_C_DoCustomNavigation_0 final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable1;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_DoCustomNavigation_0");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0) == 0x000048, "Wrong size on CreativeIslandDescriptionPanel_C_DoCustomNavigation_0");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Param_Navigation) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Param_Navigation' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, ReturnValue) == 0x000008, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Temp_byte_Variable) == 0x000010, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Temp_object_Variable) == 0x000018, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Temp_object_Variable1) == 0x000020, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Temp_object_Variable2) == 0x000028, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Temp_object_Variable3) == 0x000030, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, Temp_object_Variable4) == 0x000038, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_DoCustomNavigation_0, K2Node_Select_Default) == 0x000040, "Member 'CreativeIslandDescriptionPanel_C_DoCustomNavigation_0::K2Node_Select_Default' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.AddDescriptionBox
// 0x0002 (0x0002 - 0x0000)
struct CreativeIslandDescriptionPanel_C_AddDescriptionBox final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue1;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_AddDescriptionBox) == 0x000001, "Wrong alignment on CreativeIslandDescriptionPanel_C_AddDescriptionBox");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_AddDescriptionBox) == 0x000002, "Wrong size on CreativeIslandDescriptionPanel_C_AddDescriptionBox");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_AddDescriptionBox, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_AddDescriptionBox::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_AddDescriptionBox, CallFunc_IsVisible_ReturnValue1) == 0x000001, "Member 'CreativeIslandDescriptionPanel_C_AddDescriptionBox::CallFunc_IsVisible_ReturnValue1' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.ToggleAddBulletDisplays
// 0x0009 (0x0009 - 0x0000)
struct CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays) == 0x000001, "Wrong alignment on CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays) == 0x000009, "Wrong size on CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, bUsingGamepad) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::bUsingGamepad' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, Temp_bool_Variable) == 0x000001, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, Temp_byte_Variable) == 0x000002, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, Temp_byte_Variable1) == 0x000003, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, Temp_bool_Variable1) == 0x000004, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, K2Node_Select_Default) == 0x000005, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, Temp_byte_Variable2) == 0x000006, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, Temp_byte_Variable3) == 0x000007, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays, K2Node_Select1_Default) == 0x000008, "Member 'CreativeIslandDescriptionPanel_C_ToggleAddBulletDisplays::K2Node_Select1_Default' has a wrong offset!");

// Function CreativeIslandDescriptionPanel.CreativeIslandDescriptionPanel_C.HandleInputModeChange
// 0x0010 (0x0010 - 0x0000)
struct CreativeIslandDescriptionPanel_C_HandleInputModeChange final
{
public:
	bool                                          UsingGamepad;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ActiveMenu;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeIslandDescriptionPanel_C_HandleInputModeChange) == 0x000008, "Wrong alignment on CreativeIslandDescriptionPanel_C_HandleInputModeChange");
static_assert(sizeof(CreativeIslandDescriptionPanel_C_HandleInputModeChange) == 0x000010, "Wrong size on CreativeIslandDescriptionPanel_C_HandleInputModeChange");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_HandleInputModeChange, UsingGamepad) == 0x000000, "Member 'CreativeIslandDescriptionPanel_C_HandleInputModeChange::UsingGamepad' has a wrong offset!");
static_assert(offsetof(CreativeIslandDescriptionPanel_C_HandleInputModeChange, ActiveMenu) == 0x000001, "Member 'CreativeIslandDescriptionPanel_C_HandleInputModeChange::ActiveMenu' has a wrong offset!");
