#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMinigameGameKnobsModal

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.ExecuteUbergraph_CreativeMinigameGameKnobsModal
// 0x0128 (0x0128 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortMinigameState MinigameState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue1;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMinigameSettingsMachine_C*             K2Node_DynamicCast_AsMinigame_Settings_Machine;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMatchmakingSpinnerButton_C*      K2Node_DynamicCast_AsAthena_Matchmaking_Spinner_Button; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMinigameState                            K2Node_CustomEvent_MinigameState;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMinigameSettingsMachine_C*             K2Node_DynamicCast_AsMinigame_Settings_Machine1;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortMinigame*                          CallFunc_GetCurrentMinigame_Minigame;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_Array_Get_Item1;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume1; // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume2; // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal) == 0x000128, "Wrong size on CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, EntryPoint) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, Temp_byte_Variable) == 0x000004, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_Event_bUsingGamepad) == 0x000040, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000041, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_PlayAnimation_ReturnValue1) == 0x000048, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_ComponentBoundEvent_Button1) == 0x000050, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, Temp_byte_Variable1) == 0x000058, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, Temp_bool_Variable) == 0x000059, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000068, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetContext_ReturnValue1) == 0x000070, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_IsMobileGame_ReturnValue) == 0x000078, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_AsMinigame_Settings_Machine) == 0x000080, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_AsMinigame_Settings_Machine' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_Select_Default) == 0x000089, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_IsValid_ReturnValue) == 0x00008A, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000090, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_AsAthena_Matchmaking_Spinner_Button) == 0x0000B8, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_AsAthena_Matchmaking_Spinner_Button' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_bSuccess1) == 0x0000C0, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_CustomEvent_MinigameState) == 0x0000C1, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_CustomEvent_MinigameState' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_AsMinigame_Settings_Machine1) == 0x0000C8, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_AsMinigame_Settings_Machine1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_bSuccess2) == 0x0000D0, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x0000D8, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetCurrentMinigame_Minigame) == 0x0000E8, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetCurrentMinigame_Minigame' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Array_Get_Item1) == 0x0000F0, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_IsValid_ReturnValue1) == 0x0000F8, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000100, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, K2Node_DynamicCast_bSuccess3) == 0x000108, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetContext_ReturnValue2) == 0x000110, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume) == 0x000118, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume1) == 0x000119, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume1' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume2) == 0x00011A, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume2' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_Not_PreBool_ReturnValue) == 0x00011B, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_BooleanAND_ReturnValue) == 0x00011C, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000120, "Member 'CreativeMinigameGameKnobsModal_C_ExecuteUbergraph_CreativeMinigameGameKnobsModal::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.OnMinigameStateChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged final
{
public:
	EFortMinigameState                            MinigameState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged) == 0x000001, "Wrong alignment on CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged) == 0x000001, "Wrong size on CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged, MinigameState) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_OnMinigameStateChanged::MinigameState' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_OnInputModeChanged) == 0x000001, "Wrong alignment on CreativeMinigameGameKnobsModal_C_OnInputModeChanged");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_OnInputModeChanged) == 0x000001, "Wrong size on CreativeMinigameGameKnobsModal_C_OnInputModeChanged");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.OnTouchStarted
// 0x0260 (0x0260 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0168(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderLocation_ReturnValue;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01A8(0x00B8)()
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_OnTouchStarted) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_OnTouchStarted");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_OnTouchStarted) == 0x000260, "Wrong size on CreativeMinigameGameKnobsModal_C_OnTouchStarted");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, MyGeometry) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::MyGeometry' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, InTouchEvent) == 0x000038, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::InTouchEvent' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, ReturnValue) == 0x0000A8, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000160, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, CallFunc_GetCachedGeometry_ReturnValue) == 0x000168, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, CallFunc_IsUnderLocation_ReturnValue) == 0x0001A0, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::CallFunc_IsUnderLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnTouchStarted, CallFunc_Handled_ReturnValue) == 0x0001A8, "Member 'CreativeMinigameGameKnobsModal_C_OnTouchStarted::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_OnFocusReceived) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_OnFocusReceived");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_OnFocusReceived) == 0x0001C0, "Wrong size on CreativeMinigameGameKnobsModal_C_OnFocusReceived");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CreativeMinigameGameKnobsModal_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CreativeMinigameGameKnobsModal_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'CreativeMinigameGameKnobsModal_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnFocusReceived, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume) == 0x000100, "Member 'CreativeMinigameGameKnobsModal_C_OnFocusReceived::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'CreativeMinigameGameKnobsModal_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.Player in Read Only Volume?
// 0x0020 (0x0020 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_ final
{
public:
	bool                                          bInReadOnlyVolume;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerInReadOnlyVolume_ReturnValue;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_) == 0x000020, "Wrong size on CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_, bInReadOnlyVolume) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_::bInReadOnlyVolume' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000010, "Member 'CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_, CallFunc_IsPlayerInReadOnlyVolume_ReturnValue) == 0x000019, "Member 'CreativeMinigameGameKnobsModal_C_Player_in_Read_Only_Volume_::CallFunc_IsPlayerInReadOnlyVolume_ReturnValue' has a wrong offset!");

// Function CreativeMinigameGameKnobsModal.CreativeMinigameGameKnobsModal_C.EndGame
// 0x0020 (0x0020 - 0x0000)
struct CreativeMinigameGameKnobsModal_C_EndGame final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeMinigameGameKnobsModal_C_EndGame) == 0x000008, "Wrong alignment on CreativeMinigameGameKnobsModal_C_EndGame");
static_assert(sizeof(CreativeMinigameGameKnobsModal_C_EndGame) == 0x000020, "Wrong size on CreativeMinigameGameKnobsModal_C_EndGame");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_EndGame, Minigame) == 0x000000, "Member 'CreativeMinigameGameKnobsModal_C_EndGame::Minigame' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_EndGame, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CreativeMinigameGameKnobsModal_C_EndGame::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMinigameGameKnobsModal_C_EndGame, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000010, "Member 'CreativeMinigameGameKnobsModal_C_EndGame::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
