#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeMyIslandModal

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.ExecuteUbergraph_CreativeMyIslandModal
// 0x0140 (0x0140 - 0x0000)
struct CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button7;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button6;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button5;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue1;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleClose_NewParam;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume1; // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume2; // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x00B0(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate1;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume3; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select2_Default;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                K2Node_Select3_Default;                            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UIconTextButton_C*>              K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal");
static_assert(sizeof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal) == 0x000140, "Wrong size on CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, EntryPoint) == 0x000000, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_bool_Variable) == 0x000004, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_bool_Variable1) == 0x000005, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_byte_Variable) == 0x000006, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_byte_Variable1) == 0x000007, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_int_Variable) == 0x000008, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button7) == 0x000018, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button7' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button6) == 0x000020, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button6' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button5) == 0x000028, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button4) == 0x000038, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Add_IntInt_ReturnValue1) == 0x000050, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button3) == 0x000058, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_Event_bUsingGamepad) == 0x000060, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_Select_Default) == 0x000061, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Array_Length_ReturnValue1) == 0x000068, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_Select1_Default) == 0x000074, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button2) == 0x000078, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_GetUINavigationManager_ReturnValue) == 0x000080, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_GetUINavigationManager_ReturnValue1) == 0x000088, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_GetUINavigationManager_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_HandleClose_NewParam) == 0x000090, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_HandleClose_NewParam' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_int_Variable1) == 0x000094, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume) == 0x000098, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume1) == 0x000099, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume2) == 0x00009A, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume2' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_MakeStruct_DataTableRowHandle) == 0x0000B0, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_CreateDelegate_OutputDelegate1) == 0x0000C0, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D0, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_CreateDelegate_OutputDelegate3) == 0x0000E0, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume3) == 0x0000F0, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::CallFunc_Player_in_Read_Only_Volume__bInReadOnlyVolume3' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, Temp_bool_Variable2) == 0x0000F1, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_Select2_Default) == 0x0000F4, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button1) == 0x0000F8, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_CreateDelegate_OutputDelegate4) == 0x000100, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_Select3_Default) == 0x000110, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_CreateDelegate_OutputDelegate5) == 0x000118, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_ComponentBoundEvent_Button) == 0x000128, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal, K2Node_MakeArray_Array) == 0x000130, "Member 'CreativeMyIslandModal_C_ExecuteUbergraph_CreativeMyIslandModal::K2Node_MakeArray_Array' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__Description_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__Permissions_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__UserActionMenuInputButton_0_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct CreativeMyIslandModal_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeMyIslandModal_C_OnInputModeChanged) == 0x000001, "Wrong alignment on CreativeMyIslandModal_C_OnInputModeChanged");
static_assert(sizeof(CreativeMyIslandModal_C_OnInputModeChanged) == 0x000001, "Wrong size on CreativeMyIslandModal_C_OnInputModeChanged");
static_assert(offsetof(CreativeMyIslandModal_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'CreativeMyIslandModal_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__IconTextButton_C_2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CreativeMyIslandModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.HandleClose
// 0x0010 (0x0010 - 0x0000)
struct CreativeMyIslandModal_C_HandleClose final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeMyIslandModal_C_HandleClose) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_HandleClose");
static_assert(sizeof(CreativeMyIslandModal_C_HandleClose) == 0x000010, "Wrong size on CreativeMyIslandModal_C_HandleClose");
static_assert(offsetof(CreativeMyIslandModal_C_HandleClose, NewParam) == 0x000000, "Member 'CreativeMyIslandModal_C_HandleClose::NewParam' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_HandleClose, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CreativeMyIslandModal_C_HandleClose::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.Player in Read Only Volume?
// 0x0020 (0x0020 - 0x0000)
struct CreativeMyIslandModal_C_Player_in_Read_Only_Volume_ final
{
public:
	bool                                          bInReadOnlyVolume;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerInReadOnlyVolume_ReturnValue;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_) == 0x000008, "Wrong alignment on CreativeMyIslandModal_C_Player_in_Read_Only_Volume_");
static_assert(sizeof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_) == 0x000020, "Wrong size on CreativeMyIslandModal_C_Player_in_Read_Only_Volume_");
static_assert(offsetof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_, bInReadOnlyVolume) == 0x000000, "Member 'CreativeMyIslandModal_C_Player_in_Read_Only_Volume_::bInReadOnlyVolume' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'CreativeMyIslandModal_C_Player_in_Read_Only_Volume_::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000010, "Member 'CreativeMyIslandModal_C_Player_in_Read_Only_Volume_::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CreativeMyIslandModal_C_Player_in_Read_Only_Volume_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_Player_in_Read_Only_Volume_, CallFunc_IsPlayerInReadOnlyVolume_ReturnValue) == 0x000019, "Member 'CreativeMyIslandModal_C_Player_in_Read_Only_Volume_::CallFunc_IsPlayerInReadOnlyVolume_ReturnValue' has a wrong offset!");

// Function CreativeMyIslandModal.CreativeMyIslandModal_C.PassInputModeToActivePanel
// 0x0002 (0x0002 - 0x0000)
struct CreativeMyIslandModal_C_PassInputModeToActivePanel final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeMyIslandModal_C_PassInputModeToActivePanel) == 0x000001, "Wrong alignment on CreativeMyIslandModal_C_PassInputModeToActivePanel");
static_assert(sizeof(CreativeMyIslandModal_C_PassInputModeToActivePanel) == 0x000002, "Wrong size on CreativeMyIslandModal_C_PassInputModeToActivePanel");
static_assert(offsetof(CreativeMyIslandModal_C_PassInputModeToActivePanel, bUsingGamepad) == 0x000000, "Member 'CreativeMyIslandModal_C_PassInputModeToActivePanel::bUsingGamepad' has a wrong offset!");
static_assert(offsetof(CreativeMyIslandModal_C_PassInputModeToActivePanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'CreativeMyIslandModal_C_PassInputModeToActivePanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

