#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CurrentReportStackingEntry

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function CurrentReportStackingEntry.CurrentReportStackingEntry_C.ExecuteUbergraph_CurrentReportStackingEntry
// 0x0028 (0x0028 - 0x0000)
struct CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerReportingStep                          K2Node_CustomEvent_DisplayedReportingStep;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_DisplayText;                    // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry) == 0x000008, "Wrong alignment on CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry");
static_assert(sizeof(CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry) == 0x000028, "Wrong size on CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry");
static_assert(offsetof(CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry, EntryPoint) == 0x000000, "Member 'CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry, K2Node_CustomEvent_DisplayedReportingStep) == 0x000004, "Member 'CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry::K2Node_CustomEvent_DisplayedReportingStep' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry, K2Node_CustomEvent_DisplayText) == 0x000008, "Member 'CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry::K2Node_CustomEvent_DisplayText' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'CurrentReportStackingEntry_C_ExecuteUbergraph_CurrentReportStackingEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function CurrentReportStackingEntry.CurrentReportStackingEntry_C.InitStackingEntryFields
// 0x0020 (0x0020 - 0x0000)
struct CurrentReportStackingEntry_C_InitStackingEntryFields final
{
public:
	EPlayerReportingStep                          DisplayedReportingStep;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayText;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CurrentReportStackingEntry_C_InitStackingEntryFields) == 0x000008, "Wrong alignment on CurrentReportStackingEntry_C_InitStackingEntryFields");
static_assert(sizeof(CurrentReportStackingEntry_C_InitStackingEntryFields) == 0x000020, "Wrong size on CurrentReportStackingEntry_C_InitStackingEntryFields");
static_assert(offsetof(CurrentReportStackingEntry_C_InitStackingEntryFields, DisplayedReportingStep) == 0x000000, "Member 'CurrentReportStackingEntry_C_InitStackingEntryFields::DisplayedReportingStep' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_InitStackingEntryFields, DisplayText) == 0x000008, "Member 'CurrentReportStackingEntry_C_InitStackingEntryFields::DisplayText' has a wrong offset!");

// Function CurrentReportStackingEntry.CurrentReportStackingEntry_C.SetDisplayTextFields
// 0x0068 (0x0068 - 0x0000)
struct CurrentReportStackingEntry_C_SetDisplayTextFields final
{
public:
	EPlayerReportingStep                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0020(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0038(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
};
static_assert(alignof(CurrentReportStackingEntry_C_SetDisplayTextFields) == 0x000008, "Wrong alignment on CurrentReportStackingEntry_C_SetDisplayTextFields");
static_assert(sizeof(CurrentReportStackingEntry_C_SetDisplayTextFields) == 0x000068, "Wrong size on CurrentReportStackingEntry_C_SetDisplayTextFields");
static_assert(offsetof(CurrentReportStackingEntry_C_SetDisplayTextFields, Temp_byte_Variable) == 0x000000, "Member 'CurrentReportStackingEntry_C_SetDisplayTextFields::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_SetDisplayTextFields, Temp_text_Variable) == 0x000008, "Member 'CurrentReportStackingEntry_C_SetDisplayTextFields::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_SetDisplayTextFields, CallFunc_TextToUpper_ReturnValue) == 0x000020, "Member 'CurrentReportStackingEntry_C_SetDisplayTextFields::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_SetDisplayTextFields, CallFunc_TextToUpper_ReturnValue1) == 0x000038, "Member 'CurrentReportStackingEntry_C_SetDisplayTextFields::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CurrentReportStackingEntry_C_SetDisplayTextFields, K2Node_Select_Default) == 0x000050, "Member 'CurrentReportStackingEntry_C_SetDisplayTextFields::K2Node_Select_Default' has a wrong offset!");

}

