#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Deimos_Fiend

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Deimos_Fiend.Deimos_Fiend_C.ExecuteUbergraph_Deimos_Fiend
// 0x05D0 (0x05D0 - 0x0000)
struct Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable4;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_StartPos;                             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_MidPos;                               // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_EndPos;                               // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_LowWall;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_MidWall;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_FullWall;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_WindowWall;                           // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_SpecialAttack;                        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Swoop1;                               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Soul_Suck;                            // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Portal1;                              // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Swoop;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_SoulSuckMelee;                        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Portal;                               // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BuildingPart;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBTTask_BlueprintBase*                  K2Node_Event_Task;                                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_DesiredMoveLocation;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Debug;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Portal_Available_;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_SuccessfulHit;                        // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Success;                              // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABuildingActor*                         K2Node_Event_BuildingActor1;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingActor*>                 K2Node_Event_BuildingActorList1;                   // 0x00A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class ABuildingActor*                         K2Node_Event_BuildingActor;                        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingActor*>                 K2Node_Event_BuildingActorList;                    // 0x00C0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_BT;                                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collide_;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType1;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters1;               // 0x00E0(0x00B8)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_GetHitResult_ReturnValue;                 // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_GetHitResult_ReturnValue1;                // 0x0220(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              CallFunc_GetFortPhysicalSurface_ReturnValue;       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x1];                                      // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CallFunc_GetImpactPhysicalSurfaceSound_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x03C0(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystem*                        Temp_object_Variable5;                             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x041C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue1;        // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate1;             // 0x04B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x04C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x04D0(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable6;                             // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x05A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable7;                             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend) == 0x000010, "Wrong alignment on Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend");
static_assert(sizeof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend) == 0x0005D0, "Wrong size on Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, EntryPoint) == 0x000000, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::EntryPoint' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable) == 0x000008, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable1) == 0x000010, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable2) == 0x000018, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable3) == 0x000020, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_HasAuthority_ReturnValue1) == 0x00003C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable4) == 0x000040, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_HasAuthority_ReturnValue2) == 0x000048, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_StartPos) == 0x00004C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_StartPos' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_MidPos) == 0x000058, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_MidPos' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_EndPos) == 0x000064, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_EndPos' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_LowWall) == 0x000070, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_LowWall' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_MidWall) == 0x000071, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_MidWall' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_FullWall) == 0x000072, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_FullWall' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_WindowWall) == 0x000073, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_WindowWall' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_SpecialAttack) == 0x000074, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_SpecialAttack' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Swoop1) == 0x000075, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Swoop1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Soul_Suck) == 0x000076, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Soul_Suck' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Portal1) == 0x000077, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Portal1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Swoop) == 0x000078, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Swoop' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_SoulSuckMelee) == 0x000079, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_SoulSuckMelee' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Portal) == 0x00007A, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Portal' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_BuildingPart) == 0x000080, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_BuildingPart' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Task) == 0x000088, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Task' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_DesiredMoveLocation) == 0x000090, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_DesiredMoveLocation' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Debug) == 0x00009C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Debug' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Portal_Available_) == 0x00009D, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Portal_Available_' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_SuccessfulHit) == 0x00009E, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_SuccessfulHit' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Success) == 0x00009F, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Success' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_BuildingActor1) == 0x0000A0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_BuildingActor1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_BuildingActorList1) == 0x0000A8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_BuildingActorList1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_BuildingActor) == 0x0000B8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_BuildingActor' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_BuildingActorList) == 0x0000C0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_BuildingActorList' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_BT) == 0x0000D0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_BT' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Event_Collide_) == 0x0000D8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Event_Collide_' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_GameplayCueEvent_EventType1) == 0x0000D9, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_GameplayCueEvent_EventType1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_GameplayCueEvent_Parameters1) == 0x0000E0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_GameplayCueEvent_Parameters1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetHitResult_ReturnValue) == 0x000198, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetHitResult_ReturnValue1) == 0x000220, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetHitResult_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetFortPhysicalSurface_ReturnValue) == 0x0002A8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetFortPhysicalSurface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_bBlockingHit) == 0x0002A9, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002AA, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Time) == 0x0002AC, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Distance) == 0x0002B0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Location) == 0x0002B4, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_ImpactPoint) == 0x0002C0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Normal) == 0x0002CC, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_ImpactNormal) == 0x0002D8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_PhysMat) == 0x0002E8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitActor) == 0x0002F0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitComponent) == 0x0002F8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitBoneName) == 0x000300, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitItem) == 0x000308, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_FaceIndex) == 0x00030C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_TraceStart) == 0x000310, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_TraceEnd) == 0x00031C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetImpactPhysicalSurfaceSound_ReturnValue) == 0x000328, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetImpactPhysicalSurfaceSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_bBlockingHit1) == 0x000330, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_bBlockingHit1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_bInitialOverlap1) == 0x000331, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_bInitialOverlap1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Time1) == 0x000334, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Time1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Distance1) == 0x000338, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Distance1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Location1) == 0x00033C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Location1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_ImpactPoint1) == 0x000348, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_ImpactPoint1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_Normal1) == 0x000354, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_Normal1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_ImpactNormal1) == 0x000360, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_ImpactNormal1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_PhysMat1) == 0x000370, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_PhysMat1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitActor1) == 0x000378, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitActor1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitComponent1) == 0x000380, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitComponent1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitBoneName1) == 0x000388, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitBoneName1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_HitItem1) == 0x000390, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_HitItem1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_FaceIndex1) == 0x000394, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_FaceIndex1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_TraceStart1) == 0x000398, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_TraceStart1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakHitResult_TraceEnd1) == 0x0003A4, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakHitResult_TraceEnd1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_MakeRotFromX_ReturnValue) == 0x0003B0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetSocketTransform_ReturnValue) == 0x0003C0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable5) == 0x0003F0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakTransform_Location) == 0x0003F8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakTransform_Rotation) == 0x000404, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BreakTransform_Scale) == 0x000410, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00041C, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_DynamicCast_AsPrimitive_Component) == 0x000428, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_DynamicCast_bSuccess) == 0x000430, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_byte_Variable) == 0x000431, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_DamagedActor) == 0x000438, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_Damage) == 0x000440, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_InstigatedBy) == 0x000448, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_DamageCauser) == 0x000450, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_HitLocation) == 0x000458, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_FHitComponent) == 0x000468, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_BoneName) == 0x000470, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CustomEvent_Momentum) == 0x000478, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000488, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_DynamicCast_bSuccess1) == 0x000490, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetPlayerPawn_ReturnValue) == 0x000498, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0004A0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0004A8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetGameTimeInSeconds_ReturnValue1) == 0x0004AC, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetGameTimeInSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_CreateDelegate_OutputDelegate1) == 0x0004B0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0004C0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_GameplayCueEvent_EventType) == 0x0004C8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_GameplayCueEvent_Parameters) == 0x0004D0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_SwitchEnum_CmpSuccess) == 0x000588, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable6) == 0x000590, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_GetValue_ReturnValue) == 0x000598, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0005A0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, Temp_object_Variable7) == 0x0005A8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, K2Node_Select_Default) == 0x0005B0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0005B8, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x0005C0, "Member 'Deimos_Fiend_C_ExecuteUbergraph_Deimos_Fiend::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.GameplayCue.Athena.IceDeimos
// 0x00C0 (0x00C0 - 0x0000)
struct Deimos_Fiend_C_GameplayCue_Athena_IceDeimos final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Deimos_Fiend_C_GameplayCue_Athena_IceDeimos) == 0x000008, "Wrong alignment on Deimos_Fiend_C_GameplayCue_Athena_IceDeimos");
static_assert(sizeof(Deimos_Fiend_C_GameplayCue_Athena_IceDeimos) == 0x0000C0, "Wrong size on Deimos_Fiend_C_GameplayCue_Athena_IceDeimos");
static_assert(offsetof(Deimos_Fiend_C_GameplayCue_Athena_IceDeimos, EventType) == 0x000000, "Member 'Deimos_Fiend_C_GameplayCue_Athena_IceDeimos::EventType' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_GameplayCue_Athena_IceDeimos, Parameters) == 0x000008, "Member 'Deimos_Fiend_C_GameplayCue_Athena_IceDeimos::Parameters' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.CustomOnDied
// 0x0050 (0x0050 - 0x0000)
struct Deimos_Fiend_C_CustomOnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deimos_Fiend_C_CustomOnDied) == 0x000008, "Wrong alignment on Deimos_Fiend_C_CustomOnDied");
static_assert(sizeof(Deimos_Fiend_C_CustomOnDied) == 0x000050, "Wrong size on Deimos_Fiend_C_CustomOnDied");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, DamagedActor) == 0x000000, "Member 'Deimos_Fiend_C_CustomOnDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, Damage) == 0x000008, "Member 'Deimos_Fiend_C_CustomOnDied::Damage' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, InstigatedBy) == 0x000010, "Member 'Deimos_Fiend_C_CustomOnDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, DamageCauser) == 0x000018, "Member 'Deimos_Fiend_C_CustomOnDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, HitLocation) == 0x000020, "Member 'Deimos_Fiend_C_CustomOnDied::HitLocation' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, FHitComponent) == 0x000030, "Member 'Deimos_Fiend_C_CustomOnDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, BoneName) == 0x000038, "Member 'Deimos_Fiend_C_CustomOnDied::BoneName' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_CustomOnDied, Momentum) == 0x000040, "Member 'Deimos_Fiend_C_CustomOnDied::Momentum' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.GameplayCue.Impact.Physical.Creature
// 0x00C0 (0x00C0 - 0x0000)
struct Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature) == 0x000008, "Wrong alignment on Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature");
static_assert(sizeof(Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature) == 0x0000C0, "Wrong size on Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature");
static_assert(offsetof(Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature, EventType) == 0x000000, "Member 'Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature::EventType' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature, Parameters) == 0x000008, "Member 'Deimos_Fiend_C_GameplayCue_Impact_Physical_Creature::Parameters' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.PortalCollision
// 0x0001 (0x0001 - 0x0000)
struct Deimos_Fiend_C_PortalCollision final
{
public:
	bool                                          Collide_;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Deimos_Fiend_C_PortalCollision) == 0x000001, "Wrong alignment on Deimos_Fiend_C_PortalCollision");
static_assert(sizeof(Deimos_Fiend_C_PortalCollision) == 0x000001, "Wrong size on Deimos_Fiend_C_PortalCollision");
static_assert(offsetof(Deimos_Fiend_C_PortalCollision, Collide_) == 0x000000, "Member 'Deimos_Fiend_C_PortalCollision::Collide_' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.PortalGet
// 0x0020 (0x0020 - 0x0000)
struct Deimos_Fiend_C_PortalGet final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingActor*>                 BuildingActorList;                                 // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 BT;                                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deimos_Fiend_C_PortalGet) == 0x000008, "Wrong alignment on Deimos_Fiend_C_PortalGet");
static_assert(sizeof(Deimos_Fiend_C_PortalGet) == 0x000020, "Wrong size on Deimos_Fiend_C_PortalGet");
static_assert(offsetof(Deimos_Fiend_C_PortalGet, BuildingActor) == 0x000000, "Member 'Deimos_Fiend_C_PortalGet::BuildingActor' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_PortalGet, BuildingActorList) == 0x000008, "Member 'Deimos_Fiend_C_PortalGet::BuildingActorList' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_PortalGet, BT) == 0x000018, "Member 'Deimos_Fiend_C_PortalGet::BT' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.PortalAdd
// 0x0018 (0x0018 - 0x0000)
struct Deimos_Fiend_C_PortalAdd final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingActor*>                 BuildingActorList;                                 // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(Deimos_Fiend_C_PortalAdd) == 0x000008, "Wrong alignment on Deimos_Fiend_C_PortalAdd");
static_assert(sizeof(Deimos_Fiend_C_PortalAdd) == 0x000018, "Wrong size on Deimos_Fiend_C_PortalAdd");
static_assert(offsetof(Deimos_Fiend_C_PortalAdd, BuildingActor) == 0x000000, "Member 'Deimos_Fiend_C_PortalAdd::BuildingActor' has a wrong offset!");
static_assert(offsetof(Deimos_Fiend_C_PortalAdd, BuildingActorList) == 0x000008, "Member 'Deimos_Fiend_C_PortalAdd::BuildingActorList' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.TakerSoulSuckSoundBegin
// 0x0001 (0x0001 - 0x0000)
struct Deimos_Fiend_C_TakerSoulSuckSoundBegin final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Deimos_Fiend_C_TakerSoulSuckSoundBegin) == 0x000001, "Wrong alignment on Deimos_Fiend_C_TakerSoulSuckSoundBegin");
static_assert(sizeof(Deimos_Fiend_C_TakerSoulSuckSoundBegin) == 0x000001, "Wrong size on Deimos_Fiend_C_TakerSoulSuckSoundBegin");
static_assert(offsetof(Deimos_Fiend_C_TakerSoulSuckSoundBegin, Success) == 0x000000, "Member 'Deimos_Fiend_C_TakerSoulSuckSoundBegin::Success' has a wrong offset!");

// Function Deimos_Fiend.Deimos_Fiend_C.TakerAttackFSM
// 0x0001 (0x0001 - 0x0000)
struct Deimos_Fiend_C_TakerAttackFSM final
{
public:
	bool                                          SuccessfulHit;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Deimos_Fiend_C_TakerAttackFSM) == 0x000001, "Wrong alignment on Deimos_Fiend_C_TakerAttackFSM");
