#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorEntry.ErrorEntry_C
// 0x00B8 (0x02F0 - 0x0238)
class UErrorEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      IconTextButton;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MESSAGE;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortErrorInfo                         ErrorInfo;                                         // 0x0250(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ErrorUrlBase;                                      // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   DebugMessage;                                      // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsDebugMode;                                      // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ErrorEntry(int32 EntryPoint);
	void Construct();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void GetButtonVisibility(ESlateVisibility* NewParam);
	void SetErrorInfo(const struct FFortErrorInfo& Param_ErrorInfo);
	void Center_on_Widget(bool* Did_Center);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorEntry_C">();
	}
	static class UErrorEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorEntry_C>();
	}
};
static_assert(alignof(UErrorEntry_C) == 0x000008, "Wrong alignment on UErrorEntry_C");
static_assert(sizeof(UErrorEntry_C) == 0x0002F0, "Wrong size on UErrorEntry_C");
static_assert(offsetof(UErrorEntry_C, UberGraphFrame) == 0x000238, "Member 'UErrorEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, IconTextButton) == 0x000240, "Member 'UErrorEntry_C::IconTextButton' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, MESSAGE) == 0x000248, "Member 'UErrorEntry_C::MESSAGE' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorInfo) == 0x000250, "Member 'UErrorEntry_C::ErrorInfo' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorUrlBase) == 0x0002C0, "Member 'UErrorEntry_C::ErrorUrlBase' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, DebugMessage) == 0x0002D0, "Member 'UErrorEntry_C::DebugMessage' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, bIsDebugMode) == 0x0002E8, "Member 'UErrorEntry_C::bIsDebugMode' has a wrong offset!");

}

