#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardEntry.EventLeaderboardEntry_C
// 0x0070 (0x0BA8 - 0x0B38)
class UEventLeaderboardEntry_C final : public UFortEventLeaderboardEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0B40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_IsPlayer;                             // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Zebra;                                // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_TeamLine1;                         // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_TeamLine2;                         // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_Rank;                         // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TeamSize;                     // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NationalAffiliation;                         // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBG;                                  // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Rank;                                         // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Score;                                        // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Team;                                         // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsZebra;                                           // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlayer;                                          // 0x0BA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_EventLeaderboardEntry(int32 EntryPoint);
	void OnTeammateDisplayNameAdded(const class UFortEventLeaderboardEntryData* LeaderboardEntryData);
	void EventColorize();
	void EventStyleEntry();
	void BP_OnDeselected();
	void BP_OnSelected();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void SetEntryDetails(class UFortEventLeaderboardEntryData* EntryData);
	void SetTeamDisplayNames(class UFortEventLeaderboardEntryData* Entry_Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardEntry_C">();
	}
	static class UEventLeaderboardEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardEntry_C>();
	}
};
static_assert(alignof(UEventLeaderboardEntry_C) == 0x000008, "Wrong alignment on UEventLeaderboardEntry_C");
static_assert(sizeof(UEventLeaderboardEntry_C) == 0x000BA8, "Wrong size on UEventLeaderboardEntry_C");
static_assert(offsetof(UEventLeaderboardEntry_C, UberGraphFrame) == 0x000B38, "Member 'UEventLeaderboardEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Selected) == 0x000B40, "Member 'UEventLeaderboardEntry_C::Selected' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonBorder_IsPlayer) == 0x000B48, "Member 'UEventLeaderboardEntry_C::CommonBorder_IsPlayer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonBorder_Zebra) == 0x000B50, "Member 'UEventLeaderboardEntry_C::CommonBorder_Zebra' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonTextBlock_TeamLine1) == 0x000B58, "Member 'UEventLeaderboardEntry_C::CommonTextBlock_TeamLine1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonTextBlock_TeamLine2) == 0x000B60, "Member 'UEventLeaderboardEntry_C::CommonTextBlock_TeamLine2' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonWidgetSwitcher_Rank) == 0x000B68, "Member 'UEventLeaderboardEntry_C::CommonWidgetSwitcher_Rank' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, CommonWidgetSwitcher_TeamSize) == 0x000B70, "Member 'UEventLeaderboardEntry_C::CommonWidgetSwitcher_TeamSize' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Image_NationalAffiliation) == 0x000B78, "Member 'UEventLeaderboardEntry_C::Image_NationalAffiliation' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Image_SelectedBG) == 0x000B80, "Member 'UEventLeaderboardEntry_C::Image_SelectedBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Text_Rank) == 0x000B88, "Member 'UEventLeaderboardEntry_C::Text_Rank' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Text_Score) == 0x000B90, "Member 'UEventLeaderboardEntry_C::Text_Score' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, Text_Team) == 0x000B98, "Member 'UEventLeaderboardEntry_C::Text_Team' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, IsZebra) == 0x000BA0, "Member 'UEventLeaderboardEntry_C::IsZebra' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntry_C, IsPlayer) == 0x000BA1, "Member 'UEventLeaderboardEntry_C::IsPlayer' has a wrong offset!");

}

