#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EventLeaderboardHeader.EventLeaderboardHeader_C.ExecuteUbergraph_EventLeaderboardHeader
// 0x0170 (0x0170 - 0x0000)
struct EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEventRounds_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEventWindowSessionNumber_ReturnValue;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0058(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetEventWindowRoundNumber_ReturnValue;    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00B0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0118(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0130(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0148(0x0028)()
};
static_assert(alignof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader) == 0x000008, "Wrong alignment on EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader");
static_assert(sizeof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader) == 0x000170, "Wrong size on EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, EntryPoint) == 0x000000, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, Temp_bool_Variable) == 0x000004, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_GetNumEventRounds_ReturnValue) == 0x000008, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_GetNumEventRounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_GetEventWindowSessionNumber_ReturnValue) == 0x00000C, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_GetEventWindowSessionNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeStruct_FormatArgumentData1) == 0x000058, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_GetEventWindowRoundNumber_ReturnValue) == 0x000098, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_GetEventWindowRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeArray_Array) == 0x0000A0, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeStruct_FormatArgumentData2) == 0x0000B0, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeArray_Array1) == 0x000108, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, CallFunc_Format_ReturnValue1) == 0x000118, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_Select_Default) == 0x000130, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader, K2Node_MakeStruct_SlateColor) == 0x000148, "Member 'EventLeaderboardHeader_C_ExecuteUbergraph_EventLeaderboardHeader::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

