#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventRewardGiftboxHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventRewardGiftboxHeader.EventRewardGiftboxHeader_C
// 0x0020 (0x05D8 - 0x05B8)
class UEventRewardGiftboxHeader_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UShowdownPin_C*                         ShowdownPin;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EventRewardGiftboxHeader(int32 EntryPoint);
	void RefreshDataBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventRewardGiftboxHeader_C">();
	}
	static class UEventRewardGiftboxHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventRewardGiftboxHeader_C>();
	}
};
static_assert(alignof(UEventRewardGiftboxHeader_C) == 0x000008, "Wrong alignment on UEventRewardGiftboxHeader_C");
static_assert(sizeof(UEventRewardGiftboxHeader_C) == 0x0005D8, "Wrong size on UEventRewardGiftboxHeader_C");
static_assert(offsetof(UEventRewardGiftboxHeader_C, UberGraphFrame) == 0x0005B8, "Member 'UEventRewardGiftboxHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventRewardGiftboxHeader_C, ShowdownPin) == 0x0005C0, "Member 'UEventRewardGiftboxHeader_C::ShowdownPin' has a wrong offset!");
static_assert(offsetof(UEventRewardGiftboxHeader_C, Text_Description) == 0x0005C8, "Member 'UEventRewardGiftboxHeader_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UEventRewardGiftboxHeader_C, Text_Header) == 0x0005D0, "Member 'UEventRewardGiftboxHeader_C::Text_Header' has a wrong offset!");

}

