#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventRewardTokenUnlockedEventInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EventRewardTokenUnlockedEventInfo.EventRewardTokenUnlockedEventInfo_C.ExecuteUbergraph_EventRewardTokenUnlockedEventInfo
// 0x01F0 (0x01F0 - 0x0000)
struct EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEventRounds_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEventWindowRoundNumber_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0098(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x00D8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0190(0x0018)()
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x01B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo) == 0x000008, "Wrong alignment on EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo");
static_assert(sizeof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo) == 0x0001F0, "Wrong size on EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, EntryPoint) == 0x000000, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, Temp_bool_Variable) == 0x000004, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, Temp_byte_Variable) == 0x000005, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, Temp_byte_Variable1) == 0x000006, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_GetNumEventRounds_ReturnValue) == 0x000008, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_GetNumEventRounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, Temp_bool_Variable1) == 0x00000C, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x00000D, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_GetEventWindowRoundNumber_ReturnValue) == 0x000010, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_GetEventWindowRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeStruct_FormatArgumentData1) == 0x000058, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeStruct_FormatArgumentData2) == 0x000098, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeStruct_FormatArgumentData3) == 0x0000D8, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeStruct_FormatArgumentData4) == 0x000118, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeArray_Array) == 0x000158, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_MakeArray_Array1) == 0x000168, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_Format_ReturnValue) == 0x000178, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_Format_ReturnValue1) == 0x000190, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_GetEventId_ReturnValue) == 0x0001A8, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_GetEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_Select_Default) == 0x0001B8, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, CallFunc_TextIsEmpty_ReturnValue) == 0x0001E8, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo, K2Node_Select1_Default) == 0x0001E9, "Member 'EventRewardTokenUnlockedEventInfo_C_ExecuteUbergraph_EventRewardTokenUnlockedEventInfo::K2Node_Select1_Default' has a wrong offset!");

}

