#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntryDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.ExecuteUbergraph_EventLeaderboardEntryDetails
// 0x0330 (0x0330 - 0x0000)
struct EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             K2Node_CustomEvent_TournamentDisplayInfo;          // 0x0018(0x0170)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0188(0x0028)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x01B8(0x0028)()
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0240(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0260(0x0050)(HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventLeaderboardDetails_Stat_C*        K2Node_DynamicCast_AsEvent_Leaderboard_Details_Stat; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3[0x5];                                      // 0x02D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue1;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails) == 0x000010, "Wrong alignment on EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails");
static_assert(sizeof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails) == 0x000330, "Wrong size on EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, EntryPoint) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_float_Variable) == 0x000004, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_bool_Variable) == 0x000008, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_int_Variable) == 0x00000C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_CustomEvent_TournamentDisplayInfo) == 0x000018, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_CustomEvent_TournamentDisplayInfo' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_SlateColor) == 0x000188, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001B0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_SlateColor1) == 0x0001B8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetSafeZonePadding_SafePadding) == 0x0001E0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetSafeZonePadding_SafePadding' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetSafeZonePadding_SafePaddingScale) == 0x0001F0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetSafeZonePadding_SafePaddingScale' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetSafeZonePadding_SpillOverPadding) == 0x000200, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetSafeZonePadding_SpillOverPadding' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_BreakVector2D_X) == 0x000210, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_BreakVector2D_Y) == 0x000214, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000218, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x00021C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000220, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000224, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_Select_Default) == 0x000228, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x00022C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_MakeVector2D_ReturnValue) == 0x000230, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000238, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_FontOutlineSettings) == 0x000240, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_SlateFontInfo) == 0x000260, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_float_Variable1) == 0x0002B0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_float_Variable2) == 0x0002B4, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetChildAt_ReturnValue) == 0x0002B8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetChildrenCount_ReturnValue) == 0x0002C0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_DynamicCast_AsEvent_Leaderboard_Details_Stat) == 0x0002C8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_DynamicCast_AsEvent_Leaderboard_Details_Stat' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_DynamicCast_bSuccess) == 0x0002D0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D1, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, Temp_bool_Variable1) == 0x0002D2, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x0002D8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetEndTime_ReturnValue) == 0x0002E0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0002E8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_PlayAnimationTimeRange_ReturnValue1) == 0x0002F0, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_PlayAnimationTimeRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_GetContext_ReturnValue) == 0x0002F8, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_IsUsingGamepad_ReturnValue) == 0x000300, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000304, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000308, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_Select1_Default) == 0x00030C, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000310, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, CallFunc_Subtract_FloatFloat_ReturnValue3) == 0x000314, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::CallFunc_Subtract_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails, K2Node_MakeStruct_Margin) == 0x000318, "Member 'EventLeaderboardEntryDetails_C_ExecuteUbergraph_EventLeaderboardEntryDetails::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.EventColorize
// 0x0170 (0x0170 - 0x0000)
struct EventLeaderboardEntryDetails_C_EventColorize final
{
public:
	struct FFortTournamentDisplayInfo             TournamentDisplayInfo;                             // 0x0000(0x0170)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_EventColorize) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_EventColorize");
static_assert(sizeof(EventLeaderboardEntryDetails_C_EventColorize) == 0x000170, "Wrong size on EventLeaderboardEntryDetails_C_EventColorize");
static_assert(offsetof(EventLeaderboardEntryDetails_C_EventColorize, TournamentDisplayInfo) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_EventColorize::TournamentDisplayInfo' has a wrong offset!");

// Function EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C.ShowDetails
// 0x0340 (0x0340 - 0x0000)
struct EventLeaderboardEntryDetails_C_ShowDetails final
{
public:
	class UFortEventLeaderboardEntryData*         EntryData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0078(0x0018)()
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue;    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue1;   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetTeamDisplayNameText_ReturnValue;       // 0x0128(0x0018)()
	int32                                         CallFunc_GetNumTeammates_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0148(0x0018)()
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalMatchesPlayed_ReturnValue;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalVictoryRoyales_ReturnValue;       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAveragePlacement_ReturnValue;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalEliminations_ReturnValue;         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAverageMatchScore_ReturnValue;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalMatchesPlayed_ReturnValue1;       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScore_ReturnValue;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue2;   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue5;             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScore_ReturnValue1;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue6;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x01B8(0x0018)()
	int32                                         CallFunc_GetTotalPointsForCategory_ReturnValue3;   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x01D8(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue7;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0220(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0238(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue1;            // 0x0258(0x0018)()
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0278(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue8;             // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x02D8(0x0018)()
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue1;                      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue9;             // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetScore_ReturnValue2;                    // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0320(0x0018)()
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventLeaderboardEntryDetails_C_ShowDetails) == 0x000008, "Wrong alignment on EventLeaderboardEntryDetails_C_ShowDetails");
static_assert(sizeof(EventLeaderboardEntryDetails_C_ShowDetails) == 0x000340, "Wrong size on EventLeaderboardEntryDetails_C_ShowDetails");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ShowDetails, EntryData) == 0x000000, "Member 'EventLeaderboardEntryDetails_C_ShowDetails::EntryData' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ShowDetails, Temp_bool_Variable) == 0x000008, "Member 'EventLeaderboardEntryDetails_C_ShowDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventLeaderboardEntryDetails_C_ShowDetails, Temp_byte_Variable) == 0x000009, "Member 'EventLeaderboardEntryDetails_C_ShowDetails::Temp_byte_Variable' has a wrong offset!");
