#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventRewardToken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventRewardToken.EventRewardToken_C
// 0x0028 (0x05E0 - 0x05B8)
class UEventRewardToken_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventRewardTokenUnlockedEventInfo_C*   EventRewardTokenUnlockedEventInfo;                 // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownPin_C*                         ShowdownPin;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EventRewardToken(int32 EntryPoint);
	void RefreshDataBP();
	void SetEventTokenRewarded(const class FString& EventToken);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventRewardToken_C">();
	}
	static class UEventRewardToken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventRewardToken_C>();
	}
};
static_assert(alignof(UEventRewardToken_C) == 0x000008, "Wrong alignment on UEventRewardToken_C");
static_assert(sizeof(UEventRewardToken_C) == 0x0005E0, "Wrong size on UEventRewardToken_C");
static_assert(offsetof(UEventRewardToken_C, UberGraphFrame) == 0x0005B8, "Member 'UEventRewardToken_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventRewardToken_C, EventRewardTokenUnlockedEventInfo) == 0x0005C0, "Member 'UEventRewardToken_C::EventRewardTokenUnlockedEventInfo' has a wrong offset!");
static_assert(offsetof(UEventRewardToken_C, ShowdownPin) == 0x0005C8, "Member 'UEventRewardToken_C::ShowdownPin' has a wrong offset!");
static_assert(offsetof(UEventRewardToken_C, Text_Description) == 0x0005D0, "Member 'UEventRewardToken_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UEventRewardToken_C, Text_Header) == 0x0005D8, "Member 'UEventRewardToken_C::Text_Header' has a wrong offset!");

}

