#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventRewardGiftboxHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EventRewardGiftboxHeader.EventRewardGiftboxHeader_C.ExecuteUbergraph_EventRewardGiftboxHeader
// 0x02B0 (0x02B0 - 0x0000)
struct EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumEventRounds_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0050(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable;                                // 0x00C0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00F0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0130(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0170(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x01B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x01F0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetEventWindowRoundNumber_ReturnValue;    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0208(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x0220(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0280(0x0018)()
	class FText                                   K2Node_Select1_Default;                            // 0x0298(0x0018)()
};
static_assert(alignof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader) == 0x000008, "Wrong alignment on EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader");
static_assert(sizeof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader) == 0x0002B0, "Wrong size on EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, EntryPoint) == 0x000000, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, Temp_bool_Variable) == 0x000004, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, Temp_bool_Variable1) == 0x000005, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_GetNumEventRounds_ReturnValue) == 0x000008, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_GetNumEventRounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData1) == 0x000050, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_TextIsEmpty_ReturnValue) == 0x000090, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeArray_Array) == 0x000098, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, Temp_text_Variable) == 0x0000C0, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_Select_Default) == 0x0000D8, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData2) == 0x0000F0, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData3) == 0x000130, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData4) == 0x000170, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData5) == 0x0001B0, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData5' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeArray_Array1) == 0x0001F0, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_GetEventWindowRoundNumber_ReturnValue) == 0x000200, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_GetEventWindowRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_Format_ReturnValue1) == 0x000208, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeStruct_FormatArgumentData6) == 0x000220, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeStruct_FormatArgumentData6' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_MakeArray_Array2) == 0x000260, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_GetEventId_ReturnValue) == 0x000270, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_GetEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, CallFunc_Format_ReturnValue2) == 0x000280, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader, K2Node_Select1_Default) == 0x000298, "Member 'EventRewardGiftboxHeader_C_ExecuteUbergraph_EventRewardGiftboxHeader::K2Node_Select1_Default' has a wrong offset!");

}

