#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardEntryDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardEntryDetails.EventLeaderboardEntryDetails_C
// 0x0108 (0x0340 - 0x0238)
class UEventLeaderboardEntryDetails_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ElimPointer;                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_PlacementPointer;                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PlayerNames;                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PlayerNamesTitle;                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Score;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Title;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_57;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_58;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_94;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsBG;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ElimIcon;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pie;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PieShadow;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlacementIcon;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayernameBG;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayernameBG_Shadow;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PointBreakdown;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TeamMembers;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AveragePlacement;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_AveragePointsPerMatch;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_MatchesPlayed;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_TotalEliminations;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardDetails_Stat_C*        Stat_VictoryRoyales;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EliminationPointInfo;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlacementPointInfo;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_StatContainer;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         LeaderboardEntryData;                              // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EventLeaderboardEntryDetails(int32 EntryPoint);
	void EventIntro();
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);
	void Construct();
	void ShowDetails(class UFortEventLeaderboardEntryData* EntryData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardEntryDetails_C">();
	}
	static class UEventLeaderboardEntryDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardEntryDetails_C>();
	}
};
static_assert(alignof(UEventLeaderboardEntryDetails_C) == 0x000008, "Wrong alignment on UEventLeaderboardEntryDetails_C");
static_assert(sizeof(UEventLeaderboardEntryDetails_C) == 0x000340, "Wrong size on UEventLeaderboardEntryDetails_C");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, UberGraphFrame) == 0x000238, "Member 'UEventLeaderboardEntryDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Intro) == 0x000240, "Member 'UEventLeaderboardEntryDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorder_ElimPointer) == 0x000248, "Member 'UEventLeaderboardEntryDetails_C::CommonBorder_ElimPointer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonBorder_PlacementPointer) == 0x000250, "Member 'UEventLeaderboardEntryDetails_C::CommonBorder_PlacementPointer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_1) == 0x000258, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_PlayerNames) == 0x000260, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_PlayerNames' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_PlayerNamesTitle) == 0x000268, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_PlayerNamesTitle' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Score) == 0x000270, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Score' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, CommonTextBlock_Title) == 0x000278, "Member 'UEventLeaderboardEntryDetails_C::CommonTextBlock_Title' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_31) == 0x000280, "Member 'UEventLeaderboardEntryDetails_C::Image_31' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_32) == 0x000288, "Member 'UEventLeaderboardEntryDetails_C::Image_32' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_57) == 0x000290, "Member 'UEventLeaderboardEntryDetails_C::Image_57' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_58) == 0x000298, "Member 'UEventLeaderboardEntryDetails_C::Image_58' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_93) == 0x0002A0, "Member 'UEventLeaderboardEntryDetails_C::Image_93' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_94) == 0x0002A8, "Member 'UEventLeaderboardEntryDetails_C::Image_94' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_DetailsBG) == 0x0002B0, "Member 'UEventLeaderboardEntryDetails_C::Image_DetailsBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_ElimIcon) == 0x0002B8, "Member 'UEventLeaderboardEntryDetails_C::Image_ElimIcon' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_Pie) == 0x0002C0, "Member 'UEventLeaderboardEntryDetails_C::Image_Pie' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PieShadow) == 0x0002C8, "Member 'UEventLeaderboardEntryDetails_C::Image_PieShadow' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlacementIcon) == 0x0002D0, "Member 'UEventLeaderboardEntryDetails_C::Image_PlacementIcon' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlayernameBG) == 0x0002D8, "Member 'UEventLeaderboardEntryDetails_C::Image_PlayernameBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Image_PlayernameBG_Shadow) == 0x0002E0, "Member 'UEventLeaderboardEntryDetails_C::Image_PlayernameBG_Shadow' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_PointBreakdown) == 0x0002E8, "Member 'UEventLeaderboardEntryDetails_C::Overlay_PointBreakdown' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Overlay_TeamMembers) == 0x0002F0, "Member 'UEventLeaderboardEntryDetails_C::Overlay_TeamMembers' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AveragePlacement) == 0x0002F8, "Member 'UEventLeaderboardEntryDetails_C::Stat_AveragePlacement' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_AveragePointsPerMatch) == 0x000300, "Member 'UEventLeaderboardEntryDetails_C::Stat_AveragePointsPerMatch' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_MatchesPlayed) == 0x000308, "Member 'UEventLeaderboardEntryDetails_C::Stat_MatchesPlayed' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_TotalEliminations) == 0x000310, "Member 'UEventLeaderboardEntryDetails_C::Stat_TotalEliminations' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Stat_VictoryRoyales) == 0x000318, "Member 'UEventLeaderboardEntryDetails_C::Stat_VictoryRoyales' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Text_EliminationPointInfo) == 0x000320, "Member 'UEventLeaderboardEntryDetails_C::Text_EliminationPointInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, Text_PlacementPointInfo) == 0x000328, "Member 'UEventLeaderboardEntryDetails_C::Text_PlacementPointInfo' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, VerticalBox_StatContainer) == 0x000330, "Member 'UEventLeaderboardEntryDetails_C::VerticalBox_StatContainer' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardEntryDetails_C, LeaderboardEntryData) == 0x000338, "Member 'UEventLeaderboardEntryDetails_C::LeaderboardEntryData' has a wrong offset!");

}

