#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardScreen.EventLeaderboardScreen_C
// 0x00D8 (0x0470 - 0x0398)
class UEventLeaderboardScreen_C final : public UFortEventLeaderboardScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventsSimpleButton_C*                  Button_Back;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  Button_Filter;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  Button_Position;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ContainerBG;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_OptionsBarBG;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_FliterOptions;                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Content_LeaderboardEntries;                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Content_LoadingEntries;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Content_NoLeaderboardEntries;                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEntryDetails_C*        EntryDetails;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardEventDetails_C*        EventLeaderboardEventDetails;                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardHeader_C*              EventLeaderboardHeaderDetails;                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardPlayerPerformance_C*   EventLeaderboardPlayerPerformance;                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_LeaderboardEntries;                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NoLeaderboardEntries;                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry1;                            // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry2;                            // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry3;                            // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortEventLeaderboardEntryData*         DebugLeaderboardEntry4;                            // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortEventLeaderboardEntryData*> DebugLeaderboardEntries;                           // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   EventCloseButton;                                  // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EventCloseButton__DelegateSignature();
	void ExecuteUbergraph_EventLeaderboardScreen(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__Button_Back2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void EventColorize(const struct FFortTournamentDisplayInfo& TournamentDisplayInfo);
	void EventIntro();
	void Init(const class FString& EventId);
	void OnLeaderboardEntrySelected(const class UFortEventLeaderboardEntryData* EntryData);
	void OnLeaderboardPageRequestComplete();
	void OnLeaderboardPageRequested();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardScreen_C">();
	}
	static class UEventLeaderboardScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardScreen_C>();
	}
};
static_assert(alignof(UEventLeaderboardScreen_C) == 0x000008, "Wrong alignment on UEventLeaderboardScreen_C");
static_assert(sizeof(UEventLeaderboardScreen_C) == 0x000470, "Wrong size on UEventLeaderboardScreen_C");
static_assert(offsetof(UEventLeaderboardScreen_C, UberGraphFrame) == 0x000398, "Member 'UEventLeaderboardScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Button_Back) == 0x0003A0, "Member 'UEventLeaderboardScreen_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Button_Filter) == 0x0003A8, "Member 'UEventLeaderboardScreen_C::Button_Filter' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Button_Position) == 0x0003B0, "Member 'UEventLeaderboardScreen_C::Button_Position' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, CommonBorder_ContainerBG) == 0x0003B8, "Member 'UEventLeaderboardScreen_C::CommonBorder_ContainerBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, CommonBorder_OptionsBarBG) == 0x0003C0, "Member 'UEventLeaderboardScreen_C::CommonBorder_OptionsBarBG' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, CommonWidgetSwitcher_FliterOptions) == 0x0003C8, "Member 'UEventLeaderboardScreen_C::CommonWidgetSwitcher_FliterOptions' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Content_LeaderboardEntries) == 0x0003D0, "Member 'UEventLeaderboardScreen_C::Content_LeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Content_LoadingEntries) == 0x0003D8, "Member 'UEventLeaderboardScreen_C::Content_LoadingEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Content_NoLeaderboardEntries) == 0x0003E0, "Member 'UEventLeaderboardScreen_C::Content_NoLeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EntryDetails) == 0x0003E8, "Member 'UEventLeaderboardScreen_C::EntryDetails' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventLeaderboardEventDetails) == 0x0003F0, "Member 'UEventLeaderboardScreen_C::EventLeaderboardEventDetails' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventLeaderboardHeaderDetails) == 0x0003F8, "Member 'UEventLeaderboardScreen_C::EventLeaderboardHeaderDetails' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventLeaderboardPlayerPerformance) == 0x000400, "Member 'UEventLeaderboardScreen_C::EventLeaderboardPlayerPerformance' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Image_0) == 0x000408, "Member 'UEventLeaderboardScreen_C::Image_0' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, ProgressSpinner) == 0x000410, "Member 'UEventLeaderboardScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, SafeZone_0) == 0x000418, "Member 'UEventLeaderboardScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Switcher_LeaderboardEntries) == 0x000420, "Member 'UEventLeaderboardScreen_C::Switcher_LeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, Text_NoLeaderboardEntries) == 0x000428, "Member 'UEventLeaderboardScreen_C::Text_NoLeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry1) == 0x000430, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry2) == 0x000438, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry2' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry3) == 0x000440, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry3' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntry4) == 0x000448, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntry4' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, DebugLeaderboardEntries) == 0x000450, "Member 'UEventLeaderboardScreen_C::DebugLeaderboardEntries' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardScreen_C, EventCloseButton) == 0x000460, "Member 'UEventLeaderboardScreen_C::EventCloseButton' has a wrong offset!");

}

