#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Weaponsmith_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function F_MED_Weaponsmith_AnimBP.F_MED_Weaponsmith_AnimBP_C.ExecuteUbergraph_F_MED_Weaponsmith_AnimBP
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP) == 0x000004, "Wrong alignment on F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP");
static_assert(sizeof(F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP) == 0x000010, "Wrong size on F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP");
static_assert(offsetof(F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x000004, "Member 'F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'F_MED_Weaponsmith_AnimBP_C_ExecuteUbergraph_F_MED_Weaponsmith_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function F_MED_Weaponsmith_AnimBP.F_MED_Weaponsmith_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Weaponsmith_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

