#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FBotTurretData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FBotTurretData.FBotTurretData
// 0x0018 (0x0018 - 0x0000)
struct FFBotTurretData final
{
public:
	float                                         WarmUpDelay_9_6FACCA8F4530C34411633FAFFF35A1A4;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurretDuration_10_2257C0C24D89990A9238208F263A33CF; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireRate_11_D5BDFA014872030AA519C3B5444A83FC;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Range_12_F40473CC41D35A3835FF898974AC60A8;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultRange_18_EA2877BB4C21877A1AE594937A7794F3;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bExplosionUpgrade_13_C3093790415EC37138291B8A8065AEC8; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFBotTurretData) == 0x000004, "Wrong alignment on FFBotTurretData");
static_assert(sizeof(FFBotTurretData) == 0x000018, "Wrong size on FFBotTurretData");
static_assert(offsetof(FFBotTurretData, WarmUpDelay_9_6FACCA8F4530C34411633FAFFF35A1A4) == 0x000000, "Member 'FFBotTurretData::WarmUpDelay_9_6FACCA8F4530C34411633FAFFF35A1A4' has a wrong offset!");
static_assert(offsetof(FFBotTurretData, TurretDuration_10_2257C0C24D89990A9238208F263A33CF) == 0x000004, "Member 'FFBotTurretData::TurretDuration_10_2257C0C24D89990A9238208F263A33CF' has a wrong offset!");
static_assert(offsetof(FFBotTurretData, FireRate_11_D5BDFA014872030AA519C3B5444A83FC) == 0x000008, "Member 'FFBotTurretData::FireRate_11_D5BDFA014872030AA519C3B5444A83FC' has a wrong offset!");
static_assert(offsetof(FFBotTurretData, Range_12_F40473CC41D35A3835FF898974AC60A8) == 0x00000C, "Member 'FFBotTurretData::Range_12_F40473CC41D35A3835FF898974AC60A8' has a wrong offset!");
static_assert(offsetof(FFBotTurretData, DefaultRange_18_EA2877BB4C21877A1AE594937A7794F3) == 0x000010, "Member 'FFBotTurretData::DefaultRange_18_EA2877BB4C21877A1AE594937A7794F3' has a wrong offset!");
static_assert(offsetof(FFBotTurretData, bExplosionUpgrade_13_C3093790415EC37138291B8A8065AEC8) == 0x000014, "Member 'FFBotTurretData::bExplosionUpgrade_13_C3093790415EC37138291B8A8065AEC8' has a wrong offset!");

}

