#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Feedback_RateExperience

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Feedback_RateExperience.Feedback_RateExperience_C
// 0x00D0 (0x0418 - 0x0348)
class UFeedback_RateExperience_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      OneStar;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      TwoStar;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ThreeStar;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      FourStar;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      FiveStar;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 BodyEditable;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_0;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_1;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EntryVBox;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      HiddenInitialStar;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      SendButton;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StarCount;                                         // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           TooltipHeaders;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FText>                           TooltipBodys;                                      // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UIconTextButton_C*                      LastClickedStar;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   FeedbackTitle;                                     // 0x03F0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UIconTextButton_C*>              StarButtons;                                       // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Feedback_RateExperience(int32 EntryPoint);
	void BndEvt__5Star_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__4Star_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__3Star_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__2Star_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__1Star_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__5Star_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__4Star_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__3Star_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__2Star_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__1Star_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void OnInputMethodChanged(bool bUsingGamepad);
	void OnStarButtonClicked(class UCommonButton* Button_Clicked);
	void OnClientPartyStateChanged(EFortPartyState PartyState);
	void OnActivated();
	void BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void SetStarCount(int32 Star_Count);
	void SetupStarButtons();
	void SendAnalyticsEvent(const class FString& FeedbackSentBy);
	void CloseWidget();
	void CreateToolTip(class UWidget* Star_Widget, int32 WidgetIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Feedback_RateExperience_C">();
	}
	static class UFeedback_RateExperience_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFeedback_RateExperience_C>();
	}
};
static_assert(alignof(UFeedback_RateExperience_C) == 0x000008, "Wrong alignment on UFeedback_RateExperience_C");
static_assert(sizeof(UFeedback_RateExperience_C) == 0x000418, "Wrong size on UFeedback_RateExperience_C");
static_assert(offsetof(UFeedback_RateExperience_C, UberGraphFrame) == 0x000348, "Member 'UFeedback_RateExperience_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, OneStar) == 0x000350, "Member 'UFeedback_RateExperience_C::OneStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, TwoStar) == 0x000358, "Member 'UFeedback_RateExperience_C::TwoStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, ThreeStar) == 0x000360, "Member 'UFeedback_RateExperience_C::ThreeStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, FourStar) == 0x000368, "Member 'UFeedback_RateExperience_C::FourStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, FiveStar) == 0x000370, "Member 'UFeedback_RateExperience_C::FiveStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, BodyEditable) == 0x000378, "Member 'UFeedback_RateExperience_C::BodyEditable' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, CancelButton) == 0x000380, "Member 'UFeedback_RateExperience_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, CommonActionWidget_0) == 0x000388, "Member 'UFeedback_RateExperience_C::CommonActionWidget_0' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, CommonActionWidget_1) == 0x000390, "Member 'UFeedback_RateExperience_C::CommonActionWidget_1' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, EntryVBox) == 0x000398, "Member 'UFeedback_RateExperience_C::EntryVBox' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, HiddenInitialStar) == 0x0003A0, "Member 'UFeedback_RateExperience_C::HiddenInitialStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, Lightbox) == 0x0003A8, "Member 'UFeedback_RateExperience_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, SendButton) == 0x0003B0, "Member 'UFeedback_RateExperience_C::SendButton' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, Title) == 0x0003B8, "Member 'UFeedback_RateExperience_C::Title' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, StarCount) == 0x0003C0, "Member 'UFeedback_RateExperience_C::StarCount' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, TooltipHeaders) == 0x0003C8, "Member 'UFeedback_RateExperience_C::TooltipHeaders' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, TooltipBodys) == 0x0003D8, "Member 'UFeedback_RateExperience_C::TooltipBodys' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, LastClickedStar) == 0x0003E8, "Member 'UFeedback_RateExperience_C::LastClickedStar' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, FeedbackTitle) == 0x0003F0, "Member 'UFeedback_RateExperience_C::FeedbackTitle' has a wrong offset!");
static_assert(offsetof(UFeedback_RateExperience_C, StarButtons) == 0x000408, "Member 'UFeedback_RateExperience_C::StarButtons' has a wrong offset!");

}

