#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FerretVehicle_Driver_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function FerretVehicle_Driver_AnimBP.FerretVehicle_Driver_AnimBP_C.ExecuteUbergraph_FerretVehicle_Driver_AnimBP
// 0x000C (0x000C - 0x0000)
struct FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP) == 0x000004, "Wrong alignment on FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP");
static_assert(sizeof(FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP) == 0x00000C, "Wrong size on FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP");
static_assert(offsetof(FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP, EntryPoint) == 0x000000, "Member 'FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000008, "Member 'FerretVehicle_Driver_AnimBP_C_ExecuteUbergraph_FerretVehicle_Driver_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");

}

