#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "Party_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "CommonUI_structs.hpp"
#include "SocialUMG_structs.hpp"


namespace SDK::Params
{

// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreCenterWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanel_RestoreCenterWidget) == 0x000008, "Wrong alignment on FortActivatablePanel_RestoreCenterWidget");
static_assert(sizeof(FortActivatablePanel_RestoreCenterWidget) == 0x000008, "Wrong size on FortActivatablePanel_RestoreCenterWidget");
static_assert(offsetof(FortActivatablePanel_RestoreCenterWidget, FallbackWidget) == 0x000000, "Member 'FortActivatablePanel_RestoreCenterWidget::FallbackWidget' has a wrong offset!");

// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreScrollWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortActivatablePanel_RestoreScrollWidget) == 0x000008, "Wrong alignment on FortActivatablePanel_RestoreScrollWidget");
static_assert(sizeof(FortActivatablePanel_RestoreScrollWidget) == 0x000008, "Wrong size on FortActivatablePanel_RestoreScrollWidget");
static_assert(offsetof(FortActivatablePanel_RestoreScrollWidget, FallbackWidget) == 0x000000, "Member 'FortActivatablePanel_RestoreScrollWidget::FallbackWidget' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnActiveLeaderboardTabChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged final
{
public:
	int32                                         ActiveWidgetIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged) == 0x000004, "Wrong alignment on AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged) == 0x000004, "Wrong size on AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged, ActiveWidgetIndex) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged::ActiveWidgetIndex' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnFriendsFilterChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardScreenBase_OnFriendsFilterChanged final
{
public:
	int32                                         FriendsFilterIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnFriendsFilterChanged) == 0x000004, "Wrong alignment on AthenaLeaderboardScreenBase_OnFriendsFilterChanged");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnFriendsFilterChanged) == 0x000004, "Wrong size on AthenaLeaderboardScreenBase_OnFriendsFilterChanged");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnFriendsFilterChanged, FriendsFilterIndex) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnFriendsFilterChanged::FriendsFilterIndex' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnMatchTypeChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardScreenBase_OnMatchTypeChanged final
{
public:
	int32                                         MatchTypeIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnMatchTypeChanged) == 0x000004, "Wrong alignment on AthenaLeaderboardScreenBase_OnMatchTypeChanged");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnMatchTypeChanged) == 0x000004, "Wrong size on AthenaLeaderboardScreenBase_OnMatchTypeChanged");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnMatchTypeChanged, MatchTypeIndex) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnMatchTypeChanged::MatchTypeIndex' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnPlaylistChanged
// 0x000C (0x000C - 0x0000)
struct AthenaLeaderboardScreenBase_OnPlaylistChanged final
{
public:
	class FName                                   NewPlaylistName;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonInputType                              NewInputType;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnPlaylistChanged) == 0x000004, "Wrong alignment on AthenaLeaderboardScreenBase_OnPlaylistChanged");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnPlaylistChanged) == 0x00000C, "Wrong size on AthenaLeaderboardScreenBase_OnPlaylistChanged");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnPlaylistChanged, NewPlaylistName) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnPlaylistChanged::NewPlaylistName' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnPlaylistChanged, NewInputType) == 0x000008, "Member 'AthenaLeaderboardScreenBase_OnPlaylistChanged::NewInputType' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateLeaderboardListUI
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardRowProxyInstance*       LocalUserRow;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   QueryErrorStr;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI) == 0x000008, "Wrong alignment on AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI) == 0x000028, "Wrong size on AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI, bWasSuccessful) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI, LocalUserRow) == 0x000008, "Member 'AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI::LocalUserRow' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI, QueryErrorStr) == 0x000010, "Member 'AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI::QueryErrorStr' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateListHeader
// 0x0050 (0x0050 - 0x0000)
struct AthenaLeaderboardScreenBase_OnUpdateListHeader final
{
public:
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnUpdateListHeader) == 0x000008, "Wrong alignment on AthenaLeaderboardScreenBase_OnUpdateListHeader");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnUpdateListHeader) == 0x000050, "Wrong size on AthenaLeaderboardScreenBase_OnUpdateListHeader");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnUpdateListHeader, PlaylistTabData) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnUpdateListHeader::PlaylistTabData' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateTabButtonText
// 0x0058 (0x0058 - 0x0000)
struct AthenaLeaderboardScreenBase_OnUpdateTabButtonText final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_OnUpdateTabButtonText) == 0x000008, "Wrong alignment on AthenaLeaderboardScreenBase_OnUpdateTabButtonText");
static_assert(sizeof(AthenaLeaderboardScreenBase_OnUpdateTabButtonText) == 0x000058, "Wrong size on AthenaLeaderboardScreenBase_OnUpdateTabButtonText");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnUpdateTabButtonText, Button) == 0x000000, "Member 'AthenaLeaderboardScreenBase_OnUpdateTabButtonText::Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardScreenBase_OnUpdateTabButtonText, PlaylistTabData) == 0x000008, "Member 'AthenaLeaderboardScreenBase_OnUpdateTabButtonText::PlaylistTabData' has a wrong offset!");

// Function FortniteUI.AthenaLeaderboardScreenBase.CanShowFriendsOnlyLeaderboard
// 0x0001 (0x0001 - 0x0000)
struct AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard) == 0x000001, "Wrong alignment on AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard");
static_assert(sizeof(AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard) == 0x000001, "Wrong size on AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard");
static_assert(offsetof(AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard, ReturnValue) == 0x000000, "Member 'AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUserWidget.AddGrantCheatMenu
// 0x0020 (0x0020 - 0x0000)
struct FortUserWidget_AddGrantCheatMenu final
{
public:
	class FString                                 TemplateId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceId;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUserWidget_AddGrantCheatMenu) == 0x000008, "Wrong alignment on FortUserWidget_AddGrantCheatMenu");
static_assert(sizeof(FortUserWidget_AddGrantCheatMenu) == 0x000020, "Wrong size on FortUserWidget_AddGrantCheatMenu");
static_assert(offsetof(FortUserWidget_AddGrantCheatMenu, TemplateId) == 0x000000, "Member 'FortUserWidget_AddGrantCheatMenu::TemplateId' has a wrong offset!");
static_assert(offsetof(FortUserWidget_AddGrantCheatMenu, InstanceId) == 0x000010, "Member 'FortUserWidget_AddGrantCheatMenu::InstanceId' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.MediaDimensionsUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_MediaDimensionsUpdated final
{
public:
	float                                         NewWidth;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewHeight;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovieWidget_MediaDimensionsUpdated) == 0x000004, "Wrong alignment on FortMovieWidget_MediaDimensionsUpdated");
static_assert(sizeof(FortMovieWidget_MediaDimensionsUpdated) == 0x000008, "Wrong size on FortMovieWidget_MediaDimensionsUpdated");
static_assert(offsetof(FortMovieWidget_MediaDimensionsUpdated, NewWidth) == 0x000000, "Member 'FortMovieWidget_MediaDimensionsUpdated::NewWidth' has a wrong offset!");
static_assert(offsetof(FortMovieWidget_MediaDimensionsUpdated, NewHeight) == 0x000004, "Member 'FortMovieWidget_MediaDimensionsUpdated::NewHeight' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.RequestPlayMovie
// 0x0001 (0x0001 - 0x0000)
struct FortMovieWidget_RequestPlayMovie final
{
public:
	bool                                          bShouldRewind;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovieWidget_RequestPlayMovie) == 0x000001, "Wrong alignment on FortMovieWidget_RequestPlayMovie");
static_assert(sizeof(FortMovieWidget_RequestPlayMovie) == 0x000001, "Wrong size on FortMovieWidget_RequestPlayMovie");
static_assert(offsetof(FortMovieWidget_RequestPlayMovie, bShouldRewind) == 0x000000, "Member 'FortMovieWidget_RequestPlayMovie::bShouldRewind' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.SetMediaSource
// 0x0040 (0x0040 - 0x0000)
struct FortMovieWidget_SetMediaSource final
{
public:
	class UMediaSource*                           InMediaSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMediaPlayerOptions                    PlayerOptions;                                     // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPlayOnOpen;                                       // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x003A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovieWidget_SetMediaSource) == 0x000008, "Wrong alignment on FortMovieWidget_SetMediaSource");
static_assert(sizeof(FortMovieWidget_SetMediaSource) == 0x000040, "Wrong size on FortMovieWidget_SetMediaSource");
static_assert(offsetof(FortMovieWidget_SetMediaSource, InMediaSource) == 0x000000, "Member 'FortMovieWidget_SetMediaSource::InMediaSource' has a wrong offset!");
static_assert(offsetof(FortMovieWidget_SetMediaSource, PlayerOptions) == 0x000008, "Member 'FortMovieWidget_SetMediaSource::PlayerOptions' has a wrong offset!");
static_assert(offsetof(FortMovieWidget_SetMediaSource, bPlayOnOpen) == 0x000038, "Member 'FortMovieWidget_SetMediaSource::bPlayOnOpen' has a wrong offset!");
static_assert(offsetof(FortMovieWidget_SetMediaSource, bLooping) == 0x000039, "Member 'FortMovieWidget_SetMediaSource::bLooping' has a wrong offset!");
static_assert(offsetof(FortMovieWidget_SetMediaSource, ReturnValue) == 0x00003A, "Member 'FortMovieWidget_SetMediaSource::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovieWidget_GetMediaPlayer) == 0x000008, "Wrong alignment on FortMovieWidget_GetMediaPlayer");
static_assert(sizeof(FortMovieWidget_GetMediaPlayer) == 0x000008, "Wrong size on FortMovieWidget_GetMediaPlayer");
static_assert(offsetof(FortMovieWidget_GetMediaPlayer, ReturnValue) == 0x000000, "Member 'FortMovieWidget_GetMediaPlayer::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.GetMediaSoundComponent
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_GetMediaSoundComponent final
{
public:
	class UMediaSoundComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovieWidget_GetMediaSoundComponent) == 0x000008, "Wrong alignment on FortMovieWidget_GetMediaSoundComponent");
static_assert(sizeof(FortMovieWidget_GetMediaSoundComponent) == 0x000008, "Wrong size on FortMovieWidget_GetMediaSoundComponent");
static_assert(offsetof(FortMovieWidget_GetMediaSoundComponent, ReturnValue) == 0x000000, "Member 'FortMovieWidget_GetMediaSoundComponent::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.GetMediaTexture
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_GetMediaTexture final
{
public:
	class UMediaTexture*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovieWidget_GetMediaTexture) == 0x000008, "Wrong alignment on FortMovieWidget_GetMediaTexture");
static_assert(sizeof(FortMovieWidget_GetMediaTexture) == 0x000008, "Wrong size on FortMovieWidget_GetMediaTexture");
static_assert(offsetof(FortMovieWidget_GetMediaTexture, ReturnValue) == 0x000000, "Member 'FortMovieWidget_GetMediaTexture::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortMovieWidget.HasPlayerForSource
// 0x0010 (0x0010 - 0x0000)
struct FortMovieWidget_HasPlayerForSource final
{
public:
	class UMediaSource*                           InMediaSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovieWidget_HasPlayerForSource) == 0x000008, "Wrong alignment on FortMovieWidget_HasPlayerForSource");
static_assert(sizeof(FortMovieWidget_HasPlayerForSource) == 0x000010, "Wrong size on FortMovieWidget_HasPlayerForSource");
static_assert(offsetof(FortMovieWidget_HasPlayerForSource, InMediaSource) == 0x000000, "Member 'FortMovieWidget_HasPlayerForSource::InMediaSource' has a wrong offset!");
static_assert(offsetof(FortMovieWidget_HasPlayerForSource, ReturnValue) == 0x000008, "Member 'FortMovieWidget_HasPlayerForSource::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetBattleBookPurchaseLimit final
{
public:
	int32                                         MaxNumLevelsPossibleToPurchase;                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetBattleBookPurchaseLimit) == 0x000004, "Wrong alignment on AthenaAccountContext_GetBattleBookPurchaseLimit");
static_assert(sizeof(AthenaAccountContext_GetBattleBookPurchaseLimit) == 0x000008, "Wrong size on AthenaAccountContext_GetBattleBookPurchaseLimit");
static_assert(offsetof(AthenaAccountContext_GetBattleBookPurchaseLimit, MaxNumLevelsPossibleToPurchase) == 0x000000, "Member 'AthenaAccountContext_GetBattleBookPurchaseLimit::MaxNumLevelsPossibleToPurchase' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_GetBattleBookPurchaseLimit, BonusLevelsGranted) == 0x000004, "Member 'AthenaAccountContext_GetBattleBookPurchaseLimit::BonusLevelsGranted' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonDefinition final
{
public:
	class UAthenaSeasonItemDefinition*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonDefinition) == 0x000008, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonDefinition");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonDefinition) == 0x000008, "Wrong size on AthenaAccountContext_GetCurrentSeasonDefinition");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonDefinition, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonDefinition::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
// 0x000C (0x000C - 0x0000)
struct AthenaAccountContext_SimulateBattleBookPurchase final
{
public:
	int32                                         NumLevelsToPurchase;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverLimit;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaAccountContext_SimulateBattleBookPurchase) == 0x000004, "Wrong alignment on AthenaAccountContext_SimulateBattleBookPurchase");
static_assert(sizeof(AthenaAccountContext_SimulateBattleBookPurchase) == 0x00000C, "Wrong size on AthenaAccountContext_SimulateBattleBookPurchase");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, NumLevelsToPurchase) == 0x000000, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::NumLevelsToPurchase' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, BonusLevelsGranted) == 0x000004, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::BonusLevelsGranted' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, bOverLimit) == 0x000008, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::bOverLimit' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonName) == 0x000008, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonName");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonName) == 0x000018, "Wrong size on AthenaAccountContext_GetCurrentSeasonName");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonName, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonName::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonNumber) == 0x000004, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonNumber");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonNumber) == 0x000004, "Wrong size on AthenaAccountContext_GetCurrentSeasonNumber");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonNumber, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonNumber::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_IsAtMaxBattlePassTier final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_IsAtMaxBattlePassTier) == 0x000001, "Wrong alignment on AthenaAccountContext_IsAtMaxBattlePassTier");
static_assert(sizeof(AthenaAccountContext_IsAtMaxBattlePassTier) == 0x000001, "Wrong size on AthenaAccountContext_IsAtMaxBattlePassTier");
static_assert(offsetof(AthenaAccountContext_IsAtMaxBattlePassTier, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_IsAtMaxBattlePassTier::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward) == 0x000001, "Wrong alignment on AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward");
static_assert(sizeof(AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward) == 0x000001, "Wrong size on AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward");
static_assert(offsetof(AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowConfirmationDialog_NUI
// 0x00F0 (0x00F0 - 0x0000)
struct FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Icon;                                              // 0x0008(0x0088)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x00A8(0x0018)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FConfirmationDialogAction>      ConfirmButtonInputActions;                         // 0x00C0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   DeclineButtonInputAction;                          // 0x00D0(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AdditionalContent;                                 // 0x00D8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                LeftAdditionalContent;                             // 0x00E0(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI*  ReturnValue;                                       // 0x00E8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI) == 0x000008, "Wrong alignment on FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI");
static_assert(sizeof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI) == 0x0000F0, "Wrong size on FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, InWorldContextObject) == 0x000000, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, Icon) == 0x000008, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::Icon' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, Title) == 0x000090, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::Title' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, MESSAGE) == 0x0000A8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::MESSAGE' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, ConfirmButtonInputActions) == 0x0000C0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::ConfirmButtonInputActions' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, DeclineButtonInputAction) == 0x0000D0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::DeclineButtonInputAction' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, AdditionalContent) == 0x0000D8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::AdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, LeftAdditionalContent) == 0x0000E0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::LeftAdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI, ReturnValue) == 0x0000E8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_CustomInput
// 0x00E8 (0x00E8 - 0x0000)
struct FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Icon;                                              // 0x0008(0x0088)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x00A8(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FName                                   ConfirmAction;                                     // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DeclineAction;                                     // 0x00C8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AdditionalContent;                                 // 0x00D0(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                LeftAdditionalContent;                             // 0x00D8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI*  ReturnValue;                                       // 0x00E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput) == 0x000008, "Wrong alignment on FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput");
static_assert(sizeof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput) == 0x0000E8, "Wrong size on FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, InWorldContextObject) == 0x000000, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, Icon) == 0x000008, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::Icon' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, Title) == 0x000090, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::Title' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, MESSAGE) == 0x0000A8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::MESSAGE' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, ConfirmAction) == 0x0000C0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::ConfirmAction' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, DeclineAction) == 0x0000C8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::DeclineAction' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, AdditionalContent) == 0x0000D0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::AdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, LeftAdditionalContent) == 0x0000D8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::LeftAdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput, ReturnValue) == 0x0000E0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_NUI
// 0x00E0 (0x00E0 - 0x0000)
struct FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Icon;                                              // 0x0008(0x0088)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x00A8(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          bShowConfirm;                                      // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDecline;                                      // 0x00C1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                AdditionalContent;                                 // 0x00C8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                LeftAdditionalContent;                             // 0x00D0(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI*  ReturnValue;                                       // 0x00D8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI) == 0x000008, "Wrong alignment on FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI");
static_assert(sizeof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI) == 0x0000E0, "Wrong size on FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, InWorldContextObject) == 0x000000, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, Icon) == 0x000008, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::Icon' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, Title) == 0x000090, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::Title' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, MESSAGE) == 0x0000A8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::MESSAGE' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, bShowConfirm) == 0x0000C0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::bShowConfirm' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, bShowDecline) == 0x0000C1, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::bShowDecline' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, AdditionalContent) == 0x0000C8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::AdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, LeftAdditionalContent) == 0x0000D0, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::LeftAdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI, ReturnValue) == 0x0000D8, "Member 'FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged) == 0x000008, "Wrong alignment on FortHUDElementWidget_HandleOnHUDElementVisibilityChanged");
static_assert(sizeof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged) == 0x000020, "Wrong size on FortHUDElementWidget_HandleOnHUDElementVisibilityChanged");
static_assert(offsetof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged, HiddenHUDElementTags) == 0x000000, "Member 'FortHUDElementWidget_HandleOnHUDElementVisibilityChanged::HiddenHUDElementTags' has a wrong offset!");

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHUDElementWidget_OnVisibilitySetEvent) == 0x000001, "Wrong alignment on FortHUDElementWidget_OnVisibilitySetEvent");
static_assert(sizeof(FortHUDElementWidget_OnVisibilitySetEvent) == 0x000001, "Wrong size on FortHUDElementWidget_OnVisibilitySetEvent");
static_assert(offsetof(FortHUDElementWidget_OnVisibilitySetEvent, InVisibility) == 0x000000, "Member 'FortHUDElementWidget_OnVisibilitySetEvent::InVisibility' has a wrong offset!");

// Function FortniteUI.FortGridPickerTile.SetData
// 0x0008 (0x0008 - 0x0000)
struct FortGridPickerTile_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridPickerTile_SetData) == 0x000008, "Wrong alignment on FortGridPickerTile_SetData");
static_assert(sizeof(FortGridPickerTile_SetData) == 0x000008, "Wrong size on FortGridPickerTile_SetData");
static_assert(offsetof(FortGridPickerTile_SetData, InData) == 0x000000, "Member 'FortGridPickerTile_SetData::InData' has a wrong offset!");

// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController
// 0x0008 (0x0008 - 0x0000)
struct AthenaAIKillsBase_SetKillsSourcePlayerController final
{
public:
	class AFortPlayerControllerAthena*            InPlayerController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIKillsBase_SetKillsSourcePlayerController) == 0x000008, "Wrong alignment on AthenaAIKillsBase_SetKillsSourcePlayerController");
static_assert(sizeof(AthenaAIKillsBase_SetKillsSourcePlayerController) == 0x000008, "Wrong size on AthenaAIKillsBase_SetKillsSourcePlayerController");
static_assert(offsetof(AthenaAIKillsBase_SetKillsSourcePlayerController, InPlayerController) == 0x000000, "Member 'AthenaAIKillsBase_SetKillsSourcePlayerController::InPlayerController' has a wrong offset!");

// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState
// 0x0008 (0x0008 - 0x0000)
struct AthenaAIKillsBase_SetKillsSourcePlayerState final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAIKillsBase_SetKillsSourcePlayerState) == 0x000008, "Wrong alignment on AthenaAIKillsBase_SetKillsSourcePlayerState");
static_assert(sizeof(AthenaAIKillsBase_SetKillsSourcePlayerState) == 0x000008, "Wrong size on AthenaAIKillsBase_SetKillsSourcePlayerState");
static_assert(offsetof(AthenaAIKillsBase_SetKillsSourcePlayerState, InPlayerState) == 0x000000, "Member 'AthenaAIKillsBase_SetKillsSourcePlayerState::InPlayerState' has a wrong offset!");

// Function FortniteUI.FortAsyncAction_CheckForStwMfaReward.CheckForStwMfaReward
// 0x0010 (0x0010 - 0x0000)
struct FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward final
{
public:
	class AFortPlayerController*                  Param_PlayerController;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_CheckForStwMfaReward*  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward) == 0x000008, "Wrong alignment on FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward");
static_assert(sizeof(FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward) == 0x000010, "Wrong size on FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward");
static_assert(offsetof(FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward, Param_PlayerController) == 0x000000, "Member 'FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward::Param_PlayerController' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward, ReturnValue) == 0x000008, "Member 'FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward::ReturnValue' has a wrong offset!");

// Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_OnAwardGranted final
{
public:
	class UFortAwardItemDefinition*               AwardDefinition;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAwardAlertBase_OnAwardGranted) == 0x000008, "Wrong alignment on AthenaAwardAlertBase_OnAwardGranted");
static_assert(sizeof(AthenaAwardAlertBase_OnAwardGranted) == 0x000008, "Wrong size on AthenaAwardAlertBase_OnAwardGranted");
static_assert(offsetof(AthenaAwardAlertBase_OnAwardGranted, AwardDefinition) == 0x000000, "Member 'AthenaAwardAlertBase_OnAwardGranted::AwardDefinition' has a wrong offset!");

// Function FortniteUI.AthenaAwardAlertBase.SetDataSource
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_SetDataSource final
{
public:
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAwardAlertBase_SetDataSource) == 0x000008, "Wrong alignment on AthenaAwardAlertBase_SetDataSource");
static_assert(sizeof(AthenaAwardAlertBase_SetDataSource) == 0x000008, "Wrong size on AthenaAwardAlertBase_SetDataSource");
static_assert(offsetof(AthenaAwardAlertBase_SetDataSource, PlayerViewModel) == 0x000000, "Member 'AthenaAwardAlertBase_SetDataSource::PlayerViewModel' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.GetTileForObject
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_GetTileForObject final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortGridPickerTile*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_GetTileForObject) == 0x000008, "Wrong alignment on FortGridWidgetBase_GetTileForObject");
static_assert(sizeof(FortGridWidgetBase_GetTileForObject) == 0x000010, "Wrong size on FortGridWidgetBase_GetTileForObject");
static_assert(offsetof(FortGridWidgetBase_GetTileForObject, Object) == 0x000000, "Member 'FortGridWidgetBase_GetTileForObject::Object' has a wrong offset!");
static_assert(offsetof(FortGridWidgetBase_GetTileForObject, ReturnValue) == 0x000008, "Member 'FortGridWidgetBase_GetTileForObject::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.GetTiles
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_GetTiles final
{
public:
	TArray<class UFortGridPickerTile*>            ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_GetTiles) == 0x000008, "Wrong alignment on FortGridWidgetBase_GetTiles");
static_assert(sizeof(FortGridWidgetBase_GetTiles) == 0x000010, "Wrong size on FortGridWidgetBase_GetTiles");
static_assert(offsetof(FortGridWidgetBase_GetTiles, ReturnValue) == 0x000000, "Member 'FortGridWidgetBase_GetTiles::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetClearWidgetType
// 0x0008 (0x0008 - 0x0000)
struct FortGridWidgetBase_SetClearWidgetType final
{
public:
	TSubclassOf<class UFortGridPickerTile>        InClearWidgetType;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetClearWidgetType) == 0x000008, "Wrong alignment on FortGridWidgetBase_SetClearWidgetType");
static_assert(sizeof(FortGridWidgetBase_SetClearWidgetType) == 0x000008, "Wrong size on FortGridWidgetBase_SetClearWidgetType");
static_assert(offsetof(FortGridWidgetBase_SetClearWidgetType, InClearWidgetType) == 0x000000, "Member 'FortGridWidgetBase_SetClearWidgetType::InClearWidgetType' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetDataProvider
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_SetDataProvider final
{
public:
	TArray<class UObject*>                        Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetDataProvider) == 0x000008, "Wrong alignment on FortGridWidgetBase_SetDataProvider");
static_assert(sizeof(FortGridWidgetBase_SetDataProvider) == 0x000010, "Wrong size on FortGridWidgetBase_SetDataProvider");
static_assert(offsetof(FortGridWidgetBase_SetDataProvider, Data) == 0x000000, "Member 'FortGridWidgetBase_SetDataProvider::Data' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetPeekOverflowTilePercentage
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetPeekOverflowTilePercentage final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetPeekOverflowTilePercentage) == 0x000004, "Wrong alignment on FortGridWidgetBase_SetPeekOverflowTilePercentage");
static_assert(sizeof(FortGridWidgetBase_SetPeekOverflowTilePercentage) == 0x000004, "Wrong size on FortGridWidgetBase_SetPeekOverflowTilePercentage");
static_assert(offsetof(FortGridWidgetBase_SetPeekOverflowTilePercentage, Percent) == 0x000000, "Member 'FortGridWidgetBase_SetPeekOverflowTilePercentage::Percent' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetTileHeight
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTileHeight final
{
public:
	float                                         Height;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetTileHeight) == 0x000004, "Wrong alignment on FortGridWidgetBase_SetTileHeight");
static_assert(sizeof(FortGridWidgetBase_SetTileHeight) == 0x000004, "Wrong size on FortGridWidgetBase_SetTileHeight");
static_assert(offsetof(FortGridWidgetBase_SetTileHeight, Height) == 0x000000, "Member 'FortGridWidgetBase_SetTileHeight::Height' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetTilePadding
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_SetTilePadding final
{
public:
	struct FMargin                                Padding;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetTilePadding) == 0x000004, "Wrong alignment on FortGridWidgetBase_SetTilePadding");
static_assert(sizeof(FortGridWidgetBase_SetTilePadding) == 0x000010, "Wrong size on FortGridWidgetBase_SetTilePadding");
static_assert(offsetof(FortGridWidgetBase_SetTilePadding, Padding) == 0x000000, "Member 'FortGridWidgetBase_SetTilePadding::Padding' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetTilesAcross
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTilesAcross final
{
public:
	int32                                         Across;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetTilesAcross) == 0x000004, "Wrong alignment on FortGridWidgetBase_SetTilesAcross");
static_assert(sizeof(FortGridWidgetBase_SetTilesAcross) == 0x000004, "Wrong size on FortGridWidgetBase_SetTilesAcross");
static_assert(offsetof(FortGridWidgetBase_SetTilesAcross, Across) == 0x000000, "Member 'FortGridWidgetBase_SetTilesAcross::Across' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetTilesDown
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTilesDown final
{
public:
	int32                                         Down;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetTilesDown) == 0x000004, "Wrong alignment on FortGridWidgetBase_SetTilesDown");
static_assert(sizeof(FortGridWidgetBase_SetTilesDown) == 0x000004, "Wrong size on FortGridWidgetBase_SetTilesDown");
static_assert(offsetof(FortGridWidgetBase_SetTilesDown, Down) == 0x000000, "Member 'FortGridWidgetBase_SetTilesDown::Down' has a wrong offset!");

// Function FortniteUI.FortGridWidgetBase.SetTileWidth
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTileWidth final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridWidgetBase_SetTileWidth) == 0x000004, "Wrong alignment on FortGridWidgetBase_SetTileWidth");
static_assert(sizeof(FortGridWidgetBase_SetTileWidth) == 0x000004, "Wrong size on FortGridWidgetBase_SetTileWidth");
static_assert(offsetof(FortGridWidgetBase_SetTileWidth, Width) == 0x000000, "Member 'FortGridWidgetBase_SetTileWidth::Width' has a wrong offset!");

// DelegateFunction FortniteUI.FortGridPickerButton.CreateGridWidget__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortGridPickerButton_CreateGridWidget__DelegateSignature final
{
public:
	class UFortGridPickerGrid*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortGridPickerButton_CreateGridWidget__DelegateSignature) == 0x000008, "Wrong alignment on FortGridPickerButton_CreateGridWidget__DelegateSignature");
static_assert(sizeof(FortGridPickerButton_CreateGridWidget__DelegateSignature) == 0x000008, "Wrong size on FortGridPickerButton_CreateGridWidget__DelegateSignature");
static_assert(offsetof(FortGridPickerButton_CreateGridWidget__DelegateSignature, ReturnValue) == 0x000000, "Member 'FortGridPickerButton_CreateGridWidget__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction FortniteUI.FortGridPickerButton.OnIsGridPickerOpenChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct FortGridPickerButton_OnIsGridPickerOpenChanged__DelegateSignature final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
