#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Party_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "McpProfileSys_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Slate_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x0348 - 0x0320)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0320(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0321(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x0322(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x0323(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0x24];                                     // 0x0324(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
static_assert(alignof(UFortActivatablePanel) == 0x000008, "Wrong alignment on UFortActivatablePanel");
static_assert(sizeof(UFortActivatablePanel) == 0x000348, "Wrong size on UFortActivatablePanel");
static_assert(offsetof(UFortActivatablePanel, bIsPushedOnToContentPanelStack) == 0x000320, "Member 'UFortActivatablePanel::bIsPushedOnToContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsAlreadyOnContentPanelStack) == 0x000321, "Member 'UFortActivatablePanel::bIsAlreadyOnContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, InputPriority) == 0x000322, "Member 'UFortActivatablePanel::InputPriority' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsClosableByPlayerInput) == 0x000323, "Member 'UFortActivatablePanel::bIsClosableByPlayerInput' has a wrong offset!");

// Class FortniteUI.AthenaLeaderboardScreenBase
// 0x0100 (0x0448 - 0x0348)
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase*                 LeaderboardTabList;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         MatchRotator;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         LeaderboardTypeRotator;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       RefreshTimeText;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       NoDataMessageText;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                          BorderLocalUserFocus;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             LeaderboardDisplayData;                            // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButton*>       ActiveTabButtons;                                  // 0x0380(0x0050)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x03D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*       LocalUserRowProxy;                                 // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                     CurrentLeaderboardFilter;                          // 0x03E8(0x0028)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0x38];                                     // 0x0410(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnPlaylistChanged(const class FName NewPlaylistName, const ECommonInputType NewInputType);
	void OnQueryFinished();
	void OnQueryStarted();
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, const class FText& QueryErrorStr);
	void OnUpdateListHeader(const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateTabButtonText(class UCommonButton* Button, const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);

	bool CanShowFriendsOnlyLeaderboard() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLeaderboardScreenBase">();
	}
	static class UAthenaLeaderboardScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardScreenBase>();
	}
};
static_assert(alignof(UAthenaLeaderboardScreenBase) == 0x000008, "Wrong alignment on UAthenaLeaderboardScreenBase");
static_assert(sizeof(UAthenaLeaderboardScreenBase) == 0x000448, "Wrong size on UAthenaLeaderboardScreenBase");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LeaderboardTabList) == 0x000348, "Member 'UAthenaLeaderboardScreenBase::LeaderboardTabList' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, MatchRotator) == 0x000350, "Member 'UAthenaLeaderboardScreenBase::MatchRotator' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LeaderboardTypeRotator) == 0x000358, "Member 'UAthenaLeaderboardScreenBase::LeaderboardTypeRotator' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, RefreshTimeText) == 0x000360, "Member 'UAthenaLeaderboardScreenBase::RefreshTimeText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, NoDataMessageText) == 0x000368, "Member 'UAthenaLeaderboardScreenBase::NoDataMessageText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, BorderLocalUserFocus) == 0x000370, "Member 'UAthenaLeaderboardScreenBase::BorderLocalUserFocus' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LeaderboardDisplayData) == 0x000378, "Member 'UAthenaLeaderboardScreenBase::LeaderboardDisplayData' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, ActiveTabButtons) == 0x000380, "Member 'UAthenaLeaderboardScreenBase::ActiveTabButtons' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, RowProxies) == 0x0003D0, "Member 'UAthenaLeaderboardScreenBase::RowProxies' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, LocalUserRowProxy) == 0x0003E0, "Member 'UAthenaLeaderboardScreenBase::LocalUserRowProxy' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardScreenBase, CurrentLeaderboardFilter) == 0x0003E8, "Member 'UAthenaLeaderboardScreenBase::CurrentLeaderboardFilter' has a wrong offset!");

// Class FortniteUI.FortUserWidget
// 0x0010 (0x0240 - 0x0230)
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConsumePointerInput;                              // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGrantCheatMenu(const class FString& TemplateId, const class FString& InstanceId);
	void AddStoreCheatMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUserWidget">();
	}
	static class UFortUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUserWidget>();
	}
};
static_assert(alignof(UFortUserWidget) == 0x000008, "Wrong alignment on UFortUserWidget");
static_assert(sizeof(UFortUserWidget) == 0x000240, "Wrong size on UFortUserWidget");
static_assert(offsetof(UFortUserWidget, bConsumePointerInput) == 0x000238, "Member 'UFortUserWidget::bConsumePointerInput' has a wrong offset!");

// Class FortniteUI.FortMovieWidget
// 0x0028 (0x0268 - 0x0240)
class UFortMovieWidget : public UFortUserWidget
{
public:
	UMulticastDelegateProperty_                   OnMediaOpened;                                     // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          MediaTexture;                                      // 0x0258(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSoundComponent*                   SoundComponent;                                    // 0x0260(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void MediaDimensionsUpdated(float NewWidth, float NewHeight);
	void RequestPlayMovie(bool bShouldRewind);
	void RequestStopMovie();
	bool SetMediaSource(class UMediaSource* InMediaSource, const struct FMediaPlayerOptions& PlayerOptions, bool bPlayOnOpen, bool bLooping);

	class UMediaPlayer* GetMediaPlayer() const;
	class UMediaSoundComponent* GetMediaSoundComponent() const;
	class UMediaTexture* GetMediaTexture() const;
	bool HasPlayerForSource(class UMediaSource* InMediaSource) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovieWidget">();
	}
	static class UFortMovieWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovieWidget>();
	}
};
static_assert(alignof(UFortMovieWidget) == 0x000008, "Wrong alignment on UFortMovieWidget");
static_assert(sizeof(UFortMovieWidget) == 0x000268, "Wrong size on UFortMovieWidget");
static_assert(offsetof(UFortMovieWidget, OnMediaOpened) == 0x000240, "Member 'UFortMovieWidget::OnMediaOpened' has a wrong offset!");
static_assert(offsetof(UFortMovieWidget, MediaPlayer) == 0x000250, "Member 'UFortMovieWidget::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UFortMovieWidget, MediaTexture) == 0x000258, "Member 'UFortMovieWidget::MediaTexture' has a wrong offset!");
static_assert(offsetof(UFortMovieWidget, SoundComponent) == 0x000260, "Member 'UFortMovieWidget::SoundComponent' has a wrong offset!");

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;
	int32 GetCurrentSeasonNumber() const;
	bool IsAtMaxBattlePassTier() const;
	bool ShouldReplaceBattleStarsWithAlternateReward() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};
static_assert(alignof(UAthenaAccountContext) == 0x000008, "Wrong alignment on UAthenaAccountContext");
static_assert(sizeof(UAthenaAccountContext) == 0x000028, "Wrong size on UAthenaAccountContext");

// Class FortniteUI.FortAsyncAction_ShowConfirmation_NUI
// 0x0140 (0x0170 - 0x0030)
class UFortAsyncAction_ShowConfirmation_NUI final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   DialogResult;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI             Description;                                       // 0x0048(0x0120)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAsyncAction_ShowConfirmation_NUI* ShowConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, const class FText& Title, const class FText& MESSAGE, const TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, const class FName& DeclineButtonInputAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
	static class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_CustomInput(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, const class FText& Title, const class FText& MESSAGE, class FName ConfirmAction, class FName DeclineAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
	static class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, const class FText& Title, const class FText& MESSAGE, bool bShowConfirm, bool bShowDecline, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_ShowConfirmation_NUI">();
	}
	static class UFortAsyncAction_ShowConfirmation_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowConfirmation_NUI>();
	}
};
static_assert(alignof(UFortAsyncAction_ShowConfirmation_NUI) == 0x000008, "Wrong alignment on UFortAsyncAction_ShowConfirmation_NUI");
static_assert(sizeof(UFortAsyncAction_ShowConfirmation_NUI) == 0x000170, "Wrong size on UFortAsyncAction_ShowConfirmation_NUI");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation_NUI, DialogResult) == 0x000030, "Member 'UFortAsyncAction_ShowConfirmation_NUI::DialogResult' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation_NUI, WorldContextObject) == 0x000040, "Member 'UFortAsyncAction_ShowConfirmation_NUI::WorldContextObject' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation_NUI, Description) == 0x000048, "Member 'UFortAsyncAction_ShowConfirmation_NUI::Description' has a wrong offset!");

// Class FortniteUI.FortHUDElementWidget
// 0x0030 (0x0268 - 0x0238)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTag                           ElementTag;                                        // 0x0238(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0240(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
static_assert(alignof(UFortHUDElementWidget) == 0x000008, "Wrong alignment on UFortHUDElementWidget");
static_assert(sizeof(UFortHUDElementWidget) == 0x000268, "Wrong size on UFortHUDElementWidget");
static_assert(offsetof(UFortHUDElementWidget, ElementTag) == 0x000238, "Member 'UFortHUDElementWidget::ElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HUDElementTag) == 0x000240, "Member 'UFortHUDElementWidget::HUDElementTag' has a wrong offset!");

// Class FortniteUI.FortGridPickerTile
// 0x0010 (0x0250 - 0x0240)
class UFortGridPickerTile final : public UFortUserWidget
{
public:
	class UObject*                                Data;                                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGridWidgetBase*                    Owner;                                             // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ForwardClicked();
	void OnClicked();
	void SetData(class UObject* InData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridPickerTile">();
	}
	static class UFortGridPickerTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridPickerTile>();
	}
};
static_assert(alignof(UFortGridPickerTile) == 0x000008, "Wrong alignment on UFortGridPickerTile");
static_assert(sizeof(UFortGridPickerTile) == 0x000250, "Wrong size on UFortGridPickerTile");
static_assert(offsetof(UFortGridPickerTile, Data) == 0x000240, "Member 'UFortGridPickerTile::Data' has a wrong offset!");
static_assert(offsetof(UFortGridPickerTile, Owner) == 0x000248, "Member 'UFortGridPickerTile::Owner' has a wrong offset!");

// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x0280 - 0x0268)
class UAthenaAIKillsBase final : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             KillsText;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                KillsSource;                                       // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomKillSource;                                 // 0x0278(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIKillsBase">();
	}
	static class UAthenaAIKillsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIKillsBase>();
	}
};
static_assert(alignof(UAthenaAIKillsBase) == 0x000008, "Wrong alignment on UAthenaAIKillsBase");
static_assert(sizeof(UAthenaAIKillsBase) == 0x000280, "Wrong size on UAthenaAIKillsBase");
static_assert(offsetof(UAthenaAIKillsBase, KillsText) == 0x000268, "Member 'UAthenaAIKillsBase::KillsText' has a wrong offset!");
static_assert(offsetof(UAthenaAIKillsBase, KillsSource) == 0x000270, "Member 'UAthenaAIKillsBase::KillsSource' has a wrong offset!");
static_assert(offsetof(UAthenaAIKillsBase, bCustomKillSource) == 0x000278, "Member 'UAthenaAIKillsBase::bCustomKillSource' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_CheckForStwMfaReward
// 0x0028 (0x0058 - 0x0030)
class UFortAsyncAction_CheckForStwMfaReward final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnCompleted;                                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  PlayerController;                                  // 0x0050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_CheckForStwMfaReward* CheckForStwMfaReward(class AFortPlayerController* Param_PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_CheckForStwMfaReward">();
	}
	static class UFortAsyncAction_CheckForStwMfaReward* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_CheckForStwMfaReward>();
	}
};
static_assert(alignof(UFortAsyncAction_CheckForStwMfaReward) == 0x000008, "Wrong alignment on UFortAsyncAction_CheckForStwMfaReward");
static_assert(sizeof(UFortAsyncAction_CheckForStwMfaReward) == 0x000058, "Wrong size on UFortAsyncAction_CheckForStwMfaReward");
static_assert(offsetof(UFortAsyncAction_CheckForStwMfaReward, OnCompleted) == 0x000030, "Member 'UFortAsyncAction_CheckForStwMfaReward::OnCompleted' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_CheckForStwMfaReward, OnFailed) == 0x000040, "Member 'UFortAsyncAction_CheckForStwMfaReward::OnFailed' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_CheckForStwMfaReward, PlayerController) == 0x000050, "Member 'UFortAsyncAction_CheckForStwMfaReward::PlayerController' has a wrong offset!");

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0238 - 0x0230)
class UAthenaAwardAlertBase final : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAwardAlertBase">();
	}
	static class UAthenaAwardAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAwardAlertBase>();
	}
};
static_assert(alignof(UAthenaAwardAlertBase) == 0x000008, "Wrong alignment on UAthenaAwardAlertBase");
static_assert(sizeof(UAthenaAwardAlertBase) == 0x000238, "Wrong size on UAthenaAwardAlertBase");
static_assert(offsetof(UAthenaAwardAlertBase, PlayerVM) == 0x000230, "Member 'UAthenaAwardAlertBase::PlayerVM' has a wrong offset!");

// Class FortniteUI.FortGridWidgetBase
// 0x0148 (0x0268 - 0x0120)
class UFortGridWidgetBase : public UContentWidget
{
public:
	TSubclassOf<class UFortGridPickerTile>        ClearWidgetType;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileWidth;                                         // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileHeight;                                        // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesAcross;                                       // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesDown;                                         // 0x0134(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShrinkToFit;                                      // 0x0138(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PeekOverflowTilePercentage;                        // 0x013C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                TilePadding;                                       // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            GridBackground;                                    // 0x0150(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                GridBackgroundPadding;                             // 0x01D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        DataProvider;                                      // 0x01E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                   OnTileGenerated;                                   // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTileClicked;                                     // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseEnterTile;                                  // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseLeaveTile;                                  // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortGridPickerTile>        TileWidgetType;                                    // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridSortKind                                 SortKind;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReversed;                                         // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Data)>          GetSortKeyFor;                                     // 0x0244(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x14];                                     // 0x0254(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortGridPickerTile* GetTileForObject(const class UObject* Object);
	TArray<class UFortGridPickerTile*> GetTiles();
	void SetClearWidgetType(TSubclassOf<class UFortGridPickerTile> InClearWidgetType);
	void SetDataProvider(const TArray<class UObject*>& Data);
	void SetPeekOverflowTilePercentage(float Percent);
	void SetTileHeight(float Height);
	void SetTilePadding(const struct FMargin& Padding);
	void SetTilesAcross(int32 Across);
	void SetTilesDown(int32 Down);
	void SetTileWidth(float Width);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridWidgetBase">();
	}
	static class UFortGridWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridWidgetBase>();
	}
};
static_assert(alignof(UFortGridWidgetBase) == 0x000008, "Wrong alignment on UFortGridWidgetBase");
static_assert(sizeof(UFortGridWidgetBase) == 0x000268, "Wrong size on UFortGridWidgetBase");
static_assert(offsetof(UFortGridWidgetBase, ClearWidgetType) == 0x000120, "Member 'UFortGridWidgetBase::ClearWidgetType' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TileWidth) == 0x000128, "Member 'UFortGridWidgetBase::TileWidth' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TileHeight) == 0x00012C, "Member 'UFortGridWidgetBase::TileHeight' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TilesAcross) == 0x000130, "Member 'UFortGridWidgetBase::TilesAcross' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TilesDown) == 0x000134, "Member 'UFortGridWidgetBase::TilesDown' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, bShrinkToFit) == 0x000138, "Member 'UFortGridWidgetBase::bShrinkToFit' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, PeekOverflowTilePercentage) == 0x00013C, "Member 'UFortGridWidgetBase::PeekOverflowTilePercentage' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TilePadding) == 0x000140, "Member 'UFortGridWidgetBase::TilePadding' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, GridBackground) == 0x000150, "Member 'UFortGridWidgetBase::GridBackground' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, GridBackgroundPadding) == 0x0001D8, "Member 'UFortGridWidgetBase::GridBackgroundPadding' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, DataProvider) == 0x0001E8, "Member 'UFortGridWidgetBase::DataProvider' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, OnTileGenerated) == 0x0001F8, "Member 'UFortGridWidgetBase::OnTileGenerated' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, OnTileClicked) == 0x000208, "Member 'UFortGridWidgetBase::OnTileClicked' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, OnMouseEnterTile) == 0x000218, "Member 'UFortGridWidgetBase::OnMouseEnterTile' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, OnMouseLeaveTile) == 0x000228, "Member 'UFortGridWidgetBase::OnMouseLeaveTile' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, TileWidgetType) == 0x000238, "Member 'UFortGridWidgetBase::TileWidgetType' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, SortKind) == 0x000240, "Member 'UFortGridWidgetBase::SortKind' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, bReversed) == 0x000241, "Member 'UFortGridWidgetBase::bReversed' has a wrong offset!");
static_assert(offsetof(UFortGridWidgetBase, GetSortKeyFor) == 0x000244, "Member 'UFortGridWidgetBase::GetSortKeyFor' has a wrong offset!");

// Class FortniteUI.FortGridPickerButton
// 0x0048 (0x02B0 - 0x0268)
class UFortGridPickerButton final : public UFortGridWidgetBase
{
public:
	EMenuPlacement                                GridPlacement;                                     // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGridPickerGrid*                    GridWidget;                                        // 0x0270(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseOnTileClicked;                               // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             GridWidgetDelegate;                                // 0x027C(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnGridPickerOpenChanged;                           // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x10];                                     // 0x02A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortGridPickerGrid* CreateGridWidget__DelegateSignature();
	void OnButtonClicked();
	void OnIsGridPickerOpenChanged__DelegateSignature(bool IsOpen);
	void SetIsOpen(const bool ShouldBeOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGridPickerButton">();
	}
	static class UFortGridPickerButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridPickerButton>();
	}
};
static_assert(alignof(UFortGridPickerButton) == 0x000008, "Wrong alignment on UFortGridPickerButton");
static_assert(sizeof(UFortGridPickerButton) == 0x0002B0, "Wrong size on UFortGridPickerButton");
static_assert(offsetof(UFortGridPickerButton, GridPlacement) == 0x000268, "Member 'UFortGridPickerButton::GridPlacement' has a wrong offset!");
static_assert(offsetof(UFortGridPickerButton, GridWidget) == 0x000270, "Member 'UFortGridPickerButton::GridWidget' has a wrong offset!");
static_assert(offsetof(UFortGridPickerButton, bCloseOnTileClicked) == 0x000278, "Member 'UFortGridPickerButton::bCloseOnTileClicked' has a wrong offset!");
static_assert(offsetof(UFortGridPickerButton, GridWidgetDelegate) == 0x00027C, "Member 'UFortGridPickerButton::GridWidgetDelegate' has a wrong offset!");
static_assert(offsetof(UFortGridPickerButton, OnGridPickerOpenChanged) == 0x000290, "Member 'UFortGridPickerButton::OnGridPickerOpenChanged' has a wrong offset!");

// Class FortniteUI.MassiveGadgetEquippedWidget
// 0x0000 (0x0238 - 0x0238)
class UMassiveGadgetEquippedWidget final : public UCommonUserWidget
{
public:
	void HandleMassiveTagChanged(const struct FGameplayTag& Tag, int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassiveGadgetEquippedWidget">();
	}
	static class UMassiveGadgetEquippedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassiveGadgetEquippedWidget>();
	}
};
static_assert(alignof(UMassiveGadgetEquippedWidget) == 0x000008, "Wrong alignment on UMassiveGadgetEquippedWidget");
static_assert(sizeof(UMassiveGadgetEquippedWidget) == 0x000238, "Wrong size on UMassiveGadgetEquippedWidget");

// Class FortniteUI.FortActivatablePanelWithItemPreview
// 0x00F8 (0x0440 - 0x0348)
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemView*                          ItemViewObject;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedSupportsCameraControlInputAction;   // 0x0358(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedZoomInputAction;                    // 0x0368(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomOutInputAction;                        // 0x0378(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomInInputAction;                         // 0x0388(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewRotateInputAction;                         // 0x0398(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x88];                                     // 0x03A8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowItemRotation;                                 // 0x0430(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AllowItemZooming;                                  // 0x0431(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AutomaticallyRegisterCameraView;                   // 0x0432(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_433[0x5];                                      // 0x0433(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             ActionDataTable;                                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* GetWidgetForFramingViewedItem();
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnVaultItemsViewed(const TArray<class UFortItem*>& Items);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanelWithItemPreview">();
	}
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanelWithItemPreview>();
	}
};
static_assert(alignof(UFortActivatablePanelWithItemPreview) == 0x000008, "Wrong alignment on UFortActivatablePanelWithItemPreview");
static_assert(sizeof(UFortActivatablePanelWithItemPreview) == 0x000440, "Wrong size on UFortActivatablePanelWithItemPreview");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewObject) == 0x000350, "Member 'UFortActivatablePanelWithItemPreview::ItemViewObject' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewUnifiedSupportsCameraControlInputAction) == 0x000358, "Member 'UFortActivatablePanelWithItemPreview::ItemViewUnifiedSupportsCameraControlInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewUnifiedZoomInputAction) == 0x000368, "Member 'UFortActivatablePanelWithItemPreview::ItemViewUnifiedZoomInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewZoomOutInputAction) == 0x000378, "Member 'UFortActivatablePanelWithItemPreview::ItemViewZoomOutInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewZoomInInputAction) == 0x000388, "Member 'UFortActivatablePanelWithItemPreview::ItemViewZoomInInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ItemViewRotateInputAction) == 0x000398, "Member 'UFortActivatablePanelWithItemPreview::ItemViewRotateInputAction' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AllowItemRotation) == 0x000430, "Member 'UFortActivatablePanelWithItemPreview::AllowItemRotation' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AllowItemZooming) == 0x000431, "Member 'UFortActivatablePanelWithItemPreview::AllowItemZooming' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, AutomaticallyRegisterCameraView) == 0x000432, "Member 'UFortActivatablePanelWithItemPreview::AutomaticallyRegisterCameraView' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanelWithItemPreview, ActionDataTable) == 0x000438, "Member 'UFortActivatablePanelWithItemPreview::ActionDataTable' has a wrong offset!");

// Class FortniteUI.AthenaItemSelectorScreenBase
// 0x0178 (0x05B8 - 0x0440)
class UAthenaItemSelectorScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	TSubclassOf<class UCommonButton>              TabButtonType;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;                       // 0x0448(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortTabButtonLabelInfo                VariantButtonLabelInfo;                            // 0x0498(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_ConfirmSelection;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_EditStyle;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_ConfirmStyle;                               // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*             Picker_ItemSelector;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ItemInfo;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                    Item_HeaderInfo;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItem*                              CurrentPreviewItem;                                // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*          CurrentPreviewItemDef;                             // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>         CurrentPreviewVariantChannels;                     // 0x0578(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortVariantPicker*                     Picker_VariantSelector;                            // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_590[0x20];                                     // 0x0590(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	EAthenaCustomizationCategory                  CustomizeCategory;                                 // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x05B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void EnterEditStyle();
	void ExitEditStyle();
	void HandleSelectedTabChanged(class FName SelectedTabID);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	void OnFinsihedItemSave();
	void OnFinsihedItemSetup(const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName, EAthenaCustomizationCategory SelectedCategory);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnSavingItemStarted();
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnVariantSelectionChanged(const struct FMcpVariantChannelInfo& InVariant);
	void SaveAndExit();
	void StartItemCustomization(EAthenaCustomizationCategory InCategory, int32 InSubslotIndex, const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName);

	class UFortItem* GetCurrentItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaItemSelectorScreenBase">();
	}
	static class UAthenaItemSelectorScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemSelectorScreenBase>();
	}
};
static_assert(alignof(UAthenaItemSelectorScreenBase) == 0x000008, "Wrong alignment on UAthenaItemSelectorScreenBase");
static_assert(sizeof(UAthenaItemSelectorScreenBase) == 0x0005B8, "Wrong size on UAthenaItemSelectorScreenBase");
static_assert(offsetof(UAthenaItemSelectorScreenBase, TabButtonType) == 0x000440, "Member 'UAthenaItemSelectorScreenBase::TabButtonType' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, ItemCategoryButtonLabelInfo) == 0x000448, "Member 'UAthenaItemSelectorScreenBase::ItemCategoryButtonLabelInfo' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, VariantButtonLabelInfo) == 0x000498, "Member 'UAthenaItemSelectorScreenBase::VariantButtonLabelInfo' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, Button_ConfirmSelection) == 0x000538, "Member 'UAthenaItemSelectorScreenBase::Button_ConfirmSelection' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, Button_EditStyle) == 0x000540, "Member 'UAthenaItemSelectorScreenBase::Button_EditStyle' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, Button_ConfirmStyle) == 0x000548, "Member 'UAthenaItemSelectorScreenBase::Button_ConfirmStyle' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, Picker_ItemSelector) == 0x000550, "Member 'UAthenaItemSelectorScreenBase::Picker_ItemSelector' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, ItemInfo) == 0x000558, "Member 'UAthenaItemSelectorScreenBase::ItemInfo' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, Item_HeaderInfo) == 0x000560, "Member 'UAthenaItemSelectorScreenBase::Item_HeaderInfo' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, CurrentPreviewItem) == 0x000568, "Member 'UAthenaItemSelectorScreenBase::CurrentPreviewItem' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, CurrentPreviewItemDef) == 0x000570, "Member 'UAthenaItemSelectorScreenBase::CurrentPreviewItemDef' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, CurrentPreviewVariantChannels) == 0x000578, "Member 'UAthenaItemSelectorScreenBase::CurrentPreviewVariantChannels' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, Picker_VariantSelector) == 0x000588, "Member 'UAthenaItemSelectorScreenBase::Picker_VariantSelector' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, CustomizeCategory) == 0x0005B0, "Member 'UAthenaItemSelectorScreenBase::CustomizeCategory' has a wrong offset!");
static_assert(offsetof(UAthenaItemSelectorScreenBase, SubslotIndex) == 0x0005B4, "Member 'UAthenaItemSelectorScreenBase::SubslotIndex' has a wrong offset!");

// Class FortniteUI.AthenaTimeWidgetBase
// 0x0018 (0x0280 - 0x0268)
class UAthenaTimeWidgetBase final : public UFortHUDElementWidget
{
public:
	bool                                          bIsDisplaying;                                     // 0x0268(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedFinalCountdownTime;                          // 0x026C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x0270(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TimeText;                                          // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleGamePhaseChanged(EAthenaGamePhase GamePhase);
	void OnGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
	void OnStartTimeDisplay();
	void OnStopTimeDisplay();
	void StartTimeDisplay();
	void StopTimeDisplay();
	void UpdateTimeText();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaTimeWidgetBase">();
	}
	static class UAthenaTimeWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTimeWidgetBase>();
	}
};
static_assert(alignof(UAthenaTimeWidgetBase) == 0x000008, "Wrong alignment on UAthenaTimeWidgetBase");
static_assert(sizeof(UAthenaTimeWidgetBase) == 0x000280, "Wrong size on UAthenaTimeWidgetBase");
static_assert(offsetof(UAthenaTimeWidgetBase, bIsDisplaying) == 0x000268, "Member 'UAthenaTimeWidgetBase::bIsDisplaying' has a wrong offset!");
static_assert(offsetof(UAthenaTimeWidgetBase, CachedFinalCountdownTime) == 0x00026C, "Member 'UAthenaTimeWidgetBase::CachedFinalCountdownTime' has a wrong offset!");
static_assert(offsetof(UAthenaTimeWidgetBase, UpdateTimerHandle) == 0x000270, "Member 'UAthenaTimeWidgetBase::UpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UAthenaTimeWidgetBase, TimeText) == 0x000278, "Member 'UAthenaTimeWidgetBase::TimeText' has a wrong offset!");

// Class FortniteUI.FortUIStateWidget_NUI
// 0x0018 (0x0360 - 0x0348)
class UFortUIStateWidget_NUI : public UFortActivatablePanel
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContentPushState>              StackStates;                                       // 0x0350(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void DynamicHandleLoadingScreenVisibilityChanged(bool Param_IsVisible);
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnHUDScaleChanged(float HUDScale);
	void OnLoadingScreenVisibilityChanged(bool Param_IsVisible);
	void PopAllContentWidgets();
	class UWidget* PopContentWidget();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidget(class UWidget* Widget);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void RequestOpenSocialMenu();
	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_NUI">();
	}
	static class UFortUIStateWidget_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_NUI>();
	}
};
static_assert(alignof(UFortUIStateWidget_NUI) == 0x000008, "Wrong alignment on UFortUIStateWidget_NUI");
static_assert(sizeof(UFortUIStateWidget_NUI) == 0x000360, "Wrong size on UFortUIStateWidget_NUI");
static_assert(offsetof(UFortUIStateWidget_NUI, StackStates) == 0x000350, "Member 'UFortUIStateWidget_NUI::StackStates' has a wrong offset!");

// Class FortniteUI.FortItemListEntryWidgetInterface
// 0x0000 (0x0028 - 0x0028)
class IFortItemListEntryWidgetInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemListEntryWidgetInterface">();
	}
	static class IFortItemListEntryWidgetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortItemListEntryWidgetInterface>();
	}
};
static_assert(alignof(IFortItemListEntryWidgetInterface) == 0x000008, "Wrong alignment on IFortItemListEntryWidgetInterface");
static_assert(sizeof(IFortItemListEntryWidgetInterface) == 0x000028, "Wrong size on IFortItemListEntryWidgetInterface");

// Class FortniteUI.AthenaHUDBase
// 0x0028 (0x0388 - 0x0360)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	uint8                                         Pad_360[0x10];                                     // 0x0360(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCursorModeChanging(bool bCursorModeEnabled);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void OnPlaylistExtensionWidgetCreated(EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDBase">();
	}
	static class UAthenaHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBase>();
	}
};
