#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendLinkButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function FriendLinkButton.FriendLinkButton_C.ExecuteUbergraph_FriendLinkButton
// 0x0078 (0x0078 - 0x0000)
struct FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFriendLink_C*                          CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USocialPanel_C*                         K2Node_DynamicCast_AsSocial_Panel;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0040(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0058(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton) == 0x000008, "Wrong alignment on FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton");
static_assert(sizeof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton) == 0x000078, "Wrong size on FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, EntryPoint) == 0x000000, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, CallFunc_Create_ReturnValue) == 0x000010, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, K2Node_DynamicCast_AsUIManager) == 0x000018, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, CallFunc_GetCachedWidget_ReturnValue) == 0x000028, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, K2Node_DynamicCast_AsSocial_Panel) == 0x000030, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::K2Node_DynamicCast_AsSocial_Panel' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, CallFunc_MakeLiteralText_ReturnValue) == 0x000040, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, CallFunc_TextToUpper_ReturnValue) == 0x000058, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton, K2Node_Event_IsDesignTime) == 0x000070, "Member 'FriendLinkButton_C_ExecuteUbergraph_FriendLinkButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function FriendLinkButton.FriendLinkButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FriendLinkButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendLinkButton_C_PreConstruct) == 0x000001, "Wrong alignment on FriendLinkButton_C_PreConstruct");
static_assert(sizeof(FriendLinkButton_C_PreConstruct) == 0x000001, "Wrong size on FriendLinkButton_C_PreConstruct");
static_assert(offsetof(FriendLinkButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FriendLinkButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

