#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendLink

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function FriendLink.FriendLink_C.ExecuteUbergraph_FriendLink
// 0x0150 (0x0150 - 0x0000)
struct FriendLink_C_ExecuteUbergraph_FriendLink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShareButtonType                              K2Node_Event_Type;                                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetStartingShareText_Button_Text;         // 0x0040(0x0018)()
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button2;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetStartingShareText_Button_Text1;        // 0x0088(0x0018)()
	EShareButtonType                              Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x00C0(0x0088)()
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendLink_C_ExecuteUbergraph_FriendLink) == 0x000008, "Wrong alignment on FriendLink_C_ExecuteUbergraph_FriendLink");
static_assert(sizeof(FriendLink_C_ExecuteUbergraph_FriendLink) == 0x000150, "Wrong size on FriendLink_C_ExecuteUbergraph_FriendLink");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, EntryPoint) == 0x000000, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::EntryPoint' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, Temp_object_Variable) == 0x000008, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, Temp_object_Variable1) == 0x000010, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, Temp_object_Variable2) == 0x000018, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_GetEndTime_ReturnValue) == 0x000028, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_PlayAnimation_ReturnValue1) == 0x000030, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_Event_Type) == 0x000038, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_Event_IsDesignTime) == 0x000039, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_GetStartingShareText_Button_Text) == 0x000040, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_GetStartingShareText_Button_Text' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000058, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_DynamicCast_AsIcon_Text_Button1) == 0x000068, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_DynamicCast_AsIcon_Text_Button1' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_DynamicCast_bSuccess1) == 0x000070, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_DynamicCast_AsIcon_Text_Button2) == 0x000078, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_DynamicCast_AsIcon_Text_Button2' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_DynamicCast_bSuccess2) == 0x000080, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_GetStartingShareText_Button_Text1) == 0x000088, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_GetStartingShareText_Button_Text1' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, Temp_byte_Variable) == 0x0000A0, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_PlayAnimation_ReturnValue2) == 0x0000A8, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_Select_Default) == 0x0000B0, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, K2Node_ComponentBoundEvent_Button) == 0x0000B8, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x0000C0, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLink_C_ExecuteUbergraph_FriendLink, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000148, "Member 'FriendLink_C_ExecuteUbergraph_FriendLink::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function FriendLink.FriendLink_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FriendLink_C_BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_826_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FriendLink.FriendLink_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FriendLink_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendLink_C_PreConstruct) == 0x000001, "Wrong alignment on FriendLink_C_PreConstruct");
static_assert(sizeof(FriendLink_C_PreConstruct) == 0x000001, "Wrong size on FriendLink_C_PreConstruct");
static_assert(offsetof(FriendLink_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FriendLink_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FriendLink.FriendLink_C.OnShareButtonTypeSet
// 0x0001 (0x0001 - 0x0000)
struct FriendLink_C_OnShareButtonTypeSet final
{
public:
	EShareButtonType                              Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendLink_C_OnShareButtonTypeSet) == 0x000001, "Wrong alignment on FriendLink_C_OnShareButtonTypeSet");
static_assert(sizeof(FriendLink_C_OnShareButtonTypeSet) == 0x000001, "Wrong size on FriendLink_C_OnShareButtonTypeSet");
static_assert(offsetof(FriendLink_C_OnShareButtonTypeSet, Type) == 0x000000, "Member 'FriendLink_C_OnShareButtonTypeSet::Type' has a wrong offset!");

// Function FriendLink.FriendLink_C.GetStartingShareText
// 0x0068 (0x0068 - 0x0000)
struct FriendLink_C_GetStartingShareText final
{
public:
	class FText                                   Button_Text;                                       // 0x0000(0x0018)(Parm, OutParm)
	EShareButtonType                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0038(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
};
static_assert(alignof(FriendLink_C_GetStartingShareText) == 0x000008, "Wrong alignment on FriendLink_C_GetStartingShareText");
static_assert(sizeof(FriendLink_C_GetStartingShareText) == 0x000068, "Wrong size on FriendLink_C_GetStartingShareText");
static_assert(offsetof(FriendLink_C_GetStartingShareText, Button_Text) == 0x000000, "Member 'FriendLink_C_GetStartingShareText::Button_Text' has a wrong offset!");
static_assert(offsetof(FriendLink_C_GetStartingShareText, Temp_byte_Variable) == 0x000018, "Member 'FriendLink_C_GetStartingShareText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FriendLink_C_GetStartingShareText, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'FriendLink_C_GetStartingShareText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendLink_C_GetStartingShareText, CallFunc_MakeLiteralText_ReturnValue1) == 0x000038, "Member 'FriendLink_C_GetStartingShareText::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(FriendLink_C_GetStartingShareText, K2Node_Select_Default) == 0x000050, "Member 'FriendLink_C_GetStartingShareText::K2Node_Select_Default' has a wrong offset!");

}

