#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendCodeList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendCodeList.FriendCodeList_C
// 0x0048 (0x03B8 - 0x0370)
class UFriendCodeList_C final : public UFortFriendCodeListBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                B_ClickBlocker;                                    // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_MainPanel;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Both;                                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Desc;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         EntryBody;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_0;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FriendCodeList(int32 EntryPoint);
	void BndEvt__both_K2Node_ComponentBoundEvent_54_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_23_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_69_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void CloseFriendCodeList();
	struct FEventReply On_B_ClickBlocker_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply On_Border_MainPanel_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendCodeList_C">();
	}
	static class UFriendCodeList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendCodeList_C>();
	}
};
static_assert(alignof(UFriendCodeList_C) == 0x000008, "Wrong alignment on UFriendCodeList_C");
static_assert(sizeof(UFriendCodeList_C) == 0x0003B8, "Wrong size on UFriendCodeList_C");
static_assert(offsetof(UFriendCodeList_C, UberGraphFrame) == 0x000370, "Member 'UFriendCodeList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, Intro) == 0x000378, "Member 'UFriendCodeList_C::Intro' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, B_ClickBlocker) == 0x000380, "Member 'UFriendCodeList_C::B_ClickBlocker' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, Border_MainPanel) == 0x000388, "Member 'UFriendCodeList_C::Border_MainPanel' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, Both) == 0x000390, "Member 'UFriendCodeList_C::Both' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, CloseButton) == 0x000398, "Member 'UFriendCodeList_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, Desc) == 0x0003A0, "Member 'UFriendCodeList_C::Desc' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, EntryBody) == 0x0003A8, "Member 'UFriendCodeList_C::EntryBody' has a wrong offset!");
static_assert(offsetof(UFriendCodeList_C, RichTextBlock_0) == 0x0003B0, "Member 'UFriendCodeList_C::RichTextBlock_0' has a wrong offset!");

}

