#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendLinkButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendLinkButton.FriendLinkButton_C
// 0x0018 (0x0B48 - 0x0B30)
class UFriendLinkButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InviteCodeMessage;                                 // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FriendLinkButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BP_OnClicked();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendLinkButton_C">();
	}
	static class UFriendLinkButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendLinkButton_C>();
	}
};
static_assert(alignof(UFriendLinkButton_C) == 0x000008, "Wrong alignment on UFriendLinkButton_C");
static_assert(sizeof(UFriendLinkButton_C) == 0x000B48, "Wrong size on UFriendLinkButton_C");
static_assert(offsetof(UFriendLinkButton_C, UberGraphFrame) == 0x000B30, "Member 'UFriendLinkButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFriendLinkButton_C, Image_0) == 0x000B38, "Member 'UFriendLinkButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UFriendLinkButton_C, InviteCodeMessage) == 0x000B40, "Member 'UFriendLinkButton_C::InviteCodeMessage' has a wrong offset!");

}

