#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Manage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Frontend_Manage.Frontend_Manage_C.ExecuteUbergraph_Frontend_Manage
// 0x02E0 (0x02E0 - 0x0000)
struct Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSensei1;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(bool IsSensei)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0xB];                                       // 0x0065(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue1;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_CustomEvent_IsSensei;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFrontend_Manage_Camera_C*              K2Node_DynamicCast_AsFrontend_Manage_Camera;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default;                             // 0x01F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue1;                       // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult1;     // 0x0250(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue1;        // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage) == 0x000010, "Wrong alignment on Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage");
static_assert(sizeof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage) == 0x0002E0, "Wrong size on Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, EntryPoint) == 0x000000, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::EntryPoint' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_CustomEvent_IsSensei1) == 0x000004, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_CustomEvent_IsSensei1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000050, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_CreateDelegate_OutputDelegate1) == 0x000054, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, Temp_bool_Variable) == 0x000064, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_GetTransform_ReturnValue1) == 0x000070, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_GetTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_TLerp_ReturnValue) == 0x0000A0, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000D0, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000158, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_GetTransform_ReturnValue2) == 0x000160, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_GetTransform_ReturnValue3) == 0x000190, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_GetAllActorsWithTag_OutActors) == 0x0001C0, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_CustomEvent_IsSensei) == 0x0001D0, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_CustomEvent_IsSensei' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_DynamicCast_AsFrontend_Manage_Camera) == 0x0001E0, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_DynamicCast_AsFrontend_Manage_Camera' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, K2Node_Select_Default) == 0x0001F0, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_TLerp_ReturnValue1) == 0x000220, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_TLerp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_K2_SetActorTransform_SweepHitResult1) == 0x000250, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_K2_SetActorTransform_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage, CallFunc_K2_SetActorTransform_ReturnValue1) == 0x0002D8, "Member 'Frontend_Manage_C_ExecuteUbergraph_Frontend_Manage::CallFunc_K2_SetActorTransform_ReturnValue1' has a wrong offset!");

// Function Frontend_Manage.Frontend_Manage_C.LerpCamera
// 0x0001 (0x0001 - 0x0000)
struct Frontend_Manage_C_LerpCamera final
{
public:
	bool                                          IsSensei;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Manage_C_LerpCamera) == 0x000001, "Wrong alignment on Frontend_Manage_C_LerpCamera");
static_assert(sizeof(Frontend_Manage_C_LerpCamera) == 0x000001, "Wrong size on Frontend_Manage_C_LerpCamera");
static_assert(offsetof(Frontend_Manage_C_LerpCamera, IsSensei) == 0x000000, "Member 'Frontend_Manage_C_LerpCamera::IsSensei' has a wrong offset!");

// Function Frontend_Manage.Frontend_Manage_C.ManageCameraSelected
// 0x0001 (0x0001 - 0x0000)
struct Frontend_Manage_C_ManageCameraSelected final
{
public:
	bool                                          IsSensei;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Manage_C_ManageCameraSelected) == 0x000001, "Wrong alignment on Frontend_Manage_C_ManageCameraSelected");
static_assert(sizeof(Frontend_Manage_C_ManageCameraSelected) == 0x000001, "Wrong size on Frontend_Manage_C_ManageCameraSelected");
static_assert(offsetof(Frontend_Manage_C_ManageCameraSelected, IsSensei) == 0x000000, "Member 'Frontend_Manage_C_ManageCameraSelected::IsSensei' has a wrong offset!");

}

