#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend

#include "Basic.hpp"


namespace SDK::Params
{

// Function Frontend.FrontEnd_C.ExecuteUbergraph_FrontEnd
// 0x0018 (0x0018 - 0x0000)
struct FrontEnd_C_ExecuteUbergraph_FrontEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBROnly_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEnd_C_ExecuteUbergraph_FrontEnd) == 0x000008, "Wrong alignment on FrontEnd_C_ExecuteUbergraph_FrontEnd");
static_assert(sizeof(FrontEnd_C_ExecuteUbergraph_FrontEnd) == 0x000018, "Wrong size on FrontEnd_C_ExecuteUbergraph_FrontEnd");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, EntryPoint) == 0x000000, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, CallFunc_IsBROnly_ReturnValue) == 0x000004, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::CallFunc_IsBROnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, CallFunc_IsMobileApp_ReturnValue) == 0x000010, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, CallFunc_BooleanOR_ReturnValue) == 0x000011, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Frontend.FrontEnd_C.PlaySpeech
// 0x0038 (0x0038 - 0x0000)
struct FrontEnd_C_PlaySpeech final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         SampleRate;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundWave*                             AssetFile;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEnd_C_PlaySpeech) == 0x000008, "Wrong alignment on FrontEnd_C_PlaySpeech");
static_assert(sizeof(FrontEnd_C_PlaySpeech) == 0x000038, "Wrong size on FrontEnd_C_PlaySpeech");
static_assert(offsetof(FrontEnd_C_PlaySpeech, Filename) == 0x000000, "Member 'FrontEnd_C_PlaySpeech::Filename' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_PlaySpeech, SampleRate) == 0x000010, "Member 'FrontEnd_C_PlaySpeech::SampleRate' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_PlaySpeech, AssetFile) == 0x000018, "Member 'FrontEnd_C_PlaySpeech::AssetFile' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_PlaySpeech, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'FrontEnd_C_PlaySpeech::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_PlaySpeech, K2Node_DynamicCast_AsFort_Player_Controller_Front_End) == 0x000028, "Member 'FrontEnd_C_PlaySpeech::K2Node_DynamicCast_AsFort_Player_Controller_Front_End' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_PlaySpeech, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'FrontEnd_C_PlaySpeech::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

