#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend.FrontEnd_C
// 0x0018 (0x0360 - 0x0348)
class AFrontEnd_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewLobby;                                          // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHBOnboardingFlow_C*                    HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontEnd(int32 EntryPoint);
	void OnMatchStarted();
	void ReceiveBeginPlay();
	void EnableTutorial();
	void PlaySpeech(const class FString& Filename, int32 SampleRate, class USoundWave* AssetFile);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_C">();
	}
	static class AFrontEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontEnd_C>();
	}
};
static_assert(alignof(AFrontEnd_C) == 0x000008, "Wrong alignment on AFrontEnd_C");
static_assert(sizeof(AFrontEnd_C) == 0x000360, "Wrong size on AFrontEnd_C");
static_assert(offsetof(AFrontEnd_C, UberGraphFrame) == 0x000348, "Member 'AFrontEnd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontEnd_C, NewLobby) == 0x000350, "Member 'AFrontEnd_C::NewLobby' has a wrong offset!");
static_assert(offsetof(AFrontEnd_C, HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty) == 0x000358, "Member 'AFrontEnd_C::HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty' has a wrong offset!");

}

