#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Manage_Camera

#include "Basic.hpp"


namespace SDK::Params
{

// Function Frontend_Manage_Camera.Frontend_Manage_Camera_C.CameraHasBeenSelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature final
{
public:
	bool                                          IsSensei;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature) == 0x000001, "Wrong alignment on Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature");
static_assert(sizeof(Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature) == 0x000001, "Wrong size on Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature");
static_assert(offsetof(Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature, IsSensei) == 0x000000, "Member 'Frontend_Manage_Camera_C_CameraHasBeenSelected__DelegateSignature::IsSensei' has a wrong offset!");

// Function Frontend_Manage_Camera.Frontend_Manage_Camera_C.ExecuteUbergraph_Frontend_Manage_Camera
// 0x0080 (0x0080 - 0x0000)
struct Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_FortniteManage_C*>           CallFunc_GetAllActorsOfClass_OutActors1;           // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_FortniteManage_C*                   CallFunc_Array_Get_Item1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_FortniteManage_C*>           CallFunc_GetAllActorsOfClass_OutActors2;           // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_FortniteManage_C*                   CallFunc_Array_Get_Item2;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsSensei;                       // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera) == 0x000008, "Wrong alignment on Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera");
static_assert(sizeof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera) == 0x000080, "Wrong size on Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, EntryPoint) == 0x000000, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::EntryPoint' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, Temp_int_Loop_Counter_Variable1) == 0x000008, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Add_IntInt_ReturnValue1) == 0x000010, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, Temp_int_Array_Index_Variable1) == 0x000018, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000030, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Array_Get_Item) == 0x000038, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_GetAllActorsOfClass_OutActors1) == 0x000040, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Array_Get_Item1) == 0x000050, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_GetAllActorsOfClass_OutActors2) == 0x000060, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Array_Get_Item2) == 0x000070, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Array_Length_ReturnValue1) == 0x000078, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, CallFunc_Less_IntInt_ReturnValue1) == 0x00007C, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera, K2Node_CustomEvent_IsSensei) == 0x00007D, "Member 'Frontend_Manage_Camera_C_ExecuteUbergraph_Frontend_Manage_Camera::K2Node_CustomEvent_IsSensei' has a wrong offset!");

// Function Frontend_Manage_Camera.Frontend_Manage_Camera_C.CameraSelected
// 0x0001 (0x0001 - 0x0000)
struct Frontend_Manage_Camera_C_CameraSelected final
{
public:
	bool                                          IsSensei;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_Manage_Camera_C_CameraSelected) == 0x000001, "Wrong alignment on Frontend_Manage_Camera_C_CameraSelected");
static_assert(sizeof(Frontend_Manage_Camera_C_CameraSelected) == 0x000001, "Wrong size on Frontend_Manage_Camera_C_CameraSelected");
static_assert(offsetof(Frontend_Manage_Camera_C_CameraSelected, IsSensei) == 0x000000, "Member 'Frontend_Manage_Camera_C_CameraSelected::IsSensei' has a wrong offset!");

}

