#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA__Festivus_Dance

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA__Festivus_Dance.GA__Festivus_Dance_C.ExecuteUbergraph_GA__Festivus_Dance
// 0x01D8 (0x01D8 - 0x0000)
struct GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x0028(0x0020)()
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0048(0x0040)(ContainsInstancedReference)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0088(0x0020)(ConstParm)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00C8(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue1;                // 0x0130(0x0040)(ContainsInstancedReference)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn1;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue1;   // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component1; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate1;             // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo1;     // 0x01B0(0x0020)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance) == 0x000008, "Wrong alignment on GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance");
static_assert(sizeof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance) == 0x0001D8, "Wrong size on GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, EntryPoint) == 0x000000, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x000008, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, Temp_struct_Variable) == 0x000028, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_GetActorInfo_ReturnValue) == 0x000048, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x000088, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_AsFort_Pawn) == 0x0000A8, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000B8, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_bSuccess1) == 0x0000C0, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000C8, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_IsValid_ReturnValue1) == 0x0000E8, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000F0, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000100, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_AsFort_AIPawn) == 0x000108, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_bSuccess2) == 0x000110, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000114, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000120, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_bSuccess3) == 0x000128, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_Event_bWasCancelled) == 0x000129, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_GetActorInfo_ReturnValue1) == 0x000130, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_GetActorInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_PlayAnimMontage_ReturnValue) == 0x000170, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_AsFort_Pawn1) == 0x000178, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_AsFort_Pawn1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_bSuccess4) == 0x000180, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_GetAbilitySystemComponent_ReturnValue1) == 0x000188, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_GetAbilitySystemComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_AsFort_Ability_System_Component1) == 0x000190, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_AsFort_Ability_System_Component1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_DynamicCast_bSuccess5) == 0x000198, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_CreateDelegate_OutputDelegate1) == 0x00019C, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, K2Node_CustomEvent_GameplayEffectRemovalInfo1) == 0x0001B0, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::K2Node_CustomEvent_GameplayEffectRemovalInfo1' has a wrong offset!");
static_assert(offsetof(GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001D0, "Member 'GA__Festivus_Dance_C_ExecuteUbergraph_GA__Festivus_Dance::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA__Festivus_Dance.GA__Festivus_Dance_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA__Festivus_Dance_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA__Festivus_Dance_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA__Festivus_Dance_C_K2_OnEndAbility");
static_assert(sizeof(GA__Festivus_Dance_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA__Festivus_Dance_C_K2_OnEndAbility");
static_assert(offsetof(GA__Festivus_Dance_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA__Festivus_Dance_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA__Festivus_Dance.GA__Festivus_Dance_C.InvalidHandle_420E3BBE40CCE8C5038779B176A3191D
// 0x0020 (0x0020 - 0x0000)
struct GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D) == 0x000008, "Wrong alignment on GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D");
static_assert(sizeof(GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D) == 0x000020, "Wrong size on GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D");
static_assert(offsetof(GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA__Festivus_Dance_C_InvalidHandle_420E3BBE40CCE8C5038779B176A3191D::GameplayEffectRemovalInfo' has a wrong offset!");

// Function GA__Festivus_Dance.GA__Festivus_Dance_C.OnRemoved_420E3BBE40CCE8C5038779B176A3191D
// 0x0020 (0x0020 - 0x0000)
struct GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D) == 0x000008, "Wrong alignment on GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D");
static_assert(sizeof(GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D) == 0x000020, "Wrong size on GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D");
static_assert(offsetof(GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D, GameplayEffectRemovalInfo) == 0x000000, "Member 'GA__Festivus_Dance_C_OnRemoved_420E3BBE40CCE8C5038779B176A3191D::GameplayEffectRemovalInfo' has a wrong offset!");

}

