#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_FerretVehicleWeapon

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_FerretVehicleWeapon.GA_FerretVehicleWeapon_C.ExecuteUbergraph_GA_FerretVehicleWeapon
// 0x0040 (0x0040 - 0x0000)
struct GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperatingTurret_ReturnValue;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon) == 0x000008, "Wrong alignment on GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon");
static_assert(sizeof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon) == 0x000040, "Wrong size on GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, EntryPoint) == 0x000000, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000018, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000030, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, K2Node_Event_bWasCancelled) == 0x000039, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, CallFunc_IsOperatingTurret_ReturnValue) == 0x00003A, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::CallFunc_IsOperatingTurret_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, CallFunc_IsValid_ReturnValue1) == 0x00003B, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon, CallFunc_IsValid_ReturnValue2) == 0x00003C, "Member 'GA_FerretVehicleWeapon_C_ExecuteUbergraph_GA_FerretVehicleWeapon::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GA_FerretVehicleWeapon.GA_FerretVehicleWeapon_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_FerretVehicleWeapon_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_FerretVehicleWeapon_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_FerretVehicleWeapon_C_K2_OnEndAbility");
static_assert(sizeof(GA_FerretVehicleWeapon_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_FerretVehicleWeapon_C_K2_OnEndAbility");
static_assert(offsetof(GA_FerretVehicleWeapon_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_FerretVehicleWeapon_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

