#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Generic_BotTurretShoot

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Generic_BotTurretShoot.GA_Generic_BotTurretShoot_C
// 0x0018 (0x0950 - 0x0938)
class UGA_Generic_BotTurretShoot_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_None;                                            // 0x0940(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_RangeUpgrade1;                                   // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Generic_BotTurretShoot(int32 EntryPoint);
	void K2_ActivateAbility();
	void Targeted_A37C36084B41A1B49DD946A52CACDE45(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_A37C36084B41A1B49DD946A52CACDE45(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void GetRangeTag(struct FGameplayTag* TargetTag);

	struct FTransform GetCustomAbilitySourceTransform() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Generic_BotTurretShoot_C">();
	}
	static class UGA_Generic_BotTurretShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Generic_BotTurretShoot_C>();
	}
};
static_assert(alignof(UGA_Generic_BotTurretShoot_C) == 0x000008, "Wrong alignment on UGA_Generic_BotTurretShoot_C");
static_assert(sizeof(UGA_Generic_BotTurretShoot_C) == 0x000950, "Wrong size on UGA_Generic_BotTurretShoot_C");
static_assert(offsetof(UGA_Generic_BotTurretShoot_C, UberGraphFrame) == 0x000938, "Member 'UGA_Generic_BotTurretShoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Generic_BotTurretShoot_C, T_None) == 0x000940, "Member 'UGA_Generic_BotTurretShoot_C::T_None' has a wrong offset!");
static_assert(offsetof(UGA_Generic_BotTurretShoot_C, T_RangeUpgrade1) == 0x000948, "Member 'UGA_Generic_BotTurretShoot_C::T_RangeUpgrade1' has a wrong offset!");

}

