#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GenericConsume

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_GenericConsume.GA_GenericConsume_C.ExecuteUbergraph_GA_GenericConsume
// 0x0128 (0x0128 - 0x0000)
struct GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData1;                    // 0x0020(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag1;                // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0048(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable1;                             // 0x0088(0x0020)()
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActorConsumable*       K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Consumable; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x00C0(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOnConsumeGameplayEffectSpec_ReturnValue; // 0x00E8(0x0010)()
	class UAnimMontage*                           CallFunc_GetOnConsumeMontage_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume) == 0x000008, "Wrong alignment on GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume");
static_assert(sizeof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume) == 0x000128, "Wrong size on GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, EntryPoint) == 0x000000, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000004, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CustomEvent_TargetData1) == 0x000020, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CustomEvent_TargetData1' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CustomEvent_ApplicationTag1) == 0x000040, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CustomEvent_ApplicationTag1' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CustomEvent_TargetData) == 0x000048, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CustomEvent_ApplicationTag) == 0x000068, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CreateDelegate_OutputDelegate1) == 0x000070, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, Temp_struct_Variable) == 0x000080, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, Temp_struct_Variable1) == 0x000088, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x0000A8, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Consumable) == 0x0000B0, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Consumable' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CustomEvent_TargetData2) == 0x0000C0, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CustomEvent_ApplicationTag2) == 0x0000E0, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_MakeOnConsumeGameplayEffectSpec_ReturnValue) == 0x0000E8, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_MakeOnConsumeGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_GetOnConsumeMontage_ReturnValue) == 0x0000F8, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_GetOnConsumeMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, K2Node_CreateDelegate_OutputDelegate2) == 0x000104, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x000118, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume, CallFunc_IsValid_ReturnValue1) == 0x000120, "Member 'GA_GenericConsume_C_ExecuteUbergraph_GA_GenericConsume::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function GA_GenericConsume.GA_GenericConsume_C.Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED
// 0x0028 (0x0028 - 0x0000)
struct GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED) == 0x000008, "Wrong alignment on GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED");
static_assert(sizeof(GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED) == 0x000028, "Wrong size on GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED");
static_assert(offsetof(GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED, TargetData) == 0x000000, "Member 'GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED::TargetData' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED, ApplicationTag) == 0x000020, "Member 'GA_GenericConsume_C_Cancelled_4BF174EF4ED7A4C301F86F8B87D7E4ED::ApplicationTag' has a wrong offset!");

// Function GA_GenericConsume.GA_GenericConsume_C.Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED
// 0x0028 (0x0028 - 0x0000)
struct GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED) == 0x000008, "Wrong alignment on GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED");
static_assert(sizeof(GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED) == 0x000028, "Wrong size on GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED");
static_assert(offsetof(GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED, TargetData) == 0x000000, "Member 'GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED::TargetData' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED, ApplicationTag) == 0x000020, "Member 'GA_GenericConsume_C_Completed_4BF174EF4ED7A4C301F86F8B87D7E4ED::ApplicationTag' has a wrong offset!");

// Function GA_GenericConsume.GA_GenericConsume_C.OnGenericNotifyFromAnimation
// 0x0010 (0x0010 - 0x0000)
struct GA_GenericConsume_C_OnGenericNotifyFromAnimation final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GenericConsume_C_OnGenericNotifyFromAnimation) == 0x000004, "Wrong alignment on GA_GenericConsume_C_OnGenericNotifyFromAnimation");
static_assert(sizeof(GA_GenericConsume_C_OnGenericNotifyFromAnimation) == 0x000010, "Wrong size on GA_GenericConsume_C_OnGenericNotifyFromAnimation");
static_assert(offsetof(GA_GenericConsume_C_OnGenericNotifyFromAnimation, NotifyTag) == 0x000000, "Member 'GA_GenericConsume_C_OnGenericNotifyFromAnimation::NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_OnGenericNotifyFromAnimation, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x000008, "Member 'GA_GenericConsume_C_OnGenericNotifyFromAnimation::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");

// Function GA_GenericConsume.GA_GenericConsume_C.Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED
// 0x0028 (0x0028 - 0x0000)
struct GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED) == 0x000008, "Wrong alignment on GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED");
static_assert(sizeof(GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED) == 0x000028, "Wrong size on GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED");
static_assert(offsetof(GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED, TargetData) == 0x000000, "Member 'GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED::TargetData' has a wrong offset!");
static_assert(offsetof(GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED, ApplicationTag) == 0x000020, "Member 'GA_GenericConsume_C_Triggered_4BF174EF4ED7A4C301F86F8B87D7E4ED::ApplicationTag' has a wrong offset!");

}

