#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Perk_H_FeelTheBASE_DeathListener

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_GenericTriggeredAbility_Perk_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Perk_H_FeelTheBASE_DeathListener.GA_Perk_H_FeelTheBASE_DeathListener_C
// 0x0040 (0x0AB0 - 0x0A70)
class UGA_Perk_H_FeelTheBASE_DeathListener_C final : public UGAT_GenericTriggeredAbility_Perk_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Perk_H_FeelTheBASE_DeathListener_C; // 0x0A70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  TC_Overflow;                                       // 0x0A78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 StackCount;                                        // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack1;                                            // 0x0AA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack2;                                            // 0x0AA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack3;                                            // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Perk_H_FeelTheBASE_DeathListener(int32 EntryPoint);
	void ExecuteGC(class AB_Perk_C_Constructor_BASE_C* BaseReference, bool* Overflow);
	void ActivateBaseStacks(int32 Stack_Count, class AB_Perk_C_Constructor_BASE_C* BaseReference);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& Param_EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Perk_H_FeelTheBASE_DeathListener_C">();
	}
	static class UGA_Perk_H_FeelTheBASE_DeathListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Perk_H_FeelTheBASE_DeathListener_C>();
	}
};
static_assert(alignof(UGA_Perk_H_FeelTheBASE_DeathListener_C) == 0x000008, "Wrong alignment on UGA_Perk_H_FeelTheBASE_DeathListener_C");
static_assert(sizeof(UGA_Perk_H_FeelTheBASE_DeathListener_C) == 0x000AB0, "Wrong size on UGA_Perk_H_FeelTheBASE_DeathListener_C");
static_assert(offsetof(UGA_Perk_H_FeelTheBASE_DeathListener_C, UberGraphFrame_GA_Perk_H_FeelTheBASE_DeathListener_C) == 0x000A70, "Member 'UGA_Perk_H_FeelTheBASE_DeathListener_C::UberGraphFrame_GA_Perk_H_FeelTheBASE_DeathListener_C' has a wrong offset!");
static_assert(offsetof(UGA_Perk_H_FeelTheBASE_DeathListener_C, TC_Overflow) == 0x000A78, "Member 'UGA_Perk_H_FeelTheBASE_DeathListener_C::TC_Overflow' has a wrong offset!");
static_assert(offsetof(UGA_Perk_H_FeelTheBASE_DeathListener_C, StackCount) == 0x000A98, "Member 'UGA_Perk_H_FeelTheBASE_DeathListener_C::StackCount' has a wrong offset!");
static_assert(offsetof(UGA_Perk_H_FeelTheBASE_DeathListener_C, Stack1) == 0x000AA0, "Member 'UGA_Perk_H_FeelTheBASE_DeathListener_C::Stack1' has a wrong offset!");
static_assert(offsetof(UGA_Perk_H_FeelTheBASE_DeathListener_C, Stack2) == 0x000AA4, "Member 'UGA_Perk_H_FeelTheBASE_DeathListener_C::Stack2' has a wrong offset!");
static_assert(offsetof(UGA_Perk_H_FeelTheBASE_DeathListener_C, Stack3) == 0x000AA8, "Member 'UGA_Perk_H_FeelTheBASE_DeathListener_C::Stack3' has a wrong offset!");

}

