#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpookyMist_PassiveSetup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C
// 0x00E8 (0x0A20 - 0x0938)
class UGA_SpookyMist_PassiveSetup_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            LoopingGC;                                         // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GC_TrailFX;                                        // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GC_Looping;                                        // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            MoveSpeedBuff;                                     // 0x0960(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         AbilityDuration;                                   // 0x0968(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DamageShouldEndAbility;                            // 0x0988(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_MoveSpeed;                                      // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ExitRecovery;                                      // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  AllowInteractTags;                                 // 0x09B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  NoInteractTags;                                    // 0x09D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ShouldAllowInteract;                               // 0x09F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ForcedExit;                                        // 0x0A18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_SpookyMist_PassiveSetup(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void On_DBNO();
	void WhenDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void K2_ActivateAbility();
	void EventReceived_3CB208084D361EC6BA9A619CA44CFB21(const struct FGameplayEventData& Payload);
	void SetBlockAbilityTags();
	void UnBlockAbilityTags();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SpookyMist_PassiveSetup_C">();
	}
	static class UGA_SpookyMist_PassiveSetup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SpookyMist_PassiveSetup_C>();
	}
};
static_assert(alignof(UGA_SpookyMist_PassiveSetup_C) == 0x000008, "Wrong alignment on UGA_SpookyMist_PassiveSetup_C");
static_assert(sizeof(UGA_SpookyMist_PassiveSetup_C) == 0x000A20, "Wrong size on UGA_SpookyMist_PassiveSetup_C");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, UberGraphFrame) == 0x000938, "Member 'UGA_SpookyMist_PassiveSetup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, PlayerPawn) == 0x000940, "Member 'UGA_SpookyMist_PassiveSetup_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, LoopingGC) == 0x000948, "Member 'UGA_SpookyMist_PassiveSetup_C::LoopingGC' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, GC_TrailFX) == 0x000950, "Member 'UGA_SpookyMist_PassiveSetup_C::GC_TrailFX' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, GC_Looping) == 0x000958, "Member 'UGA_SpookyMist_PassiveSetup_C::GC_Looping' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, MoveSpeedBuff) == 0x000960, "Member 'UGA_SpookyMist_PassiveSetup_C::MoveSpeedBuff' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, AbilityDuration) == 0x000968, "Member 'UGA_SpookyMist_PassiveSetup_C::AbilityDuration' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, DamageShouldEndAbility) == 0x000988, "Member 'UGA_SpookyMist_PassiveSetup_C::DamageShouldEndAbility' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, GE_MoveSpeed) == 0x0009A8, "Member 'UGA_SpookyMist_PassiveSetup_C::GE_MoveSpeed' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, ExitRecovery) == 0x0009B0, "Member 'UGA_SpookyMist_PassiveSetup_C::ExitRecovery' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, AllowInteractTags) == 0x0009B8, "Member 'UGA_SpookyMist_PassiveSetup_C::AllowInteractTags' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, NoInteractTags) == 0x0009D8, "Member 'UGA_SpookyMist_PassiveSetup_C::NoInteractTags' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, ShouldAllowInteract) == 0x0009F8, "Member 'UGA_SpookyMist_PassiveSetup_C::ShouldAllowInteract' has a wrong offset!");
static_assert(offsetof(UGA_SpookyMist_PassiveSetup_C, ForcedExit) == 0x000A18, "Member 'UGA_SpookyMist_PassiveSetup_C::ForcedExit' has a wrong offset!");

}

