#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SiphonEffect_OnKillGrant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_GM_OnDmgDealt_LifeSteal_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SiphonEffect_OnKillGrant.GA_SiphonEffect_OnKillGrant_C
// 0x00A8 (0x0A20 - 0x0978)
class UGA_SiphonEffect_OnKillGrant_C final : public UGA_GM_OnDmgDealt_LifeSteal_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_SiphonEffect_OnKillGrant_C;      // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 HealGE;                                            // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ShieldGE;                                          // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Target;                                            // 0x0990(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        Eliminator;                                        // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Increment;                                         // 0x09B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickRate;                                          // 0x09BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTicks;                                          // 0x09C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4[0x4];                                      // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle;                                       // 0x09C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TickHealGE;                                        // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TickShieldGE;                                      // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthToHeal;                                      // 0x09E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthToShield;                                    // 0x09E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmountToHeal;                                      // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WoodToGive;                                        // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StoneToGive;                                       // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MetalToGive;                                       // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldGrantMatsOnKill;                             // 0x09F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F9[0x7];                                      // 0x09F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Blade_Wielder_Tag;                                 // 0x0A00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_SiphonEffect_OnKillGrant(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SiphonEffect_OnKillGrant_C">();
	}
	static class UGA_SiphonEffect_OnKillGrant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SiphonEffect_OnKillGrant_C>();
	}
};
static_assert(alignof(UGA_SiphonEffect_OnKillGrant_C) == 0x000008, "Wrong alignment on UGA_SiphonEffect_OnKillGrant_C");
static_assert(sizeof(UGA_SiphonEffect_OnKillGrant_C) == 0x000A20, "Wrong size on UGA_SiphonEffect_OnKillGrant_C");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, UberGraphFrame_GA_SiphonEffect_OnKillGrant_C) == 0x000978, "Member 'UGA_SiphonEffect_OnKillGrant_C::UberGraphFrame_GA_SiphonEffect_OnKillGrant_C' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealGE) == 0x000980, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, ShieldGE) == 0x000988, "Member 'UGA_SiphonEffect_OnKillGrant_C::ShieldGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Target) == 0x000990, "Member 'UGA_SiphonEffect_OnKillGrant_C::Target' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Eliminator) == 0x0009B0, "Member 'UGA_SiphonEffect_OnKillGrant_C::Eliminator' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Increment) == 0x0009B8, "Member 'UGA_SiphonEffect_OnKillGrant_C::Increment' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TickRate) == 0x0009BC, "Member 'UGA_SiphonEffect_OnKillGrant_C::TickRate' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, MaxTicks) == 0x0009C0, "Member 'UGA_SiphonEffect_OnKillGrant_C::MaxTicks' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TimerHandle) == 0x0009C8, "Member 'UGA_SiphonEffect_OnKillGrant_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TickHealGE) == 0x0009D0, "Member 'UGA_SiphonEffect_OnKillGrant_C::TickHealGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TickShieldGE) == 0x0009D8, "Member 'UGA_SiphonEffect_OnKillGrant_C::TickShieldGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthToHeal) == 0x0009E0, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthToHeal' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthToShield) == 0x0009E4, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthToShield' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, AmountToHeal) == 0x0009E8, "Member 'UGA_SiphonEffect_OnKillGrant_C::AmountToHeal' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, WoodToGive) == 0x0009EC, "Member 'UGA_SiphonEffect_OnKillGrant_C::WoodToGive' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, StoneToGive) == 0x0009F0, "Member 'UGA_SiphonEffect_OnKillGrant_C::StoneToGive' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, MetalToGive) == 0x0009F4, "Member 'UGA_SiphonEffect_OnKillGrant_C::MetalToGive' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, ShouldGrantMatsOnKill) == 0x0009F8, "Member 'UGA_SiphonEffect_OnKillGrant_C::ShouldGrantMatsOnKill' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Blade_Wielder_Tag) == 0x000A00, "Member 'UGA_SiphonEffect_OnKillGrant_C::Blade_Wielder_Tag' has a wrong offset!");

}

