#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpookyMist_PassiveSetup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C.ExecuteUbergraph_GA_SpookyMist_PassiveSetup
// 0x02E8 (0x02E8 - 0x0000)
struct GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0008(0x00A8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00B0(0x00A8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue1; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x01C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01D0(0x00A8)()
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue1;             // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate2;             // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1; // 0x02DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup) == 0x000008, "Wrong alignment on GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup");
static_assert(sizeof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup) == 0x0002E8, "Wrong size on GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, EntryPoint) == 0x000000, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_MakeStruct_GameplayEventData) == 0x000008, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, Temp_struct_Variable) == 0x0000B0, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000158, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CreateDelegate_OutputDelegate) == 0x000160, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CreateDelegate_OutputDelegate1) == 0x000174, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000188, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_IsValid_ReturnValue1) == 0x000190, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000198, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_DynamicCast_AsFort_Player_Controller_Gameplay) == 0x0001A0, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_DynamicCast_AsFort_Player_Controller_Gameplay' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_GetAvatarActorFromActorInfo_ReturnValue1) == 0x0001B0, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_GetAvatarActorFromActorInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0001B8, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_DynamicCast_bSuccess1) == 0x0001C0, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0001C4, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_GetValueAtLevel_ReturnValue) == 0x0001CC, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_Payload) == 0x0001D0, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_DamagedActor) == 0x000278, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_Damage) == 0x000280, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_InstigatedBy) == 0x000288, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_DamageCauser) == 0x000290, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_HitLocation) == 0x000298, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_FHitComponent) == 0x0002A8, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_BoneName) == 0x0002B0, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CustomEvent_Momentum) == 0x0002B8, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_GetValueAtLevel_ReturnValue1) == 0x0002C4, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_GetValueAtLevel_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_CreateDelegate_OutputDelegate2) == 0x0002C8, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002D8, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1) == 0x0002DC, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup, K2Node_Event_bWasCancelled) == 0x0002E4, "Member 'GA_SpookyMist_PassiveSetup_C_ExecuteUbergraph_GA_SpookyMist_PassiveSetup::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility");
static_assert(sizeof(GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SpookyMist_PassiveSetup_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C.WhenDamaged
// 0x0050 (0x0050 - 0x0000)
struct GA_SpookyMist_PassiveSetup_C_WhenDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SpookyMist_PassiveSetup_C_WhenDamaged) == 0x000008, "Wrong alignment on GA_SpookyMist_PassiveSetup_C_WhenDamaged");
static_assert(sizeof(GA_SpookyMist_PassiveSetup_C_WhenDamaged) == 0x000050, "Wrong size on GA_SpookyMist_PassiveSetup_C_WhenDamaged");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, DamagedActor) == 0x000000, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, Damage) == 0x000008, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::Damage' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, InstigatedBy) == 0x000010, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, DamageCauser) == 0x000018, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, HitLocation) == 0x000020, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::HitLocation' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, FHitComponent) == 0x000030, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, BoneName) == 0x000038, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::BoneName' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_WhenDamaged, Momentum) == 0x000040, "Member 'GA_SpookyMist_PassiveSetup_C_WhenDamaged::Momentum' has a wrong offset!");

// Function GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C.EventReceived_3CB208084D361EC6BA9A619CA44CFB21
// 0x00A8 (0x00A8 - 0x0000)
struct GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21) == 0x000008, "Wrong alignment on GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21");
static_assert(sizeof(GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21) == 0x0000A8, "Wrong size on GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21, Payload) == 0x000000, "Member 'GA_SpookyMist_PassiveSetup_C_EventReceived_3CB208084D361EC6BA9A619CA44CFB21::Payload' has a wrong offset!");

// Function GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C.SetBlockAbilityTags
// 0x0068 (0x0068 - 0x0000)
struct GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags) == 0x000008, "Wrong alignment on GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags");
static_assert(sizeof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags) == 0x000068, "Wrong size on GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000048, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000058, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GA_SpookyMist_PassiveSetup_C_SetBlockAbilityTags::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_SpookyMist_PassiveSetup.GA_SpookyMist_PassiveSetup_C.UnBlockAbilityTags
// 0x0068 (0x0068 - 0x0000)
struct GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags) == 0x000008, "Wrong alignment on GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags");
static_assert(sizeof(GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags) == 0x000068, "Wrong size on GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'GA_SpookyMist_PassiveSetup_C_UnBlockAbilityTags::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
