#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TrapGeneric

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TrapGeneric.GA_TrapGeneric_C
// 0x0030 (0x0968 - 0x0938)
class UGA_TrapGeneric_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABuildingTrap*                          CeilingTrap;                                       // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CachedDamageTargets;                               // 0x0948(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         TargetArray;                                       // 0x0958(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_TrapGeneric(int32 EntryPoint);
	void Cancelled_EFEC611E4D988CAA3867F28EE35771B3(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void K2_ActivateAbility();
	void Targeted_EFEC611E4D988CAA3867F28EE35771B3(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TrapGeneric_C">();
	}
	static class UGA_TrapGeneric_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TrapGeneric_C>();
	}
};
static_assert(alignof(UGA_TrapGeneric_C) == 0x000008, "Wrong alignment on UGA_TrapGeneric_C");
static_assert(sizeof(UGA_TrapGeneric_C) == 0x000968, "Wrong size on UGA_TrapGeneric_C");
static_assert(offsetof(UGA_TrapGeneric_C, UberGraphFrame) == 0x000938, "Member 'UGA_TrapGeneric_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TrapGeneric_C, CeilingTrap) == 0x000940, "Member 'UGA_TrapGeneric_C::CeilingTrap' has a wrong offset!");
static_assert(offsetof(UGA_TrapGeneric_C, CachedDamageTargets) == 0x000948, "Member 'UGA_TrapGeneric_C::CachedDamageTargets' has a wrong offset!");
static_assert(offsetof(UGA_TrapGeneric_C, TargetArray) == 0x000958, "Member 'UGA_TrapGeneric_C::TargetArray' has a wrong offset!");

}

