#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurfaceChange

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GAB_SurfaceChange.GAB_SurfaceChange_C.ExecuteUbergraph_GAB_SurfaceChange
// 0x00C0 (0x00C0 - 0x0000)
struct GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00A8)(ConstParm)
	bool                                          GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue1;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange) == 0x000008, "Wrong alignment on GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange");
static_assert(sizeof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange) == 0x0000C0, "Wrong size on GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange");
static_assert(offsetof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange, EntryPoint) == 0x000000, "Member 'GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange, K2Node_Event_EventData) == 0x000010, "Member 'GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange, GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess) == 0x0000B8, "Member 'GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange::GameplayTagsK2Node_SwitchGameplayTagContainer_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange, CallFunc_GetValueAtLevel_ReturnValue1) == 0x0000BC, "Member 'GAB_SurfaceChange_C_ExecuteUbergraph_GAB_SurfaceChange::CallFunc_GetValueAtLevel_ReturnValue1' has a wrong offset!");

// Function GAB_SurfaceChange.GAB_SurfaceChange_C.K2_ActivateAbilityFromEvent
// 0x00A8 (0x00A8 - 0x0000)
struct GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent) == 0x0000A8, "Wrong size on GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GAB_SurfaceChange_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GAB_SurfaceChange.GAB_SurfaceChange_C.HotfixableGEApplication
// 0x0048 (0x0048 - 0x0000)
struct GAB_SurfaceChange_C_HotfixableGEApplication final
{
public:
	struct FScalableFloat                         Input;                                             // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UClass*                                 GameplayEffectAppliedOnTrue;                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GameplayEffectAppliedOnFalse;                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_SurfaceChange_C_HotfixableGEApplication) == 0x000008, "Wrong alignment on GAB_SurfaceChange_C_HotfixableGEApplication");
static_assert(sizeof(GAB_SurfaceChange_C_HotfixableGEApplication) == 0x000048, "Wrong size on GAB_SurfaceChange_C_HotfixableGEApplication");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, Input) == 0x000000, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::Input' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, GameplayEffectAppliedOnTrue) == 0x000020, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::GameplayEffectAppliedOnTrue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, GameplayEffectAppliedOnFalse) == 0x000028, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::GameplayEffectAppliedOnFalse' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, CallFunc_GetValueAtLevel_ReturnValue) == 0x000030, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000034, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_SurfaceChange_C_HotfixableGEApplication, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1) == 0x000040, "Member 'GAB_SurfaceChange_C_HotfixableGEApplication::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue1' has a wrong offset!");

}

