#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Hunting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GAB_Hunting.GAB_Hunting_C.ExecuteUbergraph_GAB_Hunting
// 0x01F8 (0x01F8 - 0x0000)
struct GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, const struct FAIStimulus& Stimulus)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UAIPerceptionComponent*                 CallFunc_GetAIPerceptionComponent_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_MoveAI*                CallFunc_CreateMoveAITask_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue1;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetGoalActor_ReturnValue1;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIController*                      K2Node_DynamicCast_AsFort_AIController1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_CustomEvent_Stimulus;                       // 0x00F8(0x003C)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue1;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIPerceptionComponent*                 CallFunc_GetAIPerceptionComponent_ReturnValue1;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue3;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateDistanceData_MinValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateDistanceData_MaxValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateDistanceData_HasValidData;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdatePositionData_MaxDistance;           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdatePositionData_HasValidData;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate5;             // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting) == 0x000008, "Wrong alignment on GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting");
static_assert(sizeof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting) == 0x0001F8, "Wrong size on GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, EntryPoint) == 0x000000, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CustomEvent_Result) == 0x000004, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CustomEvent_AIController) == 0x000008, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetGoalActor_ReturnValue) == 0x000020, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetGoalActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetAIPerceptionComponent_ReturnValue) == 0x000038, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetAIPerceptionComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_Event_bWasCancelled) == 0x000040, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CustomEvent_QueryInstance) == 0x000048, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CustomEvent_QueryStatus) == 0x000050, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate2) == 0x000054, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x000068, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x000078, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_Array_Get_Item) == 0x00007C, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetActivatingPawn_ReturnValue) == 0x000088, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_CreateMoveAITask_ReturnValue) == 0x000090, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_CreateMoveAITask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_RunEQSQuery_ReturnValue) == 0x000098, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetActivatingPawn_ReturnValue1) == 0x0000A8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetActivatingPawn_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetController_ReturnValue) == 0x0000B0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetActivatingPawn_ReturnValue2) == 0x0000B8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetActivatingPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_DynamicCast_AsFort_AIController) == 0x0000C0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_DynamicCast_AsFort_AIController' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetController_ReturnValue1) == 0x0000D0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetGoalActor_ReturnValue1) == 0x0000D8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetGoalActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_DynamicCast_AsFort_AIController1) == 0x0000E0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_DynamicCast_AsFort_AIController1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_DynamicCast_bSuccess1) == 0x0000E8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CustomEvent_Actor) == 0x0000F0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CustomEvent_Stimulus) == 0x0000F8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CustomEvent_Stimulus' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000134, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetTimeSeconds_ReturnValue) == 0x000138, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetTimeSeconds_ReturnValue1) == 0x00013C, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetTimeSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_Add_FloatFloat_ReturnValue) == 0x000140, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000144, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_IsValid_ReturnValue1) == 0x000145, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetAIPerceptionComponent_ReturnValue1) == 0x000148, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetAIPerceptionComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_IsValid_ReturnValue2) == 0x000150, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_IsValid_ReturnValue3) == 0x000151, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate3) == 0x000154, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_GetActivatingPawn_ReturnValue3) == 0x000168, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_GetActivatingPawn_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00017C, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000188, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_VSize_ReturnValue) == 0x000194, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_UpdateDistanceData_MinValue) == 0x000198, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_UpdateDistanceData_MinValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_UpdateDistanceData_MaxValue) == 0x00019C, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_UpdateDistanceData_MaxValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_UpdateDistanceData_HasValidData) == 0x0001A0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_UpdateDistanceData_HasValidData' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_UpdatePositionData_MaxDistance) == 0x0001A4, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_UpdatePositionData_MaxDistance' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_UpdatePositionData_HasValidData) == 0x0001A8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_UpdatePositionData_HasValidData' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001AC, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate4) == 0x0001B0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001C0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x0001C1, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_BooleanOR_ReturnValue) == 0x0001C2, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_BooleanAND_ReturnValue) == 0x0001C3, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_K2_SetTimer_ReturnValue) == 0x0001C8, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, CallFunc_BooleanOR_ReturnValue1) == 0x0001D0, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate5) == 0x0001D4, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting, K2Node_CreateDelegate_OutputDelegate6) == 0x0001E4, "Member 'GAB_Hunting_C_ExecuteUbergraph_GAB_Hunting::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");

// Function GAB_Hunting.GAB_Hunting_C.OnTargetPerceptionUpdated_Event_0
// 0x0048 (0x0048 - 0x0000)
struct GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0 final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0) == 0x000008, "Wrong alignment on GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0");
static_assert(sizeof(GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0) == 0x000048, "Wrong size on GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0");
static_assert(offsetof(GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0, Actor) == 0x000000, "Member 'GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0::Actor' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0, Stimulus) == 0x000008, "Member 'GAB_Hunting_C_OnTargetPerceptionUpdated_Event_0::Stimulus' has a wrong offset!");

// Function GAB_Hunting.GAB_Hunting_C.OnHuntingQueryFinished
// 0x0010 (0x0010 - 0x0000)
struct GAB_Hunting_C_OnHuntingQueryFinished final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Hunting_C_OnHuntingQueryFinished) == 0x000008, "Wrong alignment on GAB_Hunting_C_OnHuntingQueryFinished");
static_assert(sizeof(GAB_Hunting_C_OnHuntingQueryFinished) == 0x000010, "Wrong size on GAB_Hunting_C_OnHuntingQueryFinished");
static_assert(offsetof(GAB_Hunting_C_OnHuntingQueryFinished, QueryInstance) == 0x000000, "Member 'GAB_Hunting_C_OnHuntingQueryFinished::QueryInstance' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_OnHuntingQueryFinished, QueryStatus) == 0x000008, "Member 'GAB_Hunting_C_OnHuntingQueryFinished::QueryStatus' has a wrong offset!");

// Function GAB_Hunting.GAB_Hunting_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GAB_Hunting_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_Hunting_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GAB_Hunting_C_K2_OnEndAbility");
static_assert(sizeof(GAB_Hunting_C_K2_OnEndAbility) == 0x000001, "Wrong size on GAB_Hunting_C_K2_OnEndAbility");
static_assert(offsetof(GAB_Hunting_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GAB_Hunting_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GAB_Hunting.GAB_Hunting_C.OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD
// 0x0010 (0x0010 - 0x0000)
struct GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          AIController;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD) == 0x000008, "Wrong alignment on GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD");
static_assert(sizeof(GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD) == 0x000010, "Wrong size on GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD");
static_assert(offsetof(GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD, Result) == 0x000000, "Member 'GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD::Result' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD, AIController) == 0x000008, "Member 'GAB_Hunting_C_OnMoveFinished_1139C33842819C6E767F7AA892C4E6BD::AIController' has a wrong offset!");

// Function GAB_Hunting.GAB_Hunting_C.UpdateDistanceData
// 0x0058 (0x0058 - 0x0000)
struct GAB_Hunting_C_UpdateDistanceData final
{
public:
	TArray<float>                                 DistArray;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	float                                         NewDistance;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue;                                          // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasValidData;                                      // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxValueInArray;                                   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValueInArray;                                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAB_Hunting_C_UpdateDistanceData) == 0x000008, "Wrong alignment on GAB_Hunting_C_UpdateDistanceData");
static_assert(sizeof(GAB_Hunting_C_UpdateDistanceData) == 0x000058, "Wrong size on GAB_Hunting_C_UpdateDistanceData");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, DistArray) == 0x000000, "Member 'GAB_Hunting_C_UpdateDistanceData::DistArray' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, NewDistance) == 0x000010, "Member 'GAB_Hunting_C_UpdateDistanceData::NewDistance' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, MinValue) == 0x000014, "Member 'GAB_Hunting_C_UpdateDistanceData::MinValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, MaxValue) == 0x000018, "Member 'GAB_Hunting_C_UpdateDistanceData::MaxValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, HasValidData) == 0x00001C, "Member 'GAB_Hunting_C_UpdateDistanceData::HasValidData' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, MaxValueInArray) == 0x000020, "Member 'GAB_Hunting_C_UpdateDistanceData::MaxValueInArray' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, MinValueInArray) == 0x000024, "Member 'GAB_Hunting_C_UpdateDistanceData::MinValueInArray' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GAB_Hunting_C_UpdateDistanceData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Array_Get_Item) == 0x00002C, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_FMin_ReturnValue) == 0x000034, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'GAB_Hunting_C_UpdateDistanceData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Array_Length_ReturnValue1) == 0x000040, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Array_Length_ReturnValue2) == 0x000050, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdateDistanceData, CallFunc_Greater_IntInt_ReturnValue1) == 0x000054, "Member 'GAB_Hunting_C_UpdateDistanceData::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");

// Function GAB_Hunting.GAB_Hunting_C.UpdatePositionData
// 0x0080 (0x0080 - 0x0000)
struct GAB_Hunting_C_UpdatePositionData final
{
public:
	TArray<struct FVector>                        PosArray;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	struct FVector                                NewPosition;                                       // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistance;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasValidData;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxValue;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item1;                          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAB_Hunting_C_UpdatePositionData) == 0x000008, "Wrong alignment on GAB_Hunting_C_UpdatePositionData");
static_assert(sizeof(GAB_Hunting_C_UpdatePositionData) == 0x000080, "Wrong size on GAB_Hunting_C_UpdatePositionData");
static_assert(offsetof(GAB_Hunting_C_UpdatePositionData, PosArray) == 0x000000, "Member 'GAB_Hunting_C_UpdatePositionData::PosArray' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdatePositionData, NewPosition) == 0x000010, "Member 'GAB_Hunting_C_UpdatePositionData::NewPosition' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdatePositionData, MaxDistance) == 0x00001C, "Member 'GAB_Hunting_C_UpdatePositionData::MaxDistance' has a wrong offset!");
static_assert(offsetof(GAB_Hunting_C_UpdatePositionData, HasValidData) == 0x000020, "Member 'GAB_Hunting_C_UpdatePositionData::HasValidData' has a wrong offset!");
