#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_GenericStunned

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_GenericStunned.GAB_GenericStunned_C
// 0x0030 (0x0968 - 0x0938)
class GAB_GenericStunned::UGAB_GenericStunned_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 StunActiveEffect;                                  // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveStun;                                        // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 RestoreControlResistEffect;                        // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_ImpactImmunity;                                 // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveImpactImmunity;                              // 0x0960(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_GenericStunned(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass GAB_GenericStunned.GAB_GenericStunned_C", true, "GAB_GenericStunned_C">();
	}
	static class GAB_GenericStunned::UGAB_GenericStunned_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<GAB_GenericStunned::UGAB_GenericStunned_C>();
	}
};
static_assert(alignof(GAB_GenericStunned::UGAB_GenericStunned_C) == 0x000008, "Wrong alignment on GAB_GenericStunned::UGAB_GenericStunned_C");
static_assert(sizeof(GAB_GenericStunned::UGAB_GenericStunned_C) == 0x000968, "Wrong size on GAB_GenericStunned::UGAB_GenericStunned_C");
static_assert(offsetof(GAB_GenericStunned::UGAB_GenericStunned_C, UberGraphFrame) == 0x000938, "Member 'GAB_GenericStunned::UGAB_GenericStunned_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned::UGAB_GenericStunned_C, StunActiveEffect) == 0x000940, "Member 'GAB_GenericStunned::UGAB_GenericStunned_C::StunActiveEffect' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned::UGAB_GenericStunned_C, ActiveStun) == 0x000948, "Member 'GAB_GenericStunned::UGAB_GenericStunned_C::ActiveStun' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned::UGAB_GenericStunned_C, RestoreControlResistEffect) == 0x000950, "Member 'GAB_GenericStunned::UGAB_GenericStunned_C::RestoreControlResistEffect' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned::UGAB_GenericStunned_C, GE_ImpactImmunity) == 0x000958, "Member 'GAB_GenericStunned::UGAB_GenericStunned_C::GE_ImpactImmunity' has a wrong offset!");
static_assert(offsetof(GAB_GenericStunned::UGAB_GenericStunned_C, ActiveImpactImmunity) == 0x000960, "Member 'GAB_GenericStunned::UGAB_GenericStunned_C::ActiveImpactImmunity' has a wrong offset!");

}

