#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_FiendMelee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAB_AIBaseMelee_NoMontage_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_FiendMelee.GAB_FiendMelee_C
// 0x0028 (0x0970 - 0x0948)
class UGAB_FiendMelee_C : public UGAB_AIBaseMelee_NoMontage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAB_FiendMelee_C;                   // 0x0948(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAbilityTask_MoveAI*                FiendMove;                                         // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HitActors;                                         // 0x0958(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class UClass*                                 GE_AIBaseMeleeFrustration_Reset;                   // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_FiendMelee(int32 EntryPoint);
	void GameplayEffectContainerApplied(const struct FGameplayAbilityTargetDataHandle& Target_Data);
	void ContinuousMoveTowardsTarget();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void Triggered_7FA319D24D6A2844B0CE37B57B709AE5(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_7FA319D24D6A2844B0CE37B57B709AE5(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_7FA319D24D6A2844B0CE37B57B709AE5(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnComplete_445BEF534036169059384B82E2963353();
	void OnInterrupted_445BEF534036169059384B82E2963353();
	void OnCancelled_445BEF534036169059384B82E2963353();
	void OnRequestFailed_445BEF534036169059384B82E2963353();
	void OnMoveFinished_445BEF534036169059384B82E2963353(EPathFollowingResult Result, class AAIController* AIController);
	void Cancelled_35D25988427E4CF4800223AD6BCDA350(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_35D25988427E4CF4800223AD6BCDA350(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Triggered_35D25988427E4CF4800223AD6BCDA350(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_FiendMelee_C">();
	}
	static class UGAB_FiendMelee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_FiendMelee_C>();
	}
};
static_assert(alignof(UGAB_FiendMelee_C) == 0x000008, "Wrong alignment on UGAB_FiendMelee_C");
static_assert(sizeof(UGAB_FiendMelee_C) == 0x000970, "Wrong size on UGAB_FiendMelee_C");
static_assert(offsetof(UGAB_FiendMelee_C, UberGraphFrame_GAB_FiendMelee_C) == 0x000948, "Member 'UGAB_FiendMelee_C::UberGraphFrame_GAB_FiendMelee_C' has a wrong offset!");
static_assert(offsetof(UGAB_FiendMelee_C, FiendMove) == 0x000950, "Member 'UGAB_FiendMelee_C::FiendMove' has a wrong offset!");
static_assert(offsetof(UGAB_FiendMelee_C, HitActors) == 0x000958, "Member 'UGAB_FiendMelee_C::HitActors' has a wrong offset!");
static_assert(offsetof(UGAB_FiendMelee_C, GE_AIBaseMeleeFrustration_Reset) == 0x000968, "Member 'UGAB_FiendMelee_C::GE_AIBaseMeleeFrustration_Reset' has a wrong offset!");

}

