#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadMappingInfo_v3

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.CustomKeySelected__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature");
static_assert(sizeof(GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature) == 0x000018, "Wrong size on GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature");
static_assert(offsetof(GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature, Key) == 0x000000, "Member 'GamepadMappingInfo_v3_C_CustomKeySelected__DelegateSignature::Key' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.ExecuteUbergraph_GamepadMappingInfo_v3
// 0x01A8 (0x01A8 - 0x0000)
struct GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetControllerImage_Texture;               // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button2;                        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UGamepadKeyTextButton_C*                K2Node_DynamicCast_AsGamepad_Key_Text_Button;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate1;             // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGamepadKeyTextButton_C*>        K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue1;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue2;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue3;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabCount_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText;       // 0x00D8(0x0018)()
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName1;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText1;      // 0x00F8(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button1;                        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate2;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate3;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ConvertSliderValueToSettingsValue_SettingsValue; // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue1;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ConvertSliderValueToSettingsValue_SettingsValue1; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName2;    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText2;      // 0x0180(0x0018)()
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item1;                          // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3");
static_assert(sizeof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3) == 0x0001A8, "Wrong size on GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, EntryPoint) == 0x000000, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::EntryPoint' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_object_Variable) == 0x000008, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_AsTexture_2D) == 0x000010, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetControllerImage_Texture) == 0x000020, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetControllerImage_Texture' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_IsAssetNull_ReturnValue) == 0x000048, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Button2) == 0x000050, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Button2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_AsGamepad_Key_Text_Button) == 0x000068, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_AsGamepad_Key_Text_Button' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_DynamicCast_bSuccess1) == 0x000070, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate1) == 0x000074, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_MakeArray_Array) == 0x000088, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue) == 0x000098, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue1) == 0x0000A0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue2) == 0x0000A8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabIdAtIndex_ReturnValue3) == 0x0000B0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabIdAtIndex_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetTabCount_ReturnValue) == 0x0000B8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetTabCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Greater_IntInt_ReturnValue) == 0x0000BC, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Array_Index_Variable1) == 0x0000C0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_ActionName) == 0x0000D0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_ActionName' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_DescText) == 0x0000D8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_DescText' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_ActionName1) == 0x0000F0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_ActionName1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_DescText1) == 0x0000F8, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_DescText1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Loaded) == 0x000118, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Button1) == 0x000120, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Button1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CustomEvent_Button) == 0x000128, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate2) == 0x000130, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, K2Node_CreateDelegate_OutputDelegate3) == 0x000140, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, Temp_int_Loop_Counter_Variable1) == 0x000150, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Add_IntInt_ReturnValue1) == 0x000154, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetContext_ReturnValue) == 0x000158, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetValue_ReturnValue) == 0x000160, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_ConvertSliderValueToSettingsValue_SettingsValue) == 0x000164, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_ConvertSliderValueToSettingsValue_SettingsValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetContext_ReturnValue1) == 0x000168, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetValue_ReturnValue1) == 0x000170, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_ConvertSliderValueToSettingsValue_SettingsValue1) == 0x000174, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_ConvertSliderValueToSettingsValue_SettingsValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_ActionName2) == 0x000178, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_ActionName2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_GetCustomButtonDataForKey_DescText2) == 0x000180, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_GetCustomButtonDataForKey_DescText2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Get_Item1) == 0x000198, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Array_Length_ReturnValue1) == 0x0001A0, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3, CallFunc_Less_IntInt_ReturnValue1) == 0x0001A4, "Member 'GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.DeadzoneLookResetButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind");
static_assert(sizeof(GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind) == 0x000008, "Wrong size on GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind");
static_assert(offsetof(GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind, Button) == 0x000000, "Member 'GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind::Button' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.DeadzoneMoveResetButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind");
static_assert(sizeof(GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind) == 0x000008, "Wrong size on GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind");
static_assert(offsetof(GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind, Button) == 0x000000, "Member 'GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind::Button' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_OnButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_OnButtonClicked_Bind) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_OnButtonClicked_Bind");
static_assert(sizeof(GamepadMappingInfo_v3_C_OnButtonClicked_Bind) == 0x000008, "Wrong size on GamepadMappingInfo_v3_C_OnButtonClicked_Bind");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnButtonClicked_Bind, Button) == 0x000000, "Member 'GamepadMappingInfo_v3_C_OnButtonClicked_Bind::Button' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnLoaded_CDBC1B27496027B96D10BC9A64224F3D
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D");
static_assert(sizeof(GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D) == 0x000008, "Wrong size on GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D, Loaded) == 0x000000, "Member 'GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D::Loaded' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.Update Displayed Mapping
// 0x0040 (0x0040 - 0x0000)
struct GamepadMappingInfo_v3_C_Update_Displayed_Mapping final
{
public:
	int32                                         Platform;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputActionGroup                         Mode;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Configuration;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_Select2_Default;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_Update_Displayed_Mapping");
static_assert(sizeof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping) == 0x000040, "Wrong size on GamepadMappingInfo_v3_C_Update_Displayed_Mapping");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Platform) == 0x000000, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Platform' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Mode) == 0x000004, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Mode' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Configuration) == 0x000008, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Configuration' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable) == 0x00000C, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable1) == 0x00000E, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable2) == 0x00000F, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable3) == 0x000010, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_int_Variable) == 0x000014, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable4) == 0x000018, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, K2Node_Select_Default) == 0x000019, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable5) == 0x00001A, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable6) == 0x00001B, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_byte_Variable7) == 0x00001C, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_int_Variable1) == 0x000020, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, K2Node_Select1_Default) == 0x000024, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, Temp_int_Variable2) == 0x000028, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_Update_Displayed_Mapping, K2Node_Select2_Default) == 0x000030, "Member 'GamepadMappingInfo_v3_C_Update_Displayed_Mapping::K2Node_Select2_Default' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnConfigChanged
// 0x0028 (0x0028 - 0x0000)
struct GamepadMappingInfo_v3_C_OnConfigChanged final
{
public:
	EFortInputActionGroup                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCustomGamepadConfig_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GamepadMappingInfo_v3_C_OnConfigChanged) == 0x000008, "Wrong alignment on GamepadMappingInfo_v3_C_OnConfigChanged");
static_assert(sizeof(GamepadMappingInfo_v3_C_OnConfigChanged) == 0x000028, "Wrong size on GamepadMappingInfo_v3_C_OnConfigChanged");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, Mode) == 0x000000, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::Mode' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, Config) == 0x000004, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::Config' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, CallFunc_GetSubGame_ReturnValue) == 0x000010, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, CallFunc_GetContext_ReturnValue1) == 0x000018, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GamepadMappingInfo_v3_C_OnConfigChanged, CallFunc_IsCustomGamepadConfig_ReturnValue) == 0x000020, "Member 'GamepadMappingInfo_v3_C_OnConfigChanged::CallFunc_IsCustomGamepadConfig_ReturnValue' has a wrong offset!");

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.HandleConfigChanged_Athena
// 0x1DC0 (0x1DC0 - 0x0000)
struct GamepadMappingInfo_v3_C_HandleConfigChanged_Athena final
{
public:
	EFortInputActionGroup                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable1;                               // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0040(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00C0(0x0018)()
	int32                                         Temp_int_Variable1;                                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable9;                               // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0140(0x0018)()
	int32                                         Temp_int_Variable2;                                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0178(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x0190(0x0018)()
	class FText                                   Temp_text_Variable14;                              // 0x01A8(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x01C0(0x0018)()
	class FText                                   Temp_text_Variable16;                              // 0x01D8(0x0018)()
	int32                                         Temp_int_Variable3;                                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable17;                              // 0x0210(0x0018)()
	class FText                                   Temp_text_Variable18;                              // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable19;                              // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable20;                              // 0x0258(0x0018)()
	class FText                                   Temp_text_Variable21;                              // 0x0270(0x0018)()
	int32                                         Temp_int_Variable4;                                // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable22;                              // 0x02A8(0x0018)()
	class FText                                   Temp_text_Variable23;                              // 0x02C0(0x0018)()
	class FText                                   Temp_text_Variable24;                              // 0x02D8(0x0018)()
	class FText                                   Temp_text_Variable25;                              // 0x02F0(0x0018)()
	int32                                         Temp_int_Variable5;                                // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x0310(0x0018)()
	class FText                                   Temp_text_Variable26;                              // 0x0328(0x0018)()
	class FText                                   Temp_text_Variable27;                              // 0x0340(0x0018)()
	class FText                                   Temp_text_Variable28;                              // 0x0358(0x0018)()
	class FText                                   Temp_text_Variable29;                              // 0x0370(0x0018)()
	class FText                                   Temp_text_Variable30;                              // 0x0388(0x0018)()
	int32                                         Temp_int_Variable6;                                // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select5_Default;                            // 0x03A8(0x0018)()
	class FText                                   Temp_text_Variable31;                              // 0x03C0(0x0018)()
	class FText                                   Temp_text_Variable32;                              // 0x03D8(0x0018)()
	class FText                                   Temp_text_Variable33;                              // 0x03F0(0x0018)()
	class FText                                   Temp_text_Variable34;                              // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable35;                              // 0x0420(0x0018)()
	int32                                         Temp_int_Variable7;                                // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select6_Default;                            // 0x0440(0x0018)()
	class FText                                   Temp_text_Variable36;                              // 0x0458(0x0018)()
	class FText                                   Temp_text_Variable37;                              // 0x0470(0x0018)()
	class FText                                   Temp_text_Variable38;                              // 0x0488(0x0018)()
	class FText                                   Temp_text_Variable39;                              // 0x04A0(0x0018)()
	class FText                                   Temp_text_Variable40;                              // 0x04B8(0x0018)()
	int32                                         Temp_int_Variable8;                                // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select7_Default;                            // 0x04D8(0x0018)()
	class FText                                   Temp_text_Variable41;                              // 0x04F0(0x0018)()
	class FText                                   Temp_text_Variable42;                              // 0x0508(0x0018)()
	class FText                                   Temp_text_Variable43;                              // 0x0520(0x0018)()
	class FText                                   Temp_text_Variable44;                              // 0x0538(0x0018)()
	class FText                                   Temp_text_Variable45;                              // 0x0550(0x0018)()
	int32                                         Temp_int_Variable9;                                // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select8_Default;                            // 0x0570(0x0018)()
	class FText                                   Temp_text_Variable46;                              // 0x0588(0x0018)()
	class FText                                   Temp_text_Variable47;                              // 0x05A0(0x0018)()
	class FText                                   Temp_text_Variable48;                              // 0x05B8(0x0018)()
	class FText                                   Temp_text_Variable49;                              // 0x05D0(0x0018)()
	class FText                                   Temp_text_Variable50;                              // 0x05E8(0x0018)()
	int32                                         Temp_int_Variable10;                               // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select9_Default;                            // 0x0608(0x0018)()
	class FText                                   Temp_text_Variable51;                              // 0x0620(0x0018)()
	class FText                                   Temp_text_Variable52;                              // 0x0638(0x0018)()
	class FText                                   Temp_text_Variable53;                              // 0x0650(0x0018)()
	class FText                                   Temp_text_Variable54;                              // 0x0668(0x0018)()
	class FText                                   Temp_text_Variable55;                              // 0x0680(0x0018)()
	int32                                         Temp_int_Variable11;                               // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select10_Default;                           // 0x06A0(0x0018)()
	class FText                                   Temp_text_Variable56;                              // 0x06B8(0x0018)()
	class FText                                   Temp_text_Variable57;                              // 0x06D0(0x0018)()
	class FText                                   Temp_text_Variable58;                              // 0x06E8(0x0018)()
	class FText                                   Temp_text_Variable59;                              // 0x0700(0x0018)()
	class FText                                   Temp_text_Variable60;                              // 0x0718(0x0018)()
	int32                                         Temp_int_Variable12;                               // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select11_Default;                           // 0x0738(0x0018)()
	class FText                                   Temp_text_Variable61;                              // 0x0750(0x0018)()
	class FText                                   Temp_text_Variable62;                              // 0x0768(0x0018)()
	class FText                                   Temp_text_Variable63;                              // 0x0780(0x0018)()
	class FText                                   Temp_text_Variable64;                              // 0x0798(0x0018)()
	class FText                                   Temp_text_Variable65;                              // 0x07B0(0x0018)()
	int32                                         Temp_int_Variable13;                               // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select12_Default;                           // 0x07D0(0x0018)()
	class FText                                   Temp_text_Variable66;                              // 0x07E8(0x0018)()
	class FText                                   Temp_text_Variable67;                              // 0x0800(0x0018)()
	class FText                                   Temp_text_Variable68;                              // 0x0818(0x0018)()
	class FText                                   Temp_text_Variable69;                              // 0x0830(0x0018)()
	class FText                                   Temp_text_Variable70;                              // 0x0848(0x0018)()
	int32                                         Temp_int_Variable14;                               // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864[0x4];                                      // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select13_Default;                           // 0x0868(0x0018)()
	class FText                                   Temp_text_Variable71;                              // 0x0880(0x0018)()
	class FText                                   Temp_text_Variable72;                              // 0x0898(0x0018)()
	class FText                                   Temp_text_Variable73;                              // 0x08B0(0x0018)()
	class FText                                   Temp_text_Variable74;                              // 0x08C8(0x0018)()
	class FText                                   Temp_text_Variable75;                              // 0x08E0(0x0018)()
	int32                                         Temp_int_Variable15;                               // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select14_Default;                           // 0x0900(0x0018)()
	class FText                                   Temp_text_Variable76;                              // 0x0918(0x0018)()
	class FText                                   Temp_text_Variable77;                              // 0x0930(0x0018)()
	class FText                                   Temp_text_Variable78;                              // 0x0948(0x0018)()
	class FText                                   Temp_text_Variable79;                              // 0x0960(0x0018)()
	class FText                                   Temp_text_Variable80;                              // 0x0978(0x0018)()
	int32                                         Temp_int_Variable16;                               // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_994[0x4];                                      // 0x0994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select15_Default;                           // 0x0998(0x0018)()
	class FText                                   Temp_text_Variable81;                              // 0x09B0(0x0018)()
	class FText                                   Temp_text_Variable82;                              // 0x09C8(0x0018)()
	class FText                                   Temp_text_Variable83;                              // 0x09E0(0x0018)()
	class FText                                   Temp_text_Variable84;                              // 0x09F8(0x0018)()
	class FText                                   Temp_text_Variable85;                              // 0x0A10(0x0018)()
	int32                                         Temp_int_Variable17;                               // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select16_Default;                           // 0x0A30(0x0018)()
	class FText                                   Temp_text_Variable86;                              // 0x0A48(0x0018)()
	class FText                                   Temp_text_Variable87;                              // 0x0A60(0x0018)()
	class FText                                   Temp_text_Variable88;                              // 0x0A78(0x0018)()
	class FText                                   Temp_text_Variable89;                              // 0x0A90(0x0018)()
