#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Athena_OutsideSafeZone_Stage02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Athena_OutsideSafeZone_Stage02.GC_Athena_OutsideSafeZone_Stage02_C
// 0x0038 (0x08B8 - 0x0880)
class AGC_Athena_OutsideSafeZone_Stage02_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Storm_ScreenEffect;                             // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_AE87617347376D69F14447A1CE266BF0; // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_AE87617347376D69F14447A1CE266BF0; // 0x0894(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_895[0x3];                                      // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Opacity_9C2850244543E008E61DCE8C70C51C66; // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_9C2850244543E008E61DCE8C70C51C66; // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A5[0x3];                                      // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StormOpacity;                                      // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Athena_OutsideSafeZone_Stage02(int32 EntryPoint);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void UserConstructionScript();
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ZapFX(int32 ZapCount, class APlayerPawn_Athena_C* PlayerPawnAthena);
	void AddStormAudio(class APlayerPawn_Athena_C* PlayerPawnAthena);
	void RemoveStormAudio(class APlayerPawn_Athena_C* PlayerPawnAthena);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Athena_OutsideSafeZone_Stage02_C">();
	}
	static class AGC_Athena_OutsideSafeZone_Stage02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Athena_OutsideSafeZone_Stage02_C>();
	}
};
static_assert(alignof(AGC_Athena_OutsideSafeZone_Stage02_C) == 0x000008, "Wrong alignment on AGC_Athena_OutsideSafeZone_Stage02_C");
static_assert(sizeof(AGC_Athena_OutsideSafeZone_Stage02_C) == 0x0008B8, "Wrong size on AGC_Athena_OutsideSafeZone_Stage02_C");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, UberGraphFrame) == 0x000880, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, SM_Storm_ScreenEffect) == 0x000888, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::SM_Storm_ScreenEffect' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, Timeline_0_Opacity_AE87617347376D69F14447A1CE266BF0) == 0x000890, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::Timeline_0_Opacity_AE87617347376D69F14447A1CE266BF0' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, Timeline_0__Direction_AE87617347376D69F14447A1CE266BF0) == 0x000894, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::Timeline_0__Direction_AE87617347376D69F14447A1CE266BF0' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, Timeline_0) == 0x000898, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, Timeline_1_Opacity_9C2850244543E008E61DCE8C70C51C66) == 0x0008A0, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::Timeline_1_Opacity_9C2850244543E008E61DCE8C70C51C66' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, Timeline_1__Direction_9C2850244543E008E61DCE8C70C51C66) == 0x0008A4, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::Timeline_1__Direction_9C2850244543E008E61DCE8C70C51C66' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, Timeline_1) == 0x0008A8, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_Stage02_C, StormOpacity) == 0x0008B0, "Member 'AGC_Athena_OutsideSafeZone_Stage02_C::StormOpacity' has a wrong offset!");

}

