#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Athena_Storm_Bus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Athena_Storm_Bus.GC_Athena_Storm_Bus_C
// 0x0068 (0x08E8 - 0x0880)
class AGC_Athena_Storm_Bus_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Lightining_Flash_LERP_1FC138BF41C8F8C6CC68BAA96F2470A1; // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Lightining_Flash__Direction_1FC138BF41C8F8C6CC68BAA96F2470A1; // 0x088C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88D[0x3];                                      // 0x088D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Lightining_Flash;                                  // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightningSpawnLocation;                            // 0x0898(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A4[0x4];                                      // 0x08A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Bus_Actor;                                         // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ChanceOfLightningMesh;                            // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningFlashDiameter;                            // 0x08B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningFlashHeight;                              // 0x08B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   RandomLightningLight;                              // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningIntensityMin;                             // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningIntensityMax;                             // 0x08CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningIntensity;                                // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningTimelinePlaySpeedMin;                     // 0x08D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningTimelinePlaySpeedMax;                     // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningFlashRepeatDelayMin;                      // 0x08DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningFlashRepeatDelayMax;                      // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Athena_Storm_Bus(int32 EntryPoint);
	void Play_Lightning_Flash_Audio(const struct FVector& Location);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void StartRandomLightningFlashes();
	void Lightining_Flash__UpdateFunc();
	void Lightining_Flash__FinishedFunc();
	void UserConstructionScript();
	void Get_Location_in_Circle_XY(struct FVector* LocationLocalSpace);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Athena_Storm_Bus_C">();
	}
	static class AGC_Athena_Storm_Bus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Athena_Storm_Bus_C>();
	}
};
static_assert(alignof(AGC_Athena_Storm_Bus_C) == 0x000008, "Wrong alignment on AGC_Athena_Storm_Bus_C");
static_assert(sizeof(AGC_Athena_Storm_Bus_C) == 0x0008E8, "Wrong size on AGC_Athena_Storm_Bus_C");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, UberGraphFrame) == 0x000880, "Member 'AGC_Athena_Storm_Bus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, Lightining_Flash_LERP_1FC138BF41C8F8C6CC68BAA96F2470A1) == 0x000888, "Member 'AGC_Athena_Storm_Bus_C::Lightining_Flash_LERP_1FC138BF41C8F8C6CC68BAA96F2470A1' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, Lightining_Flash__Direction_1FC138BF41C8F8C6CC68BAA96F2470A1) == 0x00088C, "Member 'AGC_Athena_Storm_Bus_C::Lightining_Flash__Direction_1FC138BF41C8F8C6CC68BAA96F2470A1' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, Lightining_Flash) == 0x000890, "Member 'AGC_Athena_Storm_Bus_C::Lightining_Flash' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningSpawnLocation) == 0x000898, "Member 'AGC_Athena_Storm_Bus_C::LightningSpawnLocation' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, Bus_Actor) == 0x0008A8, "Member 'AGC_Athena_Storm_Bus_C::Bus_Actor' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, _ChanceOfLightningMesh) == 0x0008B0, "Member 'AGC_Athena_Storm_Bus_C::_ChanceOfLightningMesh' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningFlashDiameter) == 0x0008B4, "Member 'AGC_Athena_Storm_Bus_C::LightningFlashDiameter' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningFlashHeight) == 0x0008B8, "Member 'AGC_Athena_Storm_Bus_C::LightningFlashHeight' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, RandomLightningLight) == 0x0008C0, "Member 'AGC_Athena_Storm_Bus_C::RandomLightningLight' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningIntensityMin) == 0x0008C8, "Member 'AGC_Athena_Storm_Bus_C::LightningIntensityMin' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningIntensityMax) == 0x0008CC, "Member 'AGC_Athena_Storm_Bus_C::LightningIntensityMax' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningIntensity) == 0x0008D0, "Member 'AGC_Athena_Storm_Bus_C::LightningIntensity' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningTimelinePlaySpeedMin) == 0x0008D4, "Member 'AGC_Athena_Storm_Bus_C::LightningTimelinePlaySpeedMin' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningTimelinePlaySpeedMax) == 0x0008D8, "Member 'AGC_Athena_Storm_Bus_C::LightningTimelinePlaySpeedMax' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningFlashRepeatDelayMin) == 0x0008DC, "Member 'AGC_Athena_Storm_Bus_C::LightningFlashRepeatDelayMin' has a wrong offset!");
static_assert(offsetof(AGC_Athena_Storm_Bus_C, LightningFlashRepeatDelayMax) == 0x0008E0, "Member 'AGC_Athena_Storm_Bus_C::LightningFlashRepeatDelayMax' has a wrong offset!");

}

