#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Athena_Storm_Bus

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Athena_Storm_Bus.GC_Athena_Storm_Bus_C.ExecuteUbergraph_GC_Athena_Storm_Bus
// 0x02B0 (0x02B0 - 0x0000)
struct GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnPooledFXActor_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALightningLsystem_C*                    K2Node_DynamicCast_AsLightning_Lsystem;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0168(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x0220(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0230(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Location_in_Circle_XY_LocationLocalSpace; // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus) == 0x000010, "Wrong alignment on GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus");
static_assert(sizeof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus) == 0x0002B0, "Wrong size on GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, EntryPoint) == 0x000000, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, Temp_float_Variable) == 0x000004, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, Temp_struct_Variable) == 0x000020, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_RandomFloatInRange_ReturnValue1) == 0x000064, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_Lerp_ReturnValue) == 0x00006C, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, Temp_bool_Variable) == 0x000070, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_Select_Default) == 0x000080, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000084, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000088, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_RandomFloat_ReturnValue) == 0x000140, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_SpawnPooledFXActor_ReturnValue) == 0x000148, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_SpawnPooledFXActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_DynamicCast_AsLightning_Lsystem) == 0x000150, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_DynamicCast_AsLightning_Lsystem' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000159, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_Event_MyTarget) == 0x000160, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_Event_Parameters) == 0x000168, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_Event_ParticleComponents) == 0x000220, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_Event_AudioComponents) == 0x000230, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000240, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_Get_Location_in_Circle_XY_LocationLocalSpace) == 0x00024C, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_Get_Location_in_Circle_XY_LocationLocalSpace' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, K2Node_CustomEvent_Location) == 0x000258, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_Add_VectorVector_ReturnValue1) == 0x000264, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_BreakVector_X) == 0x000270, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_BreakVector_Y) == 0x000274, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_BreakVector_Z) == 0x000278, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00027C, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_BreakVector_X1) == 0x000288, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_BreakVector_Y1) == 0x00028C, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_BreakVector_Z1) == 0x000290, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_MakeVector_ReturnValue) == 0x000294, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_RandomFloatInRange_ReturnValue2) == 0x0002A0, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002A8, "Member 'GC_Athena_Storm_Bus_C_ExecuteUbergraph_GC_Athena_Storm_Bus::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function GC_Athena_Storm_Bus.GC_Athena_Storm_Bus_C.Play Lightning Flash Audio
// 0x000C (0x000C - 0x0000)
struct GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio) == 0x000004, "Wrong alignment on GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio");
static_assert(sizeof(GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio) == 0x00000C, "Wrong size on GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio, Location) == 0x000000, "Member 'GC_Athena_Storm_Bus_C_Play_Lightning_Flash_Audio::Location' has a wrong offset!");

// Function GC_Athena_Storm_Bus.GC_Athena_Storm_Bus_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GC_Athena_Storm_Bus_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Athena_Storm_Bus_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Athena_Storm_Bus_C_OnLoopingStart");
static_assert(sizeof(GC_Athena_Storm_Bus_C_OnLoopingStart) == 0x0000E0, "Wrong size on GC_Athena_Storm_Bus_C_OnLoopingStart");
static_assert(offsetof(GC_Athena_Storm_Bus_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GC_Athena_Storm_Bus_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Athena_Storm_Bus_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GC_Athena_Storm_Bus_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GC_Athena_Storm_Bus_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GC_Athena_Storm_Bus.GC_Athena_Storm_Bus_C.Get Location in Circle XY
// 0x0054 (0x0054 - 0x0000)
struct GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY final
{
public:
	struct FVector                                LocationLocalSpace;                                // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY) == 0x000004, "Wrong alignment on GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY");
static_assert(sizeof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY) == 0x000054, "Wrong size on GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, LocationLocalSpace) == 0x000000, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::LocationLocalSpace' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_GetPI_ReturnValue) == 0x00001C, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_Cos_ReturnValue) == 0x00002C, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_Sin_ReturnValue) == 0x000030, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000034, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000038, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_MakeVector_ReturnValue1) == 0x00003C, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY, CallFunc_VLerp_ReturnValue) == 0x000048, "Member 'GC_Athena_Storm_Bus_C_Get_Location_in_Circle_XY::CallFunc_VLerp_ReturnValue' has a wrong offset!");

}

