#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Abilities_Activation_DBNOResurrect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Abilities_Activation_DBNOResurrect.GC_Abilities_Activation_DBNOResurrect_C.OnBurst
// 0x01A8 (0x01A8 - 0x0000)
struct GC_Abilities_Activation_DBNOResurrect_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst) == 0x000008, "Wrong alignment on GC_Abilities_Activation_DBNOResurrect_C_OnBurst");
static_assert(sizeof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst) == 0x0001A8, "Wrong size on GC_Abilities_Activation_DBNOResurrect_C_OnBurst");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, MyTarget) == 0x000000, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x0000F8, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, CallFunc_MakeRotFromX_ReturnValue) == 0x000104, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000110, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000198, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Abilities_Activation_DBNOResurrect_C_OnBurst, CallFunc_MakeVector_ReturnValue1) == 0x00019C, "Member 'GC_Abilities_Activation_DBNOResurrect_C_OnBurst::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");

}

