#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Commando_FlakVest_AddStack

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Commando_FlakVest_AddStack.GC_Commando_FlakVest_AddStack_C
// 0x0018 (0x0098 - 0x0080)
class UGC_Commando_FlakVest_AddStack_C final : public UFortGameplayCueNotify_Simple
{
public:
	float                                         F_MaxStacks;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        PS_Stacks;                                         // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PS_MaxStacks;                                      // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Commando_FlakVest_AddStack_C">();
	}
	static class UGC_Commando_FlakVest_AddStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_Commando_FlakVest_AddStack_C>();
	}
};
static_assert(alignof(UGC_Commando_FlakVest_AddStack_C) == 0x000008, "Wrong alignment on UGC_Commando_FlakVest_AddStack_C");
static_assert(sizeof(UGC_Commando_FlakVest_AddStack_C) == 0x000098, "Wrong size on UGC_Commando_FlakVest_AddStack_C");
static_assert(offsetof(UGC_Commando_FlakVest_AddStack_C, F_MaxStacks) == 0x000080, "Member 'UGC_Commando_FlakVest_AddStack_C::F_MaxStacks' has a wrong offset!");
static_assert(offsetof(UGC_Commando_FlakVest_AddStack_C, PS_Stacks) == 0x000088, "Member 'UGC_Commando_FlakVest_AddStack_C::PS_Stacks' has a wrong offset!");
static_assert(offsetof(UGC_Commando_FlakVest_AddStack_C, PS_MaxStacks) == 0x000090, "Member 'UGC_Commando_FlakVest_AddStack_C::PS_MaxStacks' has a wrong offset!");

}

