#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_DUDEBRO_Sweep_Beam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_DUDEBRO_Sweep_Beam.GC_DUDEBRO_Sweep_Beam_C.ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam
// 0x0420 (0x0420 - 0x0000)
struct GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0028(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0194(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0240(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0274(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam) == 0x000010, "Wrong alignment on GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam");
static_assert(sizeof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam) == 0x000420, "Wrong size on GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, EntryPoint) == 0x000000, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, K2Node_Event_MyTarget) == 0x000018, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, K2Node_Event_EventType) == 0x000020, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, K2Node_Event_Parameters) == 0x000028, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, K2Node_SwitchEnum_CmpSuccess) == 0x0000E0, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, K2Node_DynamicCast_AsFort_AIPawn) == 0x0000E8, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000F4, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakRotator_Roll) == 0x000100, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakRotator_Pitch) == 0x000104, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakRotator_Yaw) == 0x000108, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_GetSocketTransform_ReturnValue) == 0x000110, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakTransform_Location) == 0x000140, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakTransform_Rotation) == 0x00014C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakTransform_Scale) == 0x000158, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakRotator_Roll1) == 0x000164, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakRotator_Pitch1) == 0x000168, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakRotator_Yaw1) == 0x00016C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_MakeRotator_ReturnValue) == 0x000170, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00017C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000188, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000194, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Add_VectorVector_ReturnValue) == 0x00021C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, Temp_bool_Has_Been_Initd_Variable) == 0x000228, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000230, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, Temp_object_Variable) == 0x000240, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakTransform_Location1) == 0x000250, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakTransform_Rotation1) == 0x00025C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakTransform_Scale1) == 0x000268, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_LineTraceSingle_OutHit) == 0x000274, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_LineTraceSingle_ReturnValue) == 0x0002FC, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000300, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_bBlockingHit) == 0x000308, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_bInitialOverlap) == 0x000309, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_Time) == 0x00030C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_Distance) == 0x000310, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_Location) == 0x000314, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_ImpactPoint) == 0x000320, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_Normal) == 0x00032C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_ImpactNormal) == 0x000338, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_PhysMat) == 0x000348, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_HitActor) == 0x000350, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_HitComponent) == 0x000358, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_HitBoneName) == 0x000360, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_HitItem) == 0x000368, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_FaceIndex) == 0x00036C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_TraceStart) == 0x000370, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_BreakHitResult_TraceEnd) == 0x00037C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x000388, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Abs_ReturnValue) == 0x00038C, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000390, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_MakeVector_ReturnValue1) == 0x000394, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Add_VectorVector_ReturnValue1) == 0x0003A0, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_MakeTransform_ReturnValue) == 0x0003B0, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x0003E0, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_RandomFloat_ReturnValue) == 0x0003E8, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003EC, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_Lerp_ReturnValue) == 0x0003F0, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_MakeRotator_ReturnValue1) == 0x0003F4, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_MakeRotator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000400, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000408, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x000410, "Member 'GC_DUDEBRO_Sweep_Beam_C_ExecuteUbergraph_GC_DUDEBRO_Sweep_Beam::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");

// Function GC_DUDEBRO_Sweep_Beam.GC_DUDEBRO_Sweep_Beam_C.K2_HandleGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue) == 0x0000C8, "Wrong size on GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_DUDEBRO_Sweep_Beam_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

