#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_DUDEBRO_Sweep_Impact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_DUDEBRO_Sweep_Impact.GC_DUDEBRO_Sweep_Impact_C.K2_HandleGameplayCue
// 0x0118 (0x0118 - 0x0000)
struct GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UDecalComponent*                        Decal;                                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue) == 0x000118, "Wrong size on GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, Decal) == 0x0000C8, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::Decal' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_RandomFloat_ReturnValue) == 0x0000D0, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_Lerp_ReturnValue) == 0x0000D4, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000D8, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_MakeRotator_ReturnValue) == 0x0000E4, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_BreakVector_X) == 0x0000F0, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_BreakVector_Y) == 0x0000F4, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_BreakVector_Z) == 0x0000F8, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_MakeVector_ReturnValue) == 0x0000FC, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000108, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000110, "Member 'GC_DUDEBRO_Sweep_Impact_C_K2_HandleGameplayCue::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

