#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Husk_Slow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Husk_Slow.GC_Husk_Slow_C.ExecuteUbergraph_GC_Husk_Slow
// 0x0230 (0x0230 - 0x0000)
struct GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn_Flinger*                      K2Node_DynamicCast_AsFort_Pawn_Flinger;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn_Taker*                        K2Node_DynamicCast_AsFort_Pawn_Taker;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyPawn_Parent_C*                    K2Node_DynamicCast_AsEnemy_Pawn_Parent;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue1;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x016C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            K2Node_CustomEvent_TimelineDirection1;             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue1;        // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            K2Node_CustomEvent_TimelineDirection;              // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow) == 0x000008, "Wrong alignment on GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow");
static_assert(sizeof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow) == 0x000230, "Wrong size on GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, EntryPoint) == 0x000000, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_Event_EventType) == 0x000010, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_Event_Parameters) == 0x000018, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_SwitchEnum_CmpSuccess) == 0x0000D0, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_AsFort_Pawn_Flinger) == 0x0000D8, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_AsFort_Pawn_Flinger' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_AsFort_Pawn_Taker) == 0x0000E8, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_AsFort_Pawn_Taker' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_bSuccess1) == 0x0000F0, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_MakeVector_ReturnValue) == 0x0000F4, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_MakeVector_ReturnValue1) == 0x000100, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_AsEnemy_Pawn_Parent) == 0x000110, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_AsEnemy_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_MakeVector_ReturnValue2) == 0x00011C, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_IsValid_ReturnValue1) == 0x000128, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_IsValid_ReturnValue2) == 0x000129, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_GetSocketLocation_ReturnValue) == 0x00012C, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_GetSocketLocation_ReturnValue1) == 0x000138, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_GetSocketLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000144, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000150, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_VSize_ReturnValue) == 0x000158, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_FindLookAtRotation_ReturnValue) == 0x00015C, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000168, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x00016C, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_MakeVector_ReturnValue3) == 0x0001F4, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000200, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_CustomEvent_TimelineDirection1) == 0x000208, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_CustomEvent_TimelineDirection1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, Temp_bool_Variable) == 0x000209, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_SwitchEnum1_CmpSuccess) == 0x00020A, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00020B, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_K2_AttachToComponent_ReturnValue1) == 0x00020C, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_K2_AttachToComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_IsValid_ReturnValue3) == 0x00020D, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_SwitchEnum2_CmpSuccess) == 0x00020E, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_CustomEvent_TimelineDirection) == 0x00020F, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_CustomEvent_TimelineDirection' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_SwitchEnum3_CmpSuccess) == 0x000210, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000218, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, K2Node_DynamicCast_bSuccess3) == 0x000228, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000229, "Member 'GC_Husk_Slow_C_ExecuteUbergraph_GC_Husk_Slow::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function GC_Husk_Slow.GC_Husk_Slow_C.Cuff_Unlocked
// 0x0001 (0x0001 - 0x0000)
struct GC_Husk_Slow_C_Cuff_Unlocked final
{
public:
	ETimelineDirection                            TimelineDirection;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Husk_Slow_C_Cuff_Unlocked) == 0x000001, "Wrong alignment on GC_Husk_Slow_C_Cuff_Unlocked");
static_assert(sizeof(GC_Husk_Slow_C_Cuff_Unlocked) == 0x000001, "Wrong size on GC_Husk_Slow_C_Cuff_Unlocked");
static_assert(offsetof(GC_Husk_Slow_C_Cuff_Unlocked, TimelineDirection) == 0x000000, "Member 'GC_Husk_Slow_C_Cuff_Unlocked::TimelineDirection' has a wrong offset!");

// Function GC_Husk_Slow.GC_Husk_Slow_C.Cuff_Locked
// 0x0001 (0x0001 - 0x0000)
struct GC_Husk_Slow_C_Cuff_Locked final
{
public:
	ETimelineDirection                            TimelineDirection;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Husk_Slow_C_Cuff_Locked) == 0x000001, "Wrong alignment on GC_Husk_Slow_C_Cuff_Locked");
static_assert(sizeof(GC_Husk_Slow_C_Cuff_Locked) == 0x000001, "Wrong size on GC_Husk_Slow_C_Cuff_Locked");
static_assert(offsetof(GC_Husk_Slow_C_Cuff_Locked, TimelineDirection) == 0x000000, "Member 'GC_Husk_Slow_C_Cuff_Locked::TimelineDirection' has a wrong offset!");

// Function GC_Husk_Slow.GC_Husk_Slow_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_Husk_Slow_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Husk_Slow_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_Husk_Slow_C_ReceiveTick");
static_assert(sizeof(GC_Husk_Slow_C_ReceiveTick) == 0x000004, "Wrong size on GC_Husk_Slow_C_ReceiveTick");
static_assert(offsetof(GC_Husk_Slow_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_Husk_Slow_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GC_Husk_Slow.GC_Husk_Slow_C.K2_HandleGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct GC_Husk_Slow_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Husk_Slow_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_Husk_Slow_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_Husk_Slow_C_K2_HandleGameplayCue) == 0x0000C8, "Wrong size on GC_Husk_Slow_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_Husk_Slow_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_Husk_Slow_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_Husk_Slow_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_Husk_Slow_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GC_Husk_Slow.GC_Husk_Slow_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct GC_Husk_Slow_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Husk_Slow_C_UserConstructionScript) == 0x000008, "Wrong alignment on GC_Husk_Slow_C_UserConstructionScript");
static_assert(sizeof(GC_Husk_Slow_C_UserConstructionScript) == 0x000020, "Wrong size on GC_Husk_Slow_C_UserConstructionScript");
static_assert(offsetof(GC_Husk_Slow_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'GC_Husk_Slow_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'GC_Husk_Slow_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000010, "Member 'GC_Husk_Slow_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Husk_Slow_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000018, "Member 'GC_Husk_Slow_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");

}

