#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Melee_Edged_Sword_LeapAttack_Impact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Melee_Edged_Sword_LeapAttack_Impact.GC_Melee_Edged_Sword_LeapAttack_Impact_C.OnExecute
// 0x0128 (0x0128 - 0x0000)
struct GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Select_Default;                             // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute) == 0x000008, "Wrong alignment on GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute");
static_assert(sizeof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute) == 0x000128, "Wrong size on GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, ReturnValue) == 0x0000C0, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, Temp_bool_Variable) == 0x0000C1, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000C2, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, K2Node_DynamicCast_AsFort_Pawn) == 0x0000C8, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D4, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000E0, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000EC, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, K2Node_Select_Default) == 0x0000F8, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_BreakRotator_Roll) == 0x000104, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_BreakRotator_Pitch) == 0x000108, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_BreakRotator_Yaw) == 0x00010C, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_MakeRotator_ReturnValue) == 0x000110, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000120, "Member 'GC_Melee_Edged_Sword_LeapAttack_Impact_C_OnExecute::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

