#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_NPC_Elemental_Ice

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_NPC_Elemental_Ice.GC_NPC_Elemental_Ice_C.ExecuteUbergraph_GC_NPC_Elemental_Ice
// 0x0340 (0x0340 - 0x0000)
struct GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyPawn_Parent_C*                    K2Node_DynamicCast_AsEnemy_Pawn_Parent;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0xC];                                      // 0x0144(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0150(0x0080)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue1;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x01D8(0x0010)(ZeroConstructor, ReferenceParm)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam1;               // 0x01F0(0x0080)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x0280(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue1;        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array1;                           // 0x0308(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice) == 0x000010, "Wrong alignment on GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice");
static_assert(sizeof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice) == 0x000340, "Wrong size on GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, EntryPoint) == 0x000000, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_RandomFloat_ReturnValue) == 0x000004, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_Event_MyTarget) == 0x000008, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_Event_EventType) == 0x000010, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_Event_Parameters) == 0x000018, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_SwitchEnum_CmpSuccess) == 0x0000D0, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_DynamicCast_AsEnemy_Pawn_Parent) == 0x0000D8, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_DynamicCast_AsEnemy_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Array_AddUnique_ReturnValue) == 0x0000E4, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_DynamicCast_AsMesh_Component) == 0x0000F8, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_DynamicCast_bSuccess1) == 0x000100, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Greater_IntInt_ReturnValue) == 0x000101, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000102, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_GetComponentBounds_Origin) == 0x000104, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_GetComponentBounds_BoxExtent) == 0x000110, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_GetComponentBounds_SphereRadius) == 0x00011C, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000120, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00012C, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Add_VectorVector_ReturnValue) == 0x000138, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_MakeStruct_ParticleSysParam) == 0x000150, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Array_AddUnique_ReturnValue1) == 0x0001D0, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Array_AddUnique_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_MakeArray_Array) == 0x0001D8, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001E8, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_MakeStruct_ParticleSysParam1) == 0x0001F0, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_MakeStruct_ParticleSysParam1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_GetOwner_ReturnValue) == 0x000270, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_MakeStruct_ParticleSysParam2) == 0x000280, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_K2_AttachToComponent_ReturnValue1) == 0x000300, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_K2_AttachToComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, K2Node_MakeArray_Array1) == 0x000308, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000318, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_Conv_LinearColorToVector_ReturnValue1) == 0x000324, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_Conv_LinearColorToVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice, CallFunc_IsDedicatedServer_ReturnValue) == 0x000330, "Member 'GC_NPC_Elemental_Ice_C_ExecuteUbergraph_GC_NPC_Elemental_Ice::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function GC_NPC_Elemental_Ice.GC_NPC_Elemental_Ice_C.K2_HandleGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue");
static_assert(sizeof(GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue) == 0x0000C8, "Wrong size on GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GC_NPC_Elemental_Ice_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

// Function GC_NPC_Elemental_Ice.GC_NPC_Elemental_Ice_C.OnRemove
// 0x00D8 (0x00D8 - 0x0000)
struct GC_NPC_Elemental_Ice_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyPawn_Parent_C*                    K2Node_DynamicCast_AsEnemy_Pawn_Parent;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_NPC_Elemental_Ice_C_OnRemove) == 0x000008, "Wrong alignment on GC_NPC_Elemental_Ice_C_OnRemove");
static_assert(sizeof(GC_NPC_Elemental_Ice_C_OnRemove) == 0x0000D8, "Wrong size on GC_NPC_Elemental_Ice_C_OnRemove");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, Parameters) == 0x000008, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, K2Node_DynamicCast_AsEnemy_Pawn_Parent) == 0x0000C8, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::K2Node_DynamicCast_AsEnemy_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000D2, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_OnRemove, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D3, "Member 'GC_NPC_Elemental_Ice_C_OnRemove::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function GC_NPC_Elemental_Ice.GC_NPC_Elemental_Ice_C.Death FX Setup
// 0x0010 (0x0010 - 0x0000)
struct GC_NPC_Elemental_Ice_C_Death_FX_Setup final
{
public:
	bool                                          Remove;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyPawn_Parent_C*                    Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_NPC_Elemental_Ice_C_Death_FX_Setup) == 0x000008, "Wrong alignment on GC_NPC_Elemental_Ice_C_Death_FX_Setup");
static_assert(sizeof(GC_NPC_Elemental_Ice_C_Death_FX_Setup) == 0x000010, "Wrong size on GC_NPC_Elemental_Ice_C_Death_FX_Setup");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_Death_FX_Setup, Remove) == 0x000000, "Member 'GC_NPC_Elemental_Ice_C_Death_FX_Setup::Remove' has a wrong offset!");
static_assert(offsetof(GC_NPC_Elemental_Ice_C_Death_FX_Setup, Pawn) == 0x000008, "Member 'GC_NPC_Elemental_Ice_C_Death_FX_Setup::Pawn' has a wrong offset!");

}

