#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Ninja_MantisLeap_activationFX

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Ninja_MantisLeap_activationFX.GC_Ninja_MantisLeap_ActivationFX_C
// 0x0028 (0x00A8 - 0x0080)
class UGC_Ninja_MantisLeap_ActivationFX_C final : public UFortGameplayCueNotify_Simple
{
public:
	class UParticleSystem*                        MantisLeapEffect;                                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FootSocketL;                                       // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FootSocketR;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MantisLeapCue;                                     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   MantisLeapForceFeedback;                           // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Ninja_MantisLeap_ActivationFX_C">();
	}
	static class UGC_Ninja_MantisLeap_ActivationFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGC_Ninja_MantisLeap_ActivationFX_C>();
	}
};
static_assert(alignof(UGC_Ninja_MantisLeap_ActivationFX_C) == 0x000008, "Wrong alignment on UGC_Ninja_MantisLeap_ActivationFX_C");
static_assert(sizeof(UGC_Ninja_MantisLeap_ActivationFX_C) == 0x0000A8, "Wrong size on UGC_Ninja_MantisLeap_ActivationFX_C");
static_assert(offsetof(UGC_Ninja_MantisLeap_ActivationFX_C, MantisLeapEffect) == 0x000080, "Member 'UGC_Ninja_MantisLeap_ActivationFX_C::MantisLeapEffect' has a wrong offset!");
static_assert(offsetof(UGC_Ninja_MantisLeap_ActivationFX_C, FootSocketL) == 0x000088, "Member 'UGC_Ninja_MantisLeap_ActivationFX_C::FootSocketL' has a wrong offset!");
static_assert(offsetof(UGC_Ninja_MantisLeap_ActivationFX_C, FootSocketR) == 0x000090, "Member 'UGC_Ninja_MantisLeap_ActivationFX_C::FootSocketR' has a wrong offset!");
static_assert(offsetof(UGC_Ninja_MantisLeap_ActivationFX_C, MantisLeapCue) == 0x000098, "Member 'UGC_Ninja_MantisLeap_ActivationFX_C::MantisLeapCue' has a wrong offset!");
static_assert(offsetof(UGC_Ninja_MantisLeap_ActivationFX_C, MantisLeapForceFeedback) == 0x0000A0, "Member 'UGC_Ninja_MantisLeap_ActivationFX_C::MantisLeapForceFeedback' has a wrong offset!");

}

