#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Outlander_Phaseshift_AppliedFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Outlander_Phaseshift_AppliedFX.GC_Outlander_Phaseshift_AppliedFX_C
// 0x00B0 (0x0930 - 0x0880)
class AGC_Outlander_Phaseshift_AppliedFX_C : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  Teleport_PostProcess;                              // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Teleport_PP_TL_PP_6347A40E47BF409410B4188DE9502B23; // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Teleport_PP_TL__Direction_6347A40E47BF409410B4188DE9502B23; // 0x0894(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_895[0x3];                                      // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Teleport_PP_TL;                                    // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Phase_Shift_Activation_Timeline_Sweep_6835A456414AB2F2B480A5A3FF3B8FB9; // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Phase_Shift_Activation_Timeline_Opacity_6835A456414AB2F2B480A5A3FF3B8FB9; // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Phase_Shift_Activation_Timeline__Direction_6835A456414AB2F2B480A5A3FF3B8FB9; // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Phase_Shift_Activation_Timeline;                   // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Phase_Shift_Material;                              // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Dust_Emitters;                                     // 0x08C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class ABP_SplineVolumeTrail_v1b_C*            TeleportSpline;                                    // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         DuplicateMeshes;                                   // 0x08D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          UseSpawnSplineActor;                               // 0x08E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       Duplicate_MIDs;                                    // 0x08F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class USkeletalMeshComponent*                 Duplicate_Head;                                    // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Body;                                    // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Hat;                                     // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Backpack;                                // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Charm;                                   // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Duplicate_Face;                                    // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Outlander_Phaseshift_AppliedFX(int32 EntryPoint);
	void Stop_Splines_if_Valid();
	void Spawn_Spline_Actor(class AFortPlayerPawn* Player_Pawn);
	void Remove_PP();
	void Activate_PP();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void Teleport_PP_TL__UpdateFunc();
	void Teleport_PP_TL__FinishedFunc();
	void Phase_Shift_Activation_Timeline__UpdateFunc();
	void Phase_Shift_Activation_Timeline__FinishedFunc();
	void UserConstructionScript();
	void Duplicate_Character_Meshes(class AFortPlayerPawn* Pawn);
	void Destroy_Duplicate_Character_Meshes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Outlander_Phaseshift_AppliedFX_C">();
	}
	static class AGC_Outlander_Phaseshift_AppliedFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Outlander_Phaseshift_AppliedFX_C>();
	}
};
static_assert(alignof(AGC_Outlander_Phaseshift_AppliedFX_C) == 0x000008, "Wrong alignment on AGC_Outlander_Phaseshift_AppliedFX_C");
static_assert(sizeof(AGC_Outlander_Phaseshift_AppliedFX_C) == 0x000930, "Wrong size on AGC_Outlander_Phaseshift_AppliedFX_C");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, UberGraphFrame) == 0x000880, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Teleport_PostProcess) == 0x000888, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Teleport_PostProcess' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Teleport_PP_TL_PP_6347A40E47BF409410B4188DE9502B23) == 0x000890, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Teleport_PP_TL_PP_6347A40E47BF409410B4188DE9502B23' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Teleport_PP_TL__Direction_6347A40E47BF409410B4188DE9502B23) == 0x000894, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Teleport_PP_TL__Direction_6347A40E47BF409410B4188DE9502B23' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Teleport_PP_TL) == 0x000898, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Teleport_PP_TL' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Phase_Shift_Activation_Timeline_Sweep_6835A456414AB2F2B480A5A3FF3B8FB9) == 0x0008A0, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Phase_Shift_Activation_Timeline_Sweep_6835A456414AB2F2B480A5A3FF3B8FB9' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Phase_Shift_Activation_Timeline_Opacity_6835A456414AB2F2B480A5A3FF3B8FB9) == 0x0008A4, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Phase_Shift_Activation_Timeline_Opacity_6835A456414AB2F2B480A5A3FF3B8FB9' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Phase_Shift_Activation_Timeline__Direction_6835A456414AB2F2B480A5A3FF3B8FB9) == 0x0008A8, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Phase_Shift_Activation_Timeline__Direction_6835A456414AB2F2B480A5A3FF3B8FB9' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Phase_Shift_Activation_Timeline) == 0x0008B0, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Phase_Shift_Activation_Timeline' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Phase_Shift_Material) == 0x0008B8, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Phase_Shift_Material' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Dust_Emitters) == 0x0008C0, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Dust_Emitters' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, TeleportSpline) == 0x0008D0, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::TeleportSpline' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, DuplicateMeshes) == 0x0008D8, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::DuplicateMeshes' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, UseSpawnSplineActor) == 0x0008E8, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::UseSpawnSplineActor' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_MIDs) == 0x0008F0, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_MIDs' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_Head) == 0x000900, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_Head' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_Body) == 0x000908, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_Body' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_Hat) == 0x000910, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_Hat' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_Backpack) == 0x000918, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_Backpack' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_Charm) == 0x000920, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_Charm' has a wrong offset!");
static_assert(offsetof(AGC_Outlander_Phaseshift_AppliedFX_C, Duplicate_Face) == 0x000928, "Member 'AGC_Outlander_Phaseshift_AppliedFX_C::Duplicate_Face' has a wrong offset!");

}

