#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Perk_Assassination_Active

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Perk_Assassination_Active.GC_Perk_Assassination_Active_C.ExecuteUbergraph_GC_Perk_Assassination_Active
// 0x01F0 (0x01F0 - 0x0000)
struct GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters1;                          // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents1;                  // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents1;                     // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0100(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active) == 0x000008, "Wrong alignment on GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active");
static_assert(sizeof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active) == 0x0001F0, "Wrong size on GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, EntryPoint) == 0x000000, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_MyTarget1) == 0x000008, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_MyTarget1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_Parameters1) == 0x000010, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_Parameters1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_ParticleComponents1) == 0x0000C8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_ParticleComponents1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_AudioComponents1) == 0x0000D8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_AudioComponents1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, CallFunc_IsValid_ReturnValue1) == 0x0000F0, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_MyTarget) == 0x0000F8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_Parameters) == 0x000100, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_ParticleComponents) == 0x0001B8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_AudioComponents) == 0x0001C8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_BurstCameraShakeInstance) == 0x0001D8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, K2Node_Event_BurstDecalInstance) == 0x0001E0, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active, CallFunc_IsValid_ReturnValue2) == 0x0001E8, "Member 'GC_Perk_Assassination_Active_C_ExecuteUbergraph_GC_Perk_Assassination_Active::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function GC_Perk_Assassination_Active.GC_Perk_Assassination_Active_C.OnApplication
// 0x00F0 (0x00F0 - 0x0000)
struct GC_Perk_Assassination_Active_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Perk_Assassination_Active_C_OnApplication) == 0x000008, "Wrong alignment on GC_Perk_Assassination_Active_C_OnApplication");
static_assert(sizeof(GC_Perk_Assassination_Active_C_OnApplication) == 0x0000F0, "Wrong size on GC_Perk_Assassination_Active_C_OnApplication");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnApplication, MyTarget) == 0x000000, "Member 'GC_Perk_Assassination_Active_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Perk_Assassination_Active_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnApplication, ParticleComponents) == 0x0000C0, "Member 'GC_Perk_Assassination_Active_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnApplication, AudioComponents) == 0x0000D0, "Member 'GC_Perk_Assassination_Active_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnApplication, BurstCameraShakeInstance) == 0x0000E0, "Member 'GC_Perk_Assassination_Active_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnApplication, BurstDecalInstance) == 0x0000E8, "Member 'GC_Perk_Assassination_Active_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GC_Perk_Assassination_Active.GC_Perk_Assassination_Active_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GC_Perk_Assassination_Active_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GC_Perk_Assassination_Active_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Perk_Assassination_Active_C_OnLoopingStart");
static_assert(sizeof(GC_Perk_Assassination_Active_C_OnLoopingStart) == 0x0000E0, "Wrong size on GC_Perk_Assassination_Active_C_OnLoopingStart");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GC_Perk_Assassination_Active_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Perk_Assassination_Active_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GC_Perk_Assassination_Active_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GC_Perk_Assassination_Active_C_OnLoopingStart::AudioComponents' has a wrong offset!");

// Function GC_Perk_Assassination_Active.GC_Perk_Assassination_Active_C.HandleFX
// 0x0070 (0x0070 - 0x0000)
struct GC_Perk_Assassination_Active_C_HandleFX final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue1;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Perk_Assassination_Active_C_HandleFX) == 0x000008, "Wrong alignment on GC_Perk_Assassination_Active_C_HandleFX");
static_assert(sizeof(GC_Perk_Assassination_Active_C_HandleFX) == 0x000070, "Wrong size on GC_Perk_Assassination_Active_C_HandleFX");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, Target) == 0x000000, "Member 'GC_Perk_Assassination_Active_C_HandleFX::Target' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, ParticleSystem) == 0x000008, "Member 'GC_Perk_Assassination_Active_C_HandleFX::ParticleSystem' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000028, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_SelectFloat_ReturnValue) == 0x00002C, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000030, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000040, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_FTrunc_ReturnValue) == 0x000044, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x00004C, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000050, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Lerp_ReturnValue) == 0x000054, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000058, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_FClamp_ReturnValue1) == 0x000064, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_FClamp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000068, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Perk_Assassination_Active_C_HandleFX, CallFunc_GetGameplayEffectCount_ReturnValue1) == 0x00006C, "Member 'GC_Perk_Assassination_Active_C_HandleFX::CallFunc_GetGameplayEffectCount_ReturnValue1' has a wrong offset!");

}

