#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Perk_FourOnTheFloor_MainDrums

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Perk_FourOnTheFloor_MainDrums.GC_Perk_FourOnTheFloor_MainDrums_C
// 0x0020 (0x08A0 - 0x0880)
class AGC_Perk_FourOnTheFloor_MainDrums_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        LoopingDrumsRef;                                   // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EndingSound;                                       // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LoopingSound;                                      // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Perk_FourOnTheFloor_MainDrums(int32 EntryPoint);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Perk_FourOnTheFloor_MainDrums_C">();
	}
	static class AGC_Perk_FourOnTheFloor_MainDrums_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Perk_FourOnTheFloor_MainDrums_C>();
	}
};
static_assert(alignof(AGC_Perk_FourOnTheFloor_MainDrums_C) == 0x000008, "Wrong alignment on AGC_Perk_FourOnTheFloor_MainDrums_C");
static_assert(sizeof(AGC_Perk_FourOnTheFloor_MainDrums_C) == 0x0008A0, "Wrong size on AGC_Perk_FourOnTheFloor_MainDrums_C");
static_assert(offsetof(AGC_Perk_FourOnTheFloor_MainDrums_C, UberGraphFrame) == 0x000880, "Member 'AGC_Perk_FourOnTheFloor_MainDrums_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Perk_FourOnTheFloor_MainDrums_C, LoopingDrumsRef) == 0x000888, "Member 'AGC_Perk_FourOnTheFloor_MainDrums_C::LoopingDrumsRef' has a wrong offset!");
static_assert(offsetof(AGC_Perk_FourOnTheFloor_MainDrums_C, EndingSound) == 0x000890, "Member 'AGC_Perk_FourOnTheFloor_MainDrums_C::EndingSound' has a wrong offset!");
static_assert(offsetof(AGC_Perk_FourOnTheFloor_MainDrums_C, LoopingSound) == 0x000898, "Member 'AGC_Perk_FourOnTheFloor_MainDrums_C::LoopingSound' has a wrong offset!");

}

