#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SpecialEvent_Halloween_PumpkinHead

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_SpecialEvent_Halloween_PumpkinHead.GC_SpecialEvent_Halloween_PumpkinHead_C.OnActive
// 0x00E8 (0x00E8 - 0x0000)
struct GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyPawn_Parent_C*                    K2Node_DynamicCast_AsEnemy_Pawn_Parent;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive) == 0x000008, "Wrong alignment on GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive");
static_assert(sizeof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive) == 0x0000E8, "Wrong size on GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, MyTarget) == 0x000000, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, Parameters) == 0x000008, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, K2Node_DynamicCast_AsEnemy_Pawn_Parent) == 0x0000C8, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::K2Node_DynamicCast_AsEnemy_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000D1, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D8, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000E0, "Member 'GC_SpecialEvent_Halloween_PumpkinHead_C_OnActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

}

