#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_MedicPack_Healing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCL_MedicPack_Healing.GCL_MedicPack_Healing_C
// 0x00B8 (0x04E0 - 0x0428)
class AGCL_MedicPack_Healing_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Jetpack_Audio_Modulation_Fuel_E6BF5E374A75EF92C9BA39AD2DF18C25; // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Jetpack_Audio_Modulation__Direction_E6BF5E374A75EF92C9BA39AD2DF18C25; // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Jetpack_Audio_Modulation;                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedParticleEmitter;                            // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bJetpackAudioEnabled;                              // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnStart;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnStop;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnIdle;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnAccel;                                  // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnIdleAudio_Comp;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnAccelAudio_Comp;                                 // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnOutOfFuel;                              // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnOutOfFuelAudio_Comp;                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetFuelVolumeMultiplier;                        // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentFuelVolumeMultiplier;                       // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFuelWarning;                                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnOutOfFuel;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnThrust;                                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayedFuelWarning;                                // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsFirstJump;                                      // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BA[0x2];                                      // 0x04BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JetpackActivatedTime;                              // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedFuelPercent;                                 // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedRenderingDetailMode;                         // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleMultiplier;                                   // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FXScale;                                           // 0x04CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        AOE_Heal_FX;                                       // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCL_MedicPack_Healing(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void On_Pawn_Landed(const struct FHitResult& Hit);
	void Audio_Tick();
	void Jetpack_Audio_Modulation__FuelWarning__EventFunc();
	void Jetpack_Audio_Modulation__UpdateFunc();
	void Jetpack_Audio_Modulation__FinishedFunc();
	void UserConstructionScript();
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void SetJetpackAudioEnabled(bool Enabled);
	void CacheAttributes();
	void GetFuelPercent(float* FuelPercent);
	float GetFuel();
	float GetMaxFuel();
	void CalculateFuelPercentage();
	void CacheRenderingDetailMode();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCL_MedicPack_Healing_C">();
	}
	static class AGCL_MedicPack_Healing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCL_MedicPack_Healing_C>();
	}
};
static_assert(alignof(AGCL_MedicPack_Healing_C) == 0x000008, "Wrong alignment on AGCL_MedicPack_Healing_C");
static_assert(sizeof(AGCL_MedicPack_Healing_C) == 0x0004E0, "Wrong size on AGCL_MedicPack_Healing_C");
static_assert(offsetof(AGCL_MedicPack_Healing_C, UberGraphFrame) == 0x000428, "Member 'AGCL_MedicPack_Healing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, Jetpack_Audio_Modulation_Fuel_E6BF5E374A75EF92C9BA39AD2DF18C25) == 0x000430, "Member 'AGCL_MedicPack_Healing_C::Jetpack_Audio_Modulation_Fuel_E6BF5E374A75EF92C9BA39AD2DF18C25' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, Jetpack_Audio_Modulation__Direction_E6BF5E374A75EF92C9BA39AD2DF18C25) == 0x000434, "Member 'AGCL_MedicPack_Healing_C::Jetpack_Audio_Modulation__Direction_E6BF5E374A75EF92C9BA39AD2DF18C25' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, Jetpack_Audio_Modulation) == 0x000438, "Member 'AGCL_MedicPack_Healing_C::Jetpack_Audio_Modulation' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SpawnedParticleEmitter) == 0x000440, "Member 'AGCL_MedicPack_Healing_C::SpawnedParticleEmitter' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, bJetpackAudioEnabled) == 0x000448, "Member 'AGCL_MedicPack_Healing_C::bJetpackAudioEnabled' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundOnStart) == 0x000450, "Member 'AGCL_MedicPack_Healing_C::SoundOnStart' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundOnStop) == 0x000458, "Member 'AGCL_MedicPack_Healing_C::SoundOnStop' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundLoopOnIdle) == 0x000460, "Member 'AGCL_MedicPack_Healing_C::SoundLoopOnIdle' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundLoopOnAccel) == 0x000468, "Member 'AGCL_MedicPack_Healing_C::SoundLoopOnAccel' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, OnIdleAudio_Comp) == 0x000470, "Member 'AGCL_MedicPack_Healing_C::OnIdleAudio_Comp' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, OnAccelAudio_Comp) == 0x000478, "Member 'AGCL_MedicPack_Healing_C::OnAccelAudio_Comp' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, PlayerPawn) == 0x000480, "Member 'AGCL_MedicPack_Healing_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundLoopOnOutOfFuel) == 0x000488, "Member 'AGCL_MedicPack_Healing_C::SoundLoopOnOutOfFuel' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, OnOutOfFuelAudio_Comp) == 0x000490, "Member 'AGCL_MedicPack_Healing_C::OnOutOfFuelAudio_Comp' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, TargetFuelVolumeMultiplier) == 0x000498, "Member 'AGCL_MedicPack_Healing_C::TargetFuelVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, CurrentFuelVolumeMultiplier) == 0x00049C, "Member 'AGCL_MedicPack_Healing_C::CurrentFuelVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundOnFuelWarning) == 0x0004A0, "Member 'AGCL_MedicPack_Healing_C::SoundOnFuelWarning' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundOnOutOfFuel) == 0x0004A8, "Member 'AGCL_MedicPack_Healing_C::SoundOnOutOfFuel' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, SoundOnThrust) == 0x0004B0, "Member 'AGCL_MedicPack_Healing_C::SoundOnThrust' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, bPlayedFuelWarning) == 0x0004B8, "Member 'AGCL_MedicPack_Healing_C::bPlayedFuelWarning' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, bIsFirstJump) == 0x0004B9, "Member 'AGCL_MedicPack_Healing_C::bIsFirstJump' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, JetpackActivatedTime) == 0x0004BC, "Member 'AGCL_MedicPack_Healing_C::JetpackActivatedTime' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, CachedFuelPercent) == 0x0004C0, "Member 'AGCL_MedicPack_Healing_C::CachedFuelPercent' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, CachedRenderingDetailMode) == 0x0004C4, "Member 'AGCL_MedicPack_Healing_C::CachedRenderingDetailMode' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, ScaleMultiplier) == 0x0004C8, "Member 'AGCL_MedicPack_Healing_C::ScaleMultiplier' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, FXScale) == 0x0004CC, "Member 'AGCL_MedicPack_Healing_C::FXScale' has a wrong offset!");
static_assert(offsetof(AGCL_MedicPack_Healing_C, AOE_Heal_FX) == 0x0004D8, "Member 'AGCL_MedicPack_Healing_C::AOE_Heal_FX' has a wrong offset!");

}

