#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_IntelPack_Highlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCL_IntelPack_Highlight.GCL_IntelPack_Highlight_C.ExecuteUbergraph_GCL_IntelPack_Highlight
// 0x00C0 (0x00C0 - 0x0000)
struct GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingContainer*                     K2Node_DynamicCast_AsBuilding_Container;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PickedUp_ReturnValue;                     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight) == 0x000008, "Wrong alignment on GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight");
static_assert(sizeof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight) == 0x0000C0, "Wrong size on GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, EntryPoint) == 0x000000, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_Event_EndPlayReason) == 0x000010, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000014, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_GetComponentBounds_Origin) == 0x00002C, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_GetComponentBounds_BoxExtent) == 0x000038, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_GetComponentBounds_SphereRadius) == 0x000044, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00004C, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_DynamicCast_AsFort_Pickup) == 0x000070, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_DynamicCast_AsBuilding_Container) == 0x000080, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_DynamicCast_AsBuilding_Container' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_DynamicCast_bSuccess1) == 0x000088, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_PickedUp_ReturnValue) == 0x000089, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_PickedUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_DynamicCast_AsFort_Pawn) == 0x000090, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, K2Node_DynamicCast_bSuccess2) == 0x000098, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_IsValid_ReturnValue1) == 0x000099, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_IsDead_ReturnValue) == 0x00009A, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00009C, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000A8, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight, CallFunc_GetOwner_ReturnValue) == 0x0000B8, "Member 'GCL_IntelPack_Highlight_C_ExecuteUbergraph_GCL_IntelPack_Highlight::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

// Function GCL_IntelPack_Highlight.GCL_IntelPack_Highlight_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct GCL_IntelPack_Highlight_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCL_IntelPack_Highlight_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on GCL_IntelPack_Highlight_C_ReceiveEndPlay");
static_assert(sizeof(GCL_IntelPack_Highlight_C_ReceiveEndPlay) == 0x000001, "Wrong size on GCL_IntelPack_Highlight_C_ReceiveEndPlay");
static_assert(offsetof(GCL_IntelPack_Highlight_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'GCL_IntelPack_Highlight_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

