#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_Athena_Carrot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCL_Athena_Carrot.GCL_Athena_Carrot_C
// 0x0020 (0x08A0 - 0x0880)
class AGCL_Athena_Carrot_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_171D7FAA42724A6BBDB147806C9E9DCE; // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_171D7FAA42724A6BBDB147806C9E9DCE; // 0x0894(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_895[0x3];                                      // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCL_Athena_Carrot(int32 EntryPoint);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCL_Athena_Carrot_C">();
	}
	static class AGCL_Athena_Carrot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCL_Athena_Carrot_C>();
	}
};
static_assert(alignof(AGCL_Athena_Carrot_C) == 0x000008, "Wrong alignment on AGCL_Athena_Carrot_C");
static_assert(sizeof(AGCL_Athena_Carrot_C) == 0x0008A0, "Wrong size on AGCL_Athena_Carrot_C");
static_assert(offsetof(AGCL_Athena_Carrot_C, UberGraphFrame) == 0x000880, "Member 'AGCL_Athena_Carrot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCL_Athena_Carrot_C, PostProcess) == 0x000888, "Member 'AGCL_Athena_Carrot_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCL_Athena_Carrot_C, Timeline_0_NewTrack_0_171D7FAA42724A6BBDB147806C9E9DCE) == 0x000890, "Member 'AGCL_Athena_Carrot_C::Timeline_0_NewTrack_0_171D7FAA42724A6BBDB147806C9E9DCE' has a wrong offset!");
static_assert(offsetof(AGCL_Athena_Carrot_C, Timeline_0__Direction_171D7FAA42724A6BBDB147806C9E9DCE) == 0x000894, "Member 'AGCL_Athena_Carrot_C::Timeline_0__Direction_171D7FAA42724A6BBDB147806C9E9DCE' has a wrong offset!");
static_assert(offsetof(AGCL_Athena_Carrot_C, Timeline_0) == 0x000898, "Member 'AGCL_Athena_Carrot_C::Timeline_0' has a wrong offset!");

}

