#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Outlander_GroundWave_ReturnToSender

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Outlander_GroundWave_ReturnToSender.GCN_Outlander_GroundWave_ReturnToSender_C.OnExecute
// 0x00E8 (0x00E8 - 0x0000)
struct GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute) == 0x000008, "Wrong alignment on GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute");
static_assert(sizeof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute) == 0x0000E8, "Wrong size on GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, ReturnValue) == 0x0000C0, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000C1, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, CallFunc_MakeRotFromX_ReturnValue) == 0x0000C4, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000E0, "Member 'GCN_Outlander_GroundWave_ReturnToSender_C_OnExecute::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

