#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Hoverboard_Strait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Hoverboard_Strait.GCN_Hoverboard_Strait_C
// 0x0070 (0x0410 - 0x03A0)
class AGCN_Hoverboard_Strait_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Generic_C*                  ActivatingPlayer;                                  // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SND_HoverboardLoop;                                // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SND_HoverboardSound_Accelerate;                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SND_HoverboardStart;                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_HoverboardComponent;                            // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BoostFX;                                           // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LSmokeTrail;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RSmokeTrail;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrap_Floor_Hoverboard_Speed_C*         ActivatedTrap;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Trigger_LensEffectEmitterClass;                    // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TrapFireSoundAttached;                             // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Hoverboard_Strait(int32 EntryPoint);
	void OnActivate();
	void UserConstructionScript();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Hoverboard_Strait_C">();
	}
	static class AGCN_Hoverboard_Strait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Hoverboard_Strait_C>();
	}
};
static_assert(alignof(AGCN_Hoverboard_Strait_C) == 0x000008, "Wrong alignment on AGCN_Hoverboard_Strait_C");
static_assert(sizeof(AGCN_Hoverboard_Strait_C) == 0x000410, "Wrong size on AGCN_Hoverboard_Strait_C");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, UberGraphFrame) == 0x0003A0, "Member 'AGCN_Hoverboard_Strait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, DefaultSceneRoot) == 0x0003A8, "Member 'AGCN_Hoverboard_Strait_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, ActivatingPlayer) == 0x0003B0, "Member 'AGCN_Hoverboard_Strait_C::ActivatingPlayer' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, SND_HoverboardLoop) == 0x0003B8, "Member 'AGCN_Hoverboard_Strait_C::SND_HoverboardLoop' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, SND_HoverboardSound_Accelerate) == 0x0003C0, "Member 'AGCN_Hoverboard_Strait_C::SND_HoverboardSound_Accelerate' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, SND_HoverboardStart) == 0x0003C8, "Member 'AGCN_Hoverboard_Strait_C::SND_HoverboardStart' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, SK_HoverboardComponent) == 0x0003D0, "Member 'AGCN_Hoverboard_Strait_C::SK_HoverboardComponent' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, IdleFX) == 0x0003D8, "Member 'AGCN_Hoverboard_Strait_C::IdleFX' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, BoostFX) == 0x0003E0, "Member 'AGCN_Hoverboard_Strait_C::BoostFX' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, LSmokeTrail) == 0x0003E8, "Member 'AGCN_Hoverboard_Strait_C::LSmokeTrail' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, RSmokeTrail) == 0x0003F0, "Member 'AGCN_Hoverboard_Strait_C::RSmokeTrail' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, ActivatedTrap) == 0x0003F8, "Member 'AGCN_Hoverboard_Strait_C::ActivatedTrap' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, Trigger_LensEffectEmitterClass) == 0x000400, "Member 'AGCN_Hoverboard_Strait_C::Trigger_LensEffectEmitterClass' has a wrong offset!");
static_assert(offsetof(AGCN_Hoverboard_Strait_C, TrapFireSoundAttached) == 0x000408, "Member 'AGCN_Hoverboard_Strait_C::TrapFireSoundAttached' has a wrong offset!");

}

