#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_RefinedRift_Teleport

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_RefinedRift_Teleport.GCN_RefinedRift_Teleport_C.OnActive
// 0x00C8 (0x00C8 - 0x0000)
struct GCN_RefinedRift_Teleport_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_RefinedRift_Teleport_C_OnActive) == 0x000008, "Wrong alignment on GCN_RefinedRift_Teleport_C_OnActive");
static_assert(sizeof(GCN_RefinedRift_Teleport_C_OnActive) == 0x0000C8, "Wrong size on GCN_RefinedRift_Teleport_C_OnActive");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnActive, MyTarget) == 0x000000, "Member 'GCN_RefinedRift_Teleport_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnActive, Parameters) == 0x000008, "Member 'GCN_RefinedRift_Teleport_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GCN_RefinedRift_Teleport_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000C1, "Member 'GCN_RefinedRift_Teleport_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");

// Function GCN_RefinedRift_Teleport.GCN_RefinedRift_Teleport_C.OnStartParticleSystemSpawned
// 0x00C0 (0x00C0 - 0x0000)
struct GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned final
{
public:
	class UParticleSystemComponent*               SpawnedParticleSysComponent;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned) == 0x000008, "Wrong alignment on GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned");
static_assert(sizeof(GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned) == 0x0000C0, "Wrong size on GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned, SpawnedParticleSysComponent) == 0x000000, "Member 'GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned::SpawnedParticleSysComponent' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned, Parameters) == 0x000008, "Member 'GCN_RefinedRift_Teleport_C_OnStartParticleSystemSpawned::Parameters' has a wrong offset!");

// Function GCN_RefinedRift_Teleport.GCN_RefinedRift_Teleport_C.OnBurst
// 0x0138 (0x0138 - 0x0000)
struct GCN_RefinedRift_Teleport_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_RefinedRift_Teleport_C_OnBurst) == 0x000008, "Wrong alignment on GCN_RefinedRift_Teleport_C_OnBurst");
static_assert(sizeof(GCN_RefinedRift_Teleport_C_OnBurst) == 0x000138, "Wrong size on GCN_RefinedRift_Teleport_C_OnBurst");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x0000F0, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, K2Node_DynamicCast_AsFort_Pawn) == 0x000100, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_Array_Get_Item) == 0x000110, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_GetViewTarget_ReturnValue) == 0x000120, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000128, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_IsLocallyControlled_ReturnValue) == 0x000129, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_RefinedRift_Teleport_C_OnBurst, CallFunc_Greater_IntInt_ReturnValue) == 0x000130, "Member 'GCN_RefinedRift_Teleport_C_OnBurst::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

