#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_SCMachine_Activate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_SCMachine_Activate.GCN_Athena_SCMachine_Activate_C.OnBurst
// 0x01A8 (0x01A8 - 0x0000)
struct GCN_Athena_SCMachine_Activate_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_Athena_SCMachine_Activate_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Athena_SCMachine_Activate_C_OnBurst");
static_assert(sizeof(GCN_Athena_SCMachine_Activate_C_OnBurst) == 0x0001A8, "Wrong size on GCN_Athena_SCMachine_Activate_C_OnBurst");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_BreakVector_X) == 0x000104, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_BreakVector_Y) == 0x000108, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_BreakVector_Z) == 0x00010C, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x000110, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_SCMachine_Activate_C_OnBurst, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00011C, "Member 'GCN_Athena_SCMachine_Activate_C_OnBurst::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

