#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_C_HitRipple

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_C_HitRipple.GCN_C_HitRipple_C.OnBurst
// 0x0138 (0x0138 - 0x0000)
struct GCN_C_HitRipple_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RawMagnitude;                                      // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue1;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue1;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue2;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item1;                          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue2;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_C_HitRipple_C_OnBurst) == 0x000008, "Wrong alignment on GCN_C_HitRipple_C_OnBurst");
static_assert(sizeof(GCN_C_HitRipple_C_OnBurst) == 0x000138, "Wrong size on GCN_C_HitRipple_C_OnBurst");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_C_HitRipple_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_C_HitRipple_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_C_HitRipple_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_C_HitRipple_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_C_HitRipple_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_C_HitRipple_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, RawMagnitude) == 0x0000F0, "Member 'GCN_C_HitRipple_C_OnBurst::RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000100, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_InRange_FloatFloat_ReturnValue1) == 0x000101, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_InRange_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000104, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Conv_BoolToInt_ReturnValue1) == 0x000108, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Conv_BoolToInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_InRange_FloatFloat_ReturnValue2) == 0x00010C, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_InRange_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Array_Get_Item1) == 0x000110, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Conv_BoolToInt_ReturnValue2) == 0x000118, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Conv_BoolToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Add_IntInt_ReturnValue1) == 0x000120, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_MapRangeClamped_ReturnValue) == 0x000124, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_C_HitRipple_C_OnBurst, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000128, "Member 'GCN_C_HitRipple_C_OnBurst::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");

}

