#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Deimos_Vehicle_GolfCart_HitPlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCN_Deimos_Vehicle_GolfCart_HitPlayer.GCN_Deimos_Vehicle_GolfCart_HitPlayer_C.OnBurst
// 0x01D0 (0x01D0 - 0x0000)
struct GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeimosRift_C*                       K2Node_DynamicCast_AsBP_Deimos_Rift;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0130(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst) == 0x000008, "Wrong alignment on GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst");
static_assert(sizeof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst) == 0x0001D0, "Wrong size on GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, MyTarget) == 0x000000, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, Parameters) == 0x000008, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, ParticleComponents) == 0x0000C0, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, AudioComponents) == 0x0000D0, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, BurstDecalInstance) == 0x0000E8, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, K2Node_DynamicCast_AsBP_Deimos_Rift) == 0x000100, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::K2Node_DynamicCast_AsBP_Deimos_Rift' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_GetSocketLocation_ReturnValue) == 0x00010C, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_FindLookAtRotation_ReturnValue) == 0x000118, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000124, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000130, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_VSize_ReturnValue) == 0x0001B8, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001BC, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst, CallFunc_MakeVector_ReturnValue) == 0x0001C0, "Member 'GCN_Deimos_Vehicle_GolfCart_HitPlayer_C_OnBurst::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

