#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_PoolFloaty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_PoolFloaty.GCN_Athena_PoolFloaty_C.OnRemove
// 0x00C8 (0x00C8 - 0x0000)
struct GCN_Athena_PoolFloaty_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Athena_PoolFloaty_C_OnRemove) == 0x000008, "Wrong alignment on GCN_Athena_PoolFloaty_C_OnRemove");
static_assert(sizeof(GCN_Athena_PoolFloaty_C_OnRemove) == 0x0000C8, "Wrong size on GCN_Athena_PoolFloaty_C_OnRemove");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_OnRemove, MyTarget) == 0x000000, "Member 'GCN_Athena_PoolFloaty_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_OnRemove, Parameters) == 0x000008, "Member 'GCN_Athena_PoolFloaty_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GCN_Athena_PoolFloaty_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GCN_Athena_PoolFloaty.GCN_Athena_PoolFloaty_C.WhileActive
// 0x00C8 (0x00C8 - 0x0000)
struct GCN_Athena_PoolFloaty_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Athena_PoolFloaty_C_WhileActive) == 0x000008, "Wrong alignment on GCN_Athena_PoolFloaty_C_WhileActive");
static_assert(sizeof(GCN_Athena_PoolFloaty_C_WhileActive) == 0x0000C8, "Wrong size on GCN_Athena_PoolFloaty_C_WhileActive");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_WhileActive, MyTarget) == 0x000000, "Member 'GCN_Athena_PoolFloaty_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_WhileActive, Parameters) == 0x000008, "Member 'GCN_Athena_PoolFloaty_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_WhileActive, ReturnValue) == 0x0000C0, "Member 'GCN_Athena_PoolFloaty_C_WhileActive::ReturnValue' has a wrong offset!");

// Function GCN_Athena_PoolFloaty.GCN_Athena_PoolFloaty_C.Activated
// 0x0090 (0x0090 - 0x0000)
struct GCN_Athena_PoolFloaty_C_Activated final
{
public:
	class AActor*                                 Param_PlayerPawn;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0008(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCN_Athena_PoolFloaty_C_Activated) == 0x000008, "Wrong alignment on GCN_Athena_PoolFloaty_C_Activated");
static_assert(sizeof(GCN_Athena_PoolFloaty_C_Activated) == 0x000090, "Wrong size on GCN_Athena_PoolFloaty_C_Activated");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_Activated, Param_PlayerPawn) == 0x000000, "Member 'GCN_Athena_PoolFloaty_C_Activated::Param_PlayerPawn' has a wrong offset!");
static_assert(offsetof(GCN_Athena_PoolFloaty_C_Activated, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000008, "Member 'GCN_Athena_PoolFloaty_C_Activated::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

