#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Constructor_FeelTheBase_Activate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Constructor_FeelTheBase_Activate.GCN_Constructor_FeelTheBase_Activate_C
// 0x0050 (0x00D0 - 0x0080)
class UGCN_Constructor_FeelTheBase_Activate_C final : public UFortGameplayCueNotify_Simple
{
public:
	struct FVector                                FeelTheBaseFXScale;                                // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TurnUpTheBaseFXScale;                              // 0x008C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FeelTheBaseSound;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TurnUpTheBaseSound;                                // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffset;                                    // 0x00A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        FeelTheBase_FX;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        TurnUpTheBase_FX;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatParam;                                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Constructor_FeelTheBase_Activate_C">();
	}
	static class UGCN_Constructor_FeelTheBase_Activate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCN_Constructor_FeelTheBase_Activate_C>();
	}
};
static_assert(alignof(UGCN_Constructor_FeelTheBase_Activate_C) == 0x000008, "Wrong alignment on UGCN_Constructor_FeelTheBase_Activate_C");
static_assert(sizeof(UGCN_Constructor_FeelTheBase_Activate_C) == 0x0000D0, "Wrong size on UGCN_Constructor_FeelTheBase_Activate_C");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, FeelTheBaseFXScale) == 0x000080, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::FeelTheBaseFXScale' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, TurnUpTheBaseFXScale) == 0x00008C, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::TurnUpTheBaseFXScale' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, FeelTheBaseSound) == 0x000098, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::FeelTheBaseSound' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, TurnUpTheBaseSound) == 0x0000A0, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::TurnUpTheBaseSound' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, LocationOffset) == 0x0000A8, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::LocationOffset' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, FeelTheBase_FX) == 0x0000B8, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::FeelTheBase_FX' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, TurnUpTheBase_FX) == 0x0000C0, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::TurnUpTheBase_FX' has a wrong offset!");
static_assert(offsetof(UGCN_Constructor_FeelTheBase_Activate_C, FloatParam) == 0x0000C8, "Member 'UGCN_Constructor_FeelTheBase_Activate_C::FloatParam' has a wrong offset!");

}

