#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_NPC_Ice

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_NPC_Ice.GCN_NPC_Ice_C
// 0x00D0 (0x04F8 - 0x0428)
class AGCN_NPC_Ice_C final : public AFortGameplayCueNotify_Looping
{
public:
	float                                         TransitionOutLength;                               // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FLinearColor>        VectorParameters;                                  // 0x0430(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<class FString, class UMaterialInterface*> Elemental_Mat_Map;                                 // 0x0480(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                        Ice_Particle_Husk;                                 // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Ice_Particle_Player;                               // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Flinger_Ice_Modifier;                              // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_NPC_Ice_C">();
	}
	static class AGCN_NPC_Ice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_NPC_Ice_C>();
	}
};
static_assert(alignof(AGCN_NPC_Ice_C) == 0x000008, "Wrong alignment on AGCN_NPC_Ice_C");
static_assert(sizeof(AGCN_NPC_Ice_C) == 0x0004F8, "Wrong size on AGCN_NPC_Ice_C");
static_assert(offsetof(AGCN_NPC_Ice_C, TransitionOutLength) == 0x000428, "Member 'AGCN_NPC_Ice_C::TransitionOutLength' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, VectorParameters) == 0x000430, "Member 'AGCN_NPC_Ice_C::VectorParameters' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, Elemental_Mat_Map) == 0x000480, "Member 'AGCN_NPC_Ice_C::Elemental_Mat_Map' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, Ice_Particle_Husk) == 0x0004D0, "Member 'AGCN_NPC_Ice_C::Ice_Particle_Husk' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, Ice_Particle_Player) == 0x0004D8, "Member 'AGCN_NPC_Ice_C::Ice_Particle_Player' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, Flinger_Ice_Modifier) == 0x0004E0, "Member 'AGCN_NPC_Ice_C::Flinger_Ice_Modifier' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, Actor) == 0x0004E8, "Member 'AGCN_NPC_Ice_C::Actor' has a wrong offset!");
static_assert(offsetof(AGCN_NPC_Ice_C, Mesh) == 0x0004F0, "Member 'AGCN_NPC_Ice_C::Mesh' has a wrong offset!");

}

