#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Cube_Area

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Cube_Area.GCNL_Cube_Area_C.ExecuteUbergraph_GCNL_Cube_Area
// 0x0258 (0x0258 - 0x0000)
struct GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters1;                          // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents1;                  // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents1;                     // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x00F0(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x01A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x01B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitterCameraLensEffectBase*           CallFunc_SpawnCameraLensEffect_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity)> K2Node_CreateDelegate_OutputDelegate;              // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area) == 0x000008, "Wrong alignment on GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area");
static_assert(sizeof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area) == 0x000258, "Wrong size on GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, EntryPoint) == 0x000000, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_MyTarget1) == 0x000008, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_MyTarget1' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_Parameters1) == 0x000010, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_Parameters1' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_ParticleComponents1) == 0x0000C8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_ParticleComponents1' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_AudioComponents1) == 0x0000D8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_AudioComponents1' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_MyTarget) == 0x0000E8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_Parameters) == 0x0000F0, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_ParticleComponents) == 0x0001A8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_AudioComponents) == 0x0001B8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_BurstCameraShakeInstance) == 0x0001C8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_Event_BurstDecalInstance) == 0x0001D0, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0001E0, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_IsValid_ReturnValue1) == 0x0001E9, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001F0, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001F8, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_SpawnCameraLensEffect_ReturnValue) == 0x000200, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_SpawnCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_CustomEvent_EventName) == 0x000208, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_CustomEvent_EmitterTime) == 0x000210, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_CustomEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_CustomEvent_Location) == 0x000214, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_CustomEvent_Velocity) == 0x000220, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00022C, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, K2Node_CreateDelegate_OutputDelegate) == 0x000230, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000240, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_SpawnSoundAttached_ReturnValue1) == 0x000248, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_SpawnSoundAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000250, "Member 'GCNL_Cube_Area_C_ExecuteUbergraph_GCNL_Cube_Area::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");

// Function GCNL_Cube_Area.GCNL_Cube_Area_C.On Shield Squares Spawn
// 0x0024 (0x0024 - 0x0000)
struct GCNL_Cube_Area_C_On_Shield_Squares_Spawn final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmitterTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Cube_Area_C_On_Shield_Squares_Spawn) == 0x000004, "Wrong alignment on GCNL_Cube_Area_C_On_Shield_Squares_Spawn");
static_assert(sizeof(GCNL_Cube_Area_C_On_Shield_Squares_Spawn) == 0x000024, "Wrong size on GCNL_Cube_Area_C_On_Shield_Squares_Spawn");
static_assert(offsetof(GCNL_Cube_Area_C_On_Shield_Squares_Spawn, EventName) == 0x000000, "Member 'GCNL_Cube_Area_C_On_Shield_Squares_Spawn::EventName' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_On_Shield_Squares_Spawn, EmitterTime) == 0x000008, "Member 'GCNL_Cube_Area_C_On_Shield_Squares_Spawn::EmitterTime' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_On_Shield_Squares_Spawn, Location) == 0x00000C, "Member 'GCNL_Cube_Area_C_On_Shield_Squares_Spawn::Location' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_On_Shield_Squares_Spawn, Velocity) == 0x000018, "Member 'GCNL_Cube_Area_C_On_Shield_Squares_Spawn::Velocity' has a wrong offset!");

// Function GCNL_Cube_Area.GCNL_Cube_Area_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Cube_Area_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Cube_Area_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Cube_Area_C_OnRemoval");
static_assert(sizeof(GCNL_Cube_Area_C_OnRemoval) == 0x0000F0, "Wrong size on GCNL_Cube_Area_C_OnRemoval");
static_assert(offsetof(GCNL_Cube_Area_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Cube_Area_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Cube_Area_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCNL_Cube_Area_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCNL_Cube_Area_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Cube_Area_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Cube_Area_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Cube_Area.GCNL_Cube_Area_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_Cube_Area_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GCNL_Cube_Area_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Cube_Area_C_OnLoopingStart");
static_assert(sizeof(GCNL_Cube_Area_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCNL_Cube_Area_C_OnLoopingStart");
static_assert(offsetof(GCNL_Cube_Area_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Cube_Area_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Cube_Area_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCNL_Cube_Area_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Cube_Area_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCNL_Cube_Area_C_OnLoopingStart::AudioComponents' has a wrong offset!");

}

