#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Ninja_DragonSlash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Ninja_DragonSlash.GCNL_Ninja_DragonSlash_C
// 0x0028 (0x08A8 - 0x0880)
class AGCNL_Ninja_DragonSlash_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_SplineVolumeTrail_v1b_C*            TOTD_SplineBP01;                                   // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spline_Actor_LIfetime;                             // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SplineVolumeTrail_v1b_C*            TOTD_Spline_BP02;                                  // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Ninja_DragonSlash(int32 EntryPoint);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Ninja_DragonSlash_C">();
	}
	static class AGCNL_Ninja_DragonSlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Ninja_DragonSlash_C>();
	}
};
static_assert(alignof(AGCNL_Ninja_DragonSlash_C) == 0x000008, "Wrong alignment on AGCNL_Ninja_DragonSlash_C");
static_assert(sizeof(AGCNL_Ninja_DragonSlash_C) == 0x0008A8, "Wrong size on AGCNL_Ninja_DragonSlash_C");
static_assert(offsetof(AGCNL_Ninja_DragonSlash_C, UberGraphFrame) == 0x000880, "Member 'AGCNL_Ninja_DragonSlash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Ninja_DragonSlash_C, PostProcess) == 0x000888, "Member 'AGCNL_Ninja_DragonSlash_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AGCNL_Ninja_DragonSlash_C, TOTD_SplineBP01) == 0x000890, "Member 'AGCNL_Ninja_DragonSlash_C::TOTD_SplineBP01' has a wrong offset!");
static_assert(offsetof(AGCNL_Ninja_DragonSlash_C, Spline_Actor_LIfetime) == 0x000898, "Member 'AGCNL_Ninja_DragonSlash_C::Spline_Actor_LIfetime' has a wrong offset!");
static_assert(offsetof(AGCNL_Ninja_DragonSlash_C, TOTD_Spline_BP02) == 0x0008A0, "Member 'AGCNL_Ninja_DragonSlash_C::TOTD_Spline_BP02' has a wrong offset!");

}

