#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_OutOfStWStorm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_OutOfStWStorm.GCNL_OutOfStWStorm_C
// 0x00F0 (0x0518 - 0x0428)
class AGCNL_OutOfStWStorm_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect_StormAura;                                  // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Volume_A14D7A33438A79770DA5E7B48F73D0FC; // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_A14D7A33438A79770DA5E7B48F73D0FC; // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningTimeline_LERP_585F62E944EE27BDF842868886F573A1; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LightningTimeline__Direction_585F62E944EE27BDF842868886F573A1; // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LightningTimeline;                                 // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        StormPawn;                                         // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               EmitterTemplate_FallingRain;                       // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               EmitterTemplate_WindDebris;                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightningSpawnLocation;                            // 0x0470(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChanceOfLightningMesh;                             // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   RandomLightningLight;                              // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningIntensityMin;                             // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningIntensityMax;                             // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningTimelinePlaySpeedMin;                     // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningTimelinePlaySpeedMax;                     // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     LightningFlashTL;                                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningIntensity;                                // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitterCameraLensEffectBase*           RainCameraLensParticles;                           // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningFlashRepeatDelayMin;                      // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightningFlashRepeatDelayMax;                      // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SafeZonePassThroughSound;                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        StormAudioLoop_Inst;                               // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     Storm_Audio_Fader;                                 // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StormAudioVolume;                                  // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRandomLightning;                                  // 0x04D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ShieldBoundaryLoopSound;                           // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ShieldBoundaryAudio;                               // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HoldingAudio;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HoldingTickAudio;                                  // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        NewVar_0;                                          // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           On_Storm_Audio_Timer_Handle;                       // 0x0500(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Play_Damage_Sound;                                 // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SafeZone_Storm_Loop;                               // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_OutOfStWStorm(int32 EntryPoint);
	void Bind_On_Storm_Audio();
	void ZapFX(int32 ZapCount);
	void Start_Storm_Audio_Fader();
	void Remove_Storm_Audio();
	void Add_Storm_Audio();
	void On_Storm_Audio();
	void RandomLightningFlashesRepeat();
	void OnRemoved();
	void Play_Lightning_Flash_Audio(const struct FVector& Location);
	void StartRandomLighningStrikes();
	void OnActivated(class AFortPlayerPawn* InStormPawn, int32 EffectCount);
	void K2_OnReset();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void LightningTimeline__UpdateFunc();
	void LightningTimeline__FinishedFunc();
	void UserConstructionScript();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void GetLocationInCircleXY(struct FVector* LocationLocalSpace);
	void SetCameraEffects();
	void Play_Audio_Based_on_Storm_Distance();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_OutOfStWStorm_C">();
	}
	static class AGCNL_OutOfStWStorm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_OutOfStWStorm_C>();
	}
};
static_assert(alignof(AGCNL_OutOfStWStorm_C) == 0x000008, "Wrong alignment on AGCNL_OutOfStWStorm_C");
static_assert(sizeof(AGCNL_OutOfStWStorm_C) == 0x000518, "Wrong size on AGCNL_OutOfStWStorm_C");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, UberGraphFrame) == 0x000428, "Member 'AGCNL_OutOfStWStorm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, Effect_StormAura) == 0x000430, "Member 'AGCNL_OutOfStWStorm_C::Effect_StormAura' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, Timeline_0_Volume_A14D7A33438A79770DA5E7B48F73D0FC) == 0x000438, "Member 'AGCNL_OutOfStWStorm_C::Timeline_0_Volume_A14D7A33438A79770DA5E7B48F73D0FC' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, Timeline_0__Direction_A14D7A33438A79770DA5E7B48F73D0FC) == 0x00043C, "Member 'AGCNL_OutOfStWStorm_C::Timeline_0__Direction_A14D7A33438A79770DA5E7B48F73D0FC' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, Timeline_0) == 0x000440, "Member 'AGCNL_OutOfStWStorm_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningTimeline_LERP_585F62E944EE27BDF842868886F573A1) == 0x000448, "Member 'AGCNL_OutOfStWStorm_C::LightningTimeline_LERP_585F62E944EE27BDF842868886F573A1' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningTimeline__Direction_585F62E944EE27BDF842868886F573A1) == 0x00044C, "Member 'AGCNL_OutOfStWStorm_C::LightningTimeline__Direction_585F62E944EE27BDF842868886F573A1' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningTimeline) == 0x000450, "Member 'AGCNL_OutOfStWStorm_C::LightningTimeline' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, StormPawn) == 0x000458, "Member 'AGCNL_OutOfStWStorm_C::StormPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, EmitterTemplate_FallingRain) == 0x000460, "Member 'AGCNL_OutOfStWStorm_C::EmitterTemplate_FallingRain' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, EmitterTemplate_WindDebris) == 0x000468, "Member 'AGCNL_OutOfStWStorm_C::EmitterTemplate_WindDebris' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningSpawnLocation) == 0x000470, "Member 'AGCNL_OutOfStWStorm_C::LightningSpawnLocation' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, ChanceOfLightningMesh) == 0x00047C, "Member 'AGCNL_OutOfStWStorm_C::ChanceOfLightningMesh' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, RandomLightningLight) == 0x000480, "Member 'AGCNL_OutOfStWStorm_C::RandomLightningLight' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningIntensityMin) == 0x000488, "Member 'AGCNL_OutOfStWStorm_C::LightningIntensityMin' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningIntensityMax) == 0x00048C, "Member 'AGCNL_OutOfStWStorm_C::LightningIntensityMax' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningTimelinePlaySpeedMin) == 0x000490, "Member 'AGCNL_OutOfStWStorm_C::LightningTimelinePlaySpeedMin' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningTimelinePlaySpeedMax) == 0x000494, "Member 'AGCNL_OutOfStWStorm_C::LightningTimelinePlaySpeedMax' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningFlashTL) == 0x000498, "Member 'AGCNL_OutOfStWStorm_C::LightningFlashTL' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningIntensity) == 0x0004A0, "Member 'AGCNL_OutOfStWStorm_C::LightningIntensity' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, RainCameraLensParticles) == 0x0004A8, "Member 'AGCNL_OutOfStWStorm_C::RainCameraLensParticles' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningFlashRepeatDelayMin) == 0x0004B0, "Member 'AGCNL_OutOfStWStorm_C::LightningFlashRepeatDelayMin' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, LightningFlashRepeatDelayMax) == 0x0004B4, "Member 'AGCNL_OutOfStWStorm_C::LightningFlashRepeatDelayMax' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, SafeZonePassThroughSound) == 0x0004B8, "Member 'AGCNL_OutOfStWStorm_C::SafeZonePassThroughSound' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, StormAudioLoop_Inst) == 0x0004C0, "Member 'AGCNL_OutOfStWStorm_C::StormAudioLoop_Inst' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, Storm_Audio_Fader) == 0x0004C8, "Member 'AGCNL_OutOfStWStorm_C::Storm_Audio_Fader' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, StormAudioVolume) == 0x0004D0, "Member 'AGCNL_OutOfStWStorm_C::StormAudioVolume' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, bRandomLightning) == 0x0004D4, "Member 'AGCNL_OutOfStWStorm_C::bRandomLightning' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, ShieldBoundaryLoopSound) == 0x0004D8, "Member 'AGCNL_OutOfStWStorm_C::ShieldBoundaryLoopSound' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, ShieldBoundaryAudio) == 0x0004E0, "Member 'AGCNL_OutOfStWStorm_C::ShieldBoundaryAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, HoldingAudio) == 0x0004E8, "Member 'AGCNL_OutOfStWStorm_C::HoldingAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, HoldingTickAudio) == 0x0004F0, "Member 'AGCNL_OutOfStWStorm_C::HoldingTickAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, NewVar_0) == 0x0004F8, "Member 'AGCNL_OutOfStWStorm_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, On_Storm_Audio_Timer_Handle) == 0x000500, "Member 'AGCNL_OutOfStWStorm_C::On_Storm_Audio_Timer_Handle' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, Play_Damage_Sound) == 0x000508, "Member 'AGCNL_OutOfStWStorm_C::Play_Damage_Sound' has a wrong offset!");
static_assert(offsetof(AGCNL_OutOfStWStorm_C, SafeZone_Storm_Loop) == 0x000510, "Member 'AGCNL_OutOfStWStorm_C::SafeZone_Storm_Loop' has a wrong offset!");

}

