#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Generic_PlaysetBotTurret

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Generic_PlaysetBotTurret.GCNL_Generic_PlaysetBotTurret_C.OnRemove
// 0x00C8 (0x00C8 - 0x0000)
struct GCNL_Generic_PlaysetBotTurret_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_Generic_PlaysetBotTurret_C_OnRemove) == 0x000008, "Wrong alignment on GCNL_Generic_PlaysetBotTurret_C_OnRemove");
static_assert(sizeof(GCNL_Generic_PlaysetBotTurret_C_OnRemove) == 0x0000C8, "Wrong size on GCNL_Generic_PlaysetBotTurret_C_OnRemove");
static_assert(offsetof(GCNL_Generic_PlaysetBotTurret_C_OnRemove, MyTarget) == 0x000000, "Member 'GCNL_Generic_PlaysetBotTurret_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Generic_PlaysetBotTurret_C_OnRemove, Parameters) == 0x000008, "Member 'GCNL_Generic_PlaysetBotTurret_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Generic_PlaysetBotTurret_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GCNL_Generic_PlaysetBotTurret_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GCNL_Generic_PlaysetBotTurret.GCNL_Generic_PlaysetBotTurret_C.OnActive
// 0x00C8 (0x00C8 - 0x0000)
struct GCNL_Generic_PlaysetBotTurret_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_Generic_PlaysetBotTurret_C_OnActive) == 0x000008, "Wrong alignment on GCNL_Generic_PlaysetBotTurret_C_OnActive");
static_assert(sizeof(GCNL_Generic_PlaysetBotTurret_C_OnActive) == 0x0000C8, "Wrong size on GCNL_Generic_PlaysetBotTurret_C_OnActive");
static_assert(offsetof(GCNL_Generic_PlaysetBotTurret_C_OnActive, MyTarget) == 0x000000, "Member 'GCNL_Generic_PlaysetBotTurret_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Generic_PlaysetBotTurret_C_OnActive, Parameters) == 0x000008, "Member 'GCNL_Generic_PlaysetBotTurret_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Generic_PlaysetBotTurret_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GCNL_Generic_PlaysetBotTurret_C_OnActive::ReturnValue' has a wrong offset!");

}

