#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericMessageReceived

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GenericMessageReceived.GenericMessageReceived_C.ExecuteUbergraph_GenericMessageReceived
// 0x0098 (0x0098 - 0x0000)
struct GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0028(0x0018)()
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_FormatTextUsingParams_ReturnValue;        // 0x0048(0x0018)()
	class FText                                   CallFunc_FormatTextUsingParams_ReturnValue1;       // 0x0060(0x0018)()
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasParam_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived) == 0x000008, "Wrong alignment on GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived");
static_assert(sizeof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived) == 0x000098, "Wrong size on GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, EntryPoint) == 0x000000, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::EntryPoint' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, Temp_bool_Variable) == 0x000004, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, Temp_byte_Variable) == 0x000005, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, Temp_byte_Variable1) == 0x000006, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_MakeLiteralText_ReturnValue1) == 0x000028, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_GetUINavigationManager_ReturnValue) == 0x000040, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_FormatTextUsingParams_ReturnValue) == 0x000048, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_FormatTextUsingParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_FormatTextUsingParams_ReturnValue1) == 0x000060, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_FormatTextUsingParams_ReturnValue1' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000078, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, CallFunc_HasParam_ReturnValue) == 0x000090, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::CallFunc_HasParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived, K2Node_Select_Default) == 0x000091, "Member 'GenericMessageReceived_C_ExecuteUbergraph_GenericMessageReceived::K2Node_Select_Default' has a wrong offset!");

// Function GenericMessageReceived.GenericMessageReceived_C.BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'GenericMessageReceived_C_BndEvt__ShowNextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

