#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GiftingScreen.GiftingScreen_C
// 0x00C8 (0x0658 - 0x0590)
class UGiftingScreen_C final : public UFortGiftingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReportSent;                                        // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Summary;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Cancel;                                     // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText_ReasonField;                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FramingWidget;                                     // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_StackingEntry;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_GiftBoxes;                                 // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_Button;                                   // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MainPanelContent;                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_TabContent;                               // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Tab_GiftWrap;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Tab_Recipients;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RefundNote;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_ChosenItem;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Recipients;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    MoreInfoAction;                                    // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsCurrentStepGiftWrap;                             // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackAction;                                        // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_GiftingScreen(int32 EntryPoint);
	void BndEvt__TileView_GiftBoxes_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__TileView_GiftBoxes_K2Node_ComponentBoundEvent_2_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void OnActivated();
	void OnEndGiftingSubmission(bool bSuccess);
	void OnBeginGiftingSubmission();
	void BndEvt__Tab_GiftWrap_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnMoveToFriendSelectStep();
	void BndEvt__Tab_Recipients_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnMoveToGiftWrapStep(bool bGiftingToSelf);
	void OnOfferSet(class UFortStoreFrontOfferInfo* NewOfferInfo);
	void Construct();
	void HandleBackClicked(bool* bIsHandled);
	class UWidget* GetWidgetForFramingViewedItem();
	void ToggleBackAction(bool bEnable);
	void HandleMoreInfoClicked(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GiftingScreen_C">();
	}
	static class UGiftingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGiftingScreen_C>();
	}
};
static_assert(alignof(UGiftingScreen_C) == 0x000008, "Wrong alignment on UGiftingScreen_C");
static_assert(sizeof(UGiftingScreen_C) == 0x000658, "Wrong size on UGiftingScreen_C");
static_assert(offsetof(UGiftingScreen_C, UberGraphFrame) == 0x000590, "Member 'UGiftingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, ReportSent) == 0x000598, "Member 'UGiftingScreen_C::ReportSent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Intro) == 0x0005A0, "Member 'UGiftingScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Border_Summary) == 0x0005A8, "Member 'UGiftingScreen_C::Border_Summary' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Button_Cancel) == 0x0005B0, "Member 'UGiftingScreen_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, CircularThrobber_0) == 0x0005B8, "Member 'UGiftingScreen_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, EditableText_ReasonField) == 0x0005C0, "Member 'UGiftingScreen_C::EditableText_ReasonField' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, FramingWidget) == 0x0005C8, "Member 'UGiftingScreen_C::FramingWidget' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Image_4) == 0x0005D0, "Member 'UGiftingScreen_C::Image_4' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SafeZone_0) == 0x0005D8, "Member 'UGiftingScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SB_StackingEntry) == 0x0005E0, "Member 'UGiftingScreen_C::SB_StackingEntry' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, SizeBox_GiftBoxes) == 0x0005E8, "Member 'UGiftingScreen_C::SizeBox_GiftBoxes' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_Button) == 0x0005F0, "Member 'UGiftingScreen_C::Switcher_Button' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_MainPanelContent) == 0x0005F8, "Member 'UGiftingScreen_C::Switcher_MainPanelContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Switcher_TabContent) == 0x000600, "Member 'UGiftingScreen_C::Switcher_TabContent' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Tab_GiftWrap) == 0x000608, "Member 'UGiftingScreen_C::Tab_GiftWrap' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Tab_Recipients) == 0x000610, "Member 'UGiftingScreen_C::Tab_Recipients' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, Text_RefundNote) == 0x000618, "Member 'UGiftingScreen_C::Text_RefundNote' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_ChosenItem) == 0x000620, "Member 'UGiftingScreen_C::VBox_ChosenItem' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, VBox_Recipients) == 0x000628, "Member 'UGiftingScreen_C::VBox_Recipients' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, MoreInfoAction) == 0x000630, "Member 'UGiftingScreen_C::MoreInfoAction' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, IsCurrentStepGiftWrap) == 0x000640, "Member 'UGiftingScreen_C::IsCurrentStepGiftWrap' has a wrong offset!");
static_assert(offsetof(UGiftingScreen_C, BackAction) == 0x000648, "Member 'UGiftingScreen_C::BackAction' has a wrong offset!");

}

