#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HBOnboardingFlow

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HBOnboardingFlow.HBOnboardingFlow_C.ExecuteUbergraph_HBOnboardingFlow
// 0x0810 (0x0810 - 0x0000)
struct HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue1;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate1;             // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue2;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue7;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue8;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue2;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue3;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue10;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue11;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGameAccessReason                          CallFunc_GetAccessReason_ReturnValue;              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A4[0xC];                                      // 0x01A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue13;                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_WaitForClientAnnouncement* CallFunc_WaitForClientAnnouncement_ReturnValue;    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AutoSelectSubGame_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue1;                  // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanPlay_DenialReason;                     // 0x0218(0x0018)()
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue14;                 // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue4;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0290(0x0030)(IsPlainOldData, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue15;                 // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue5;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate16;            // 0x02E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue6;                  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array1;                           // 0x0300(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager;     // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource5;             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus5;              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent5;             // 0x0350(0x0020)(ConstParm, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement*                CallFunc_FinishSpawningActor_ReturnValue1;         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_WaitForClientAnnouncement* CallFunc_WaitForClientAnnouncement_ReturnValue1;   // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3[0x1];                                      // 0x03C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate18;            // 0x03C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager1;    // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue1;         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue; // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue1; // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue2; // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x03EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x03EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate19;            // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue1;          // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue1;        // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue16;                 // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue17;                 // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfo_Result;                   // 0x0428(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate20;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource4;             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus4;              // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent4;             // 0x0490(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SetUIState*            CallFunc_SetUIState_ReturnValue7;                  // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue12;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array2;                           // 0x04C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UObject*                                K2Node_HandleClientEvent_EventSource3;             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus3;              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent3;             // 0x04E8(0x0020)(ConstParm, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate21;            // 0x0508(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate22;            // 0x0518(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_CustomEvent_Reason_Title;                   // 0x0528(0x0018)()
	class FText                                   K2Node_CustomEvent_Reason;                         // 0x0540(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0558(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0578(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue13;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0598(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x05B0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate23;            // 0x05C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NeedsToPlayEventMovie_ReturnValue;        // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RecheckNeedToPlayEventMovie_WaitingToCheckAgain; // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RecheckNeedToPlayEventMovie_WaitingToCheckAgain1; // 0x05DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x05E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue5;             // 0x05F8(0x0018)()
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAccessManagementFeatures_Can_Manage;   // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612[0x2];                                      // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate24;            // 0x0614(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0625(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_626[0x2];                                      // 0x0626(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource2;             // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus2;              // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent2;             // 0x0638(0x0020)(ConstParm, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_LoadCurrentSubgameProfiles* CallFunc_LoadCurrentSubgameProfiles_ReturnValue;   // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate25;            // 0x0678(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue14;                    // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue18;                 // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState1;         // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason1;               // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x069A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69B[0x1];                                      // 0x069B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate26;            // 0x069C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetOnboardingQuestItem_Result;            // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue15;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetOnboardingQuestItem_Result1;           // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager2;    // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_EnsureClientQuestLogin* CallFunc_SendEnsureClientQuestLogin_ReturnValue;   // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetCampaignQuestManager_QuestManager3;    // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue2;         // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue16;                    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue17;                    // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue3; // 0x06F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F3[0x5];                                      // 0x06F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleClientEvent_EventSource1;             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus1;              // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent1;             // 0x0708(0x0020)(ConstParm, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortClientAnnouncement*                CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x0750(0x0020)(ConstParm, NoDestructor)
	class UFortAsyncAction_WaitForClientAnnouncement* CallFunc_WaitForClientAnnouncement_ReturnValue2;   // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue18;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate27;            // 0x077C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasCompletedOnboardingObjective_ReturnValue4; // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate28;            // 0x0790(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller1;      // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_CheckForStwMfaReward*  CallFunc_CheckForStwMfaReward_ReturnValue;         // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue19;                    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue6;             // 0x07C8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue7;             // 0x07E0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate29;            // 0x07F8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow) == 0x000010, "Wrong alignment on HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow");
static_assert(sizeof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow) == 0x000810, "Wrong size on HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, EntryPoint) == 0x000000, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::EntryPoint' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue) == 0x000008, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue1) == 0x000028, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue1) == 0x000038, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue1) == 0x000040, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue2) == 0x000048, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue3) == 0x000050, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue4) == 0x000058, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsMobileApp_ReturnValue) == 0x000060, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue5) == 0x000068, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsMobileApp_ReturnValue1) == 0x000070, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsMobileApp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue6) == 0x000078, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CustomEvent_Result) == 0x000080, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CustomEvent_ResultName) == 0x000084, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate1) == 0x00008C, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, Temp_name_Variable) == 0x00009C, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, Temp_byte_Variable) == 0x0000A4, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate2) == 0x0000A8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue2) == 0x0000B8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue7) == 0x0000C0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetQuestManager_ReturnValue) == 0x0000C8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue2) == 0x0000D0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue3) == 0x0000D1, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate3) == 0x0000D4, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate4) == 0x0000E4, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate5) == 0x0000F4, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue8) == 0x000108, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue9) == 0x000110, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsMobileApp_ReturnValue2) == 0x000118, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsMobileApp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate6) == 0x00011C, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue3) == 0x000130, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue10) == 0x000138, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue4) == 0x000140, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate7) == 0x000144, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate8) == 0x000154, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue11) == 0x000168, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetFeatureState_OutFeatureState) == 0x000170, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetFeatureState_OutReason) == 0x000171, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate9) == 0x000174, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000184, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate10) == 0x000188, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue12) == 0x000198, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetSubGame_ReturnValue) == 0x0001A0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetAccessReason_ReturnValue) == 0x0001A1, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetAccessReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0001A2, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0001A3, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_MakeTransform_ReturnValue) == 0x0001B0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate11) == 0x0001E0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001F0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001F8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue13) == 0x000200, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue13' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_WaitForClientAnnouncement_ReturnValue) == 0x000208, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_WaitForClientAnnouncement_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_AutoSelectSubGame_ReturnValue) == 0x000210, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_AutoSelectSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue5) == 0x000211, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetSubGame_ReturnValue1) == 0x000212, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetSubGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_SwitchEnum_CmpSuccess) == 0x000213, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_CanPlay_DenialReason) == 0x000218, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_CanPlay_DenialReason' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_CanPlay_ReturnValue) == 0x000230, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_CanPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValidClass_ReturnValue) == 0x000231, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue14) == 0x000238, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue14' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue4) == 0x000240, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue6) == 0x000248, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate12) == 0x00024C, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_MakeArray_Array) == 0x000260, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate13) == 0x000270, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate14) == 0x000280, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_MakeTransform_ReturnValue1) == 0x000290, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_GetContext_ReturnValue15) == 0x0002C0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_GetContext_ReturnValue15' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate15) == 0x0002C8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue5) == 0x0002D8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_IsValid_ReturnValue7) == 0x0002E0, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, K2Node_CreateDelegate_OutputDelegate16) == 0x0002E4, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_Not_PreBool_ReturnValue) == 0x0002F4, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow, CallFunc_SetUIState_ReturnValue6) == 0x0002F8, "Member 'HBOnboardingFlow_C_ExecuteUbergraph_HBOnboardingFlow::CallFunc_SetUIState_ReturnValue6' has a wrong offset!");
