#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutPerkDetailRow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.ExecuteUbergraph_HeroLoadoutPerkDetailRow
// 0x00C8 (0x00C8 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_NewValue1;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00A8(0x0018)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow) == 0x0000C8, "Wrong size on HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, EntryPoint) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, K2Node_Event_IsDesignTime) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, K2Node_CustomEvent_NewValue1) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::K2Node_CustomEvent_NewValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, K2Node_CustomEvent_NewValue) == 0x000078, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, K2Node_MakeArray_Array) == 0x000080, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, CallFunc_Format_ReturnValue) == 0x000090, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, CallFunc_TextToUpper_ReturnValue) == 0x0000A8, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow, CallFunc_MakeVector2D_ReturnValue) == 0x0000C0, "Member 'HeroLoadoutPerkDetailRow_C_ExecuteUbergraph_HeroLoadoutPerkDetailRow::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetHoverHorizontalOffset
// 0x0004 (0x0004 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset) == 0x000004, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset) == 0x000004, "Wrong size on HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset, NewValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetHoverHorizontalOffset::NewValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetHoverAlphaValue
// 0x0004 (0x0004 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue) == 0x000004, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue) == 0x000004, "Wrong size on HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue, NewValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetHoverAlphaValue::NewValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PreConstruct) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PreConstruct");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PreConstruct) == 0x000001, "Wrong size on HeroLoadoutPerkDetailRow_C_PreConstruct");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateFromStyle
// 0x0018 (0x0018 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateFromStyle final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateFromStyle");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle) == 0x000018, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateFromStyle");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_byte_Variable) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_byte_Variable1) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_bool_Variable) == 0x000002, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, Temp_bool_Variable1) == 0x000003, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, K2Node_Select_Default) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromStyle, K2Node_Select1_Default) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromStyle::K2Node_Select1_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateFromState
// 0x0250 (0x0250 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateFromState final
{
public:
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0000(0x0088)()
	class UFortAbilityKit*                        CallFunc_GetPerkAbilityKit_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_ResizeBrush_ResizedBrush;                 // 0x0090(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0120(0x0018)()
	class UFortAbilityKit*                        CallFunc_GetPerkAbilityKit_ReturnValue1;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        CallFunc_GetPerkAbilityKit_ReturnValue2;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_ResizeBrush_ResizedBrush1;                // 0x0150(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01F0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0218(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0238(0x0018)()
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateFromState) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateFromState");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateFromState) == 0x000250, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateFromState");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_NoResourceBrush_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetPerkAbilityKit_ReturnValue) == 0x000088, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetPerkAbilityKit_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_ResizeBrush_ResizedBrush) == 0x000090, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_ResizeBrush_ResizedBrush' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_TextToUpper_ReturnValue) == 0x000120, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetPerkAbilityKit_ReturnValue1) == 0x000138, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetPerkAbilityKit_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetPerkAbilityKit_ReturnValue2) == 0x000140, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetPerkAbilityKit_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue1) == 0x000148, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_ResizeBrush_ResizedBrush1) == 0x000150, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_ResizeBrush_ResizedBrush1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue2) == 0x0001D8, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001E0, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x0001E8, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_MakeLiteralText_ReturnValue) == 0x0001F0, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, Temp_bool_Variable) == 0x000208, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetContext_ReturnValue) == 0x000210, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_OutDescription) == 0x000218, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_ReturnValue) == 0x000230, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateFromState, K2Node_Select_Default) == 0x000238, "Member 'HeroLoadoutPerkDetailRow_C_UpdateFromState::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateTextStyles
// 0x0058 (0x0058 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateTextStyles final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable4;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable5;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable6;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue1;              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue2;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select3_Default;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select4_Default;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select5_Default;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateTextStyles");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles) == 0x000058, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateTextStyles");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable1) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable2) == 0x00000C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable3) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable1) == 0x000014, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable4) == 0x000018, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable4' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable2) == 0x00001C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable5) == 0x000020, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable5' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_float_Variable6) == 0x000024, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_float_Variable6' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable3) == 0x000028, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable4) == 0x000029, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_IsPerkUnlocked_ReturnValue) == 0x00002A, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_IsPerkUnlocked_ReturnValue1) == 0x00002B, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_IsPerkUnlocked_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select_Default) == 0x00002C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select1_Default) == 0x000030, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, Temp_bool_Variable5) == 0x000034, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select2_Default) == 0x000038, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_IsPerkUnlocked_ReturnValue2) == 0x00003C, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_IsPerkUnlocked_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select3_Default) == 0x000040, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select4_Default) == 0x000048, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateTextStyles, K2Node_Select5_Default) == 0x000050, "Member 'HeroLoadoutPerkDetailRow_C_UpdateTextStyles::K2Node_Select5_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetHero
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetHero final
{
public:
	class UFortHero*                              Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetHero) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetHero");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetHero) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_SetHero");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetHero, Hero) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetHero::Hero' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.GetPerkAbilityKit
// 0x0050 (0x0050 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit final
{
public:
	class UFortAbilityKit*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortHeroLoadoutPerkType                      Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          K2Node_DynamicCast_AsFort_Hero_Type;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForHeroPerk_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForTeamLeadPerk_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        CallFunc_GetAbilityKitForCommanderPerk_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit) == 0x000050, "Wrong size on HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, Temp_byte_Variable) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_DynamicCast_AsFort_Hero_Type) == 0x000020, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_DynamicCast_AsFort_Hero_Type' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetAbilityKitForHeroPerk_ReturnValue) == 0x000030, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetAbilityKitForHeroPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetAbilityKitForTeamLeadPerk_ReturnValue) == 0x000038, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetAbilityKitForTeamLeadPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, CallFunc_GetAbilityKitForCommanderPerk_ReturnValue) == 0x000040, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::CallFunc_GetAbilityKitForCommanderPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit, K2Node_Select_Default) == 0x000048, "Member 'HeroLoadoutPerkDetailRow_C_GetPerkAbilityKit::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.IsPerkUnlocked
// 0x0007 (0x0007 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_IsPerkUnlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortHeroLoadoutPerkType                      Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeamLeadPerkUnlockedForHero_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_IsPerkUnlocked");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked) == 0x000007, "Wrong size on HeroLoadoutPerkDetailRow_C_IsPerkUnlocked");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, Temp_bool_Variable) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, Temp_byte_Variable) == 0x000002, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, CallFunc_IsTeamLeadPerkUnlockedForHero_ReturnValue) == 0x000003, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::CallFunc_IsTeamLeadPerkUnlockedForHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_IsPerkUnlocked, K2Node_Select_Default) == 0x000006, "Member 'HeroLoadoutPerkDetailRow_C_IsPerkUnlocked::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetPerkTypeToRepresent
// 0x0001 (0x0001 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent final
{
public:
	EFortHeroLoadoutPerkType                      Perk_Type;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent) == 0x000001, "Wrong size on HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent, Perk_Type) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetPerkTypeToRepresent::Perk_Type' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetShouldDisplayAsIgnored
// 0x0002 (0x0002 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored final
{
public:
	bool                                          InShouldDisplayAsIgnored;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored) == 0x000002, "Wrong size on HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored, InShouldDisplayAsIgnored) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored::InShouldDisplayAsIgnored' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayAsIgnored::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayHoverCue
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayHoverCue final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayHoverCue) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayHoverCue");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayHoverCue) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayHoverCue");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayHoverCue, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayHoverCue::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayUnhoverCue
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayUnhoverCue final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayUnhoverCue) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayUnhoverCue");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayUnhoverCue) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayUnhoverCue");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayUnhoverCue, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayUnhoverCue::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.UpdateLockedImage
// 0x0098 (0x0098 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_UpdateLockedImage final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0008(0x0088)(ConstParm)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_UpdateLockedImage");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage) == 0x000098, "Wrong size on HeroLoadoutPerkDetailRow_C_UpdateLockedImage");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_bool_Variable) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_byte_Variable) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_byte_Variable1) == 0x000002, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, Temp_bool_Variable1) == 0x000003, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, CallFunc_IsPerkUnlocked_ReturnValue) == 0x000005, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, K2Node_Select_Default) == 0x000008, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_UpdateLockedImage, K2Node_Select1_Default) == 0x000090, "Member 'HeroLoadoutPerkDetailRow_C_UpdateLockedImage::K2Node_Select1_Default' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.SetShouldDisplayWarning
// 0x0002 (0x0002 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning final
{
public:
	bool                                          InShouldDisplayWarning;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning) == 0x000001, "Wrong alignment on HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning) == 0x000002, "Wrong size on HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning, InShouldDisplayWarning) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning::InShouldDisplayWarning' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'HeroLoadoutPerkDetailRow_C_SetShouldDisplayWarning::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayHover
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayHover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayHover) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayHover");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayHover) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayHover");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayHover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayHover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerkDetailRow.HeroLoadoutPerkDetailRow_C.PlayUnHover
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutPerkDetailRow_C_PlayUnHover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerkDetailRow_C_PlayUnHover) == 0x000008, "Wrong alignment on HeroLoadoutPerkDetailRow_C_PlayUnHover");
static_assert(sizeof(HeroLoadoutPerkDetailRow_C_PlayUnHover) == 0x000008, "Wrong size on HeroLoadoutPerkDetailRow_C_PlayUnHover");
static_assert(offsetof(HeroLoadoutPerkDetailRow_C_PlayUnHover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerkDetailRow_C_PlayUnHover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

