#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutItemPedestal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HeroLoadoutItemPedestal.HeroLoadoutItemPedestal_C.ExecuteUbergraph_HeroLoadoutItemPedestal
// 0x0080 (0x0080 - 0x0000)
struct HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class ICustomCharacterPartOwnerInterface> K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal) == 0x000010, "Wrong alignment on HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal");
static_assert(sizeof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal) == 0x000080, "Wrong size on HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, EntryPoint) == 0x000000, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::EntryPoint' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface) == 0x000040, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, CallFunc_BreakTransform_Location) == 0x000054, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, CallFunc_BreakTransform_Rotation) == 0x000060, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, CallFunc_BreakTransform_Scale) == 0x00006C, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000078, "Member 'HeroLoadoutItemPedestal_C_ExecuteUbergraph_HeroLoadoutItemPedestal::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

