#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutActiveAbilityDetailRow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow) == 0x000004, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow) == 0x000008, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow, EntryPoint) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow, K2Node_Event_IsDesignTime) == 0x000004, "Member 'HeroLoadoutActiveAbilityDetailRow_C_ExecuteUbergraph_HeroLoadoutActiveAbilityDetailRow::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_PreConstruct) == 0x000001, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_PreConstruct");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_PreConstruct) == 0x000001, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_PreConstruct");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.UpdateFromStyle
// 0x00B8 (0x00B8 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateBrushDrawType                           Temp_byte_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetStandardBrushSize_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           Temp_byte_Variable3;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateBrushDrawType                           K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x0088)()
	class UWidget*                                K2Node_Select1_Default;                            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle) == 0x000008, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle) == 0x0000B8, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_byte_Variable) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_byte_Variable1) == 0x000001, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_bool_Variable) == 0x000002, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_bool_Variable1) == 0x000003, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_byte_Variable2) == 0x000004, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, CallFunc_GetStandardBrushSize_ReturnValue) == 0x000008, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::CallFunc_GetStandardBrushSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_byte_Variable3) == 0x000010, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, CallFunc_BreakVector2D_X) == 0x000014, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, Temp_bool_Variable2) == 0x00001C, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, K2Node_Select_Default) == 0x00001D, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, K2Node_MakeStruct_SlateBrush) == 0x000020, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, K2Node_Select1_Default) == 0x0000A8, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle, K2Node_Select2_Default) == 0x0000B0, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromStyle::K2Node_Select2_Default' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.UpdateFromState
// 0x0278 (0x0278 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState final
{
public:
	bool                                          CallFunc_IsAbilityUnlocked_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKit_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        CallFunc_GetAbilityKit_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortGadgetItemDefinition*>      CallFunc_BP_GetGadgets_GadgetItemDefinitions;      // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortGadgetItemDefinition*              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetAbilityKit_ReturnValue2;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0048(0x0088)()
	struct FSlateBrush                            CallFunc_ResizeBrush_ResizedBrush;                 // 0x00D0(0x0088)()
	struct FSlateBrush                            CallFunc_ResizeBrush_ResizedBrush1;                // 0x0158(0x0088)()
	bool                                          Temp_bool_Variable;                                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0208(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0228(0x0018)()
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0248(0x0018)()
	class FText                                   K2Node_Select2_Default;                            // 0x0260(0x0018)()
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState) == 0x000008, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState) == 0x000278, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_IsAbilityUnlocked_ReturnValue) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_IsAbilityUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetAbilityKit_ReturnValue) == 0x000008, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetAbilityKit_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetAbilityKit_ReturnValue1) == 0x000010, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetAbilityKit_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_BP_GetGadgets_GadgetItemDefinitions) == 0x000018, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_BP_GetGadgets_GadgetItemDefinitions' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_Array_Get_Item) == 0x000028, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue1) == 0x000031, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetAbilityKit_ReturnValue2) == 0x000038, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetAbilityKit_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_NoResourceBrush_ReturnValue) == 0x000048, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_ResizeBrush_ResizedBrush) == 0x0000D0, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_ResizeBrush_ResizedBrush' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_ResizeBrush_ResizedBrush1) == 0x000158, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_ResizeBrush_ResizedBrush1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, Temp_bool_Variable) == 0x0001E0, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetContext_ReturnValue) == 0x0001E8, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, Temp_bool_Variable1) == 0x0001F0, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001F8, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x000200, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_OutDescription) == 0x000208, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, CallFunc_GetCombinedDescription_ReturnValue) == 0x000220, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, Temp_byte_Variable) == 0x000221, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, K2Node_Select_Default) == 0x000228, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, Temp_byte_Variable1) == 0x000240, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, Temp_bool_Variable2) == 0x000241, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, K2Node_Select1_Default) == 0x000242, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, Temp_text_Variable) == 0x000248, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState, K2Node_Select2_Default) == 0x000260, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateFromState::K2Node_Select2_Default' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.UpdateTextStyles
// 0x0018 (0x0018 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAbilityUnlocked_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAbilityUnlocked_ReturnValue1;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select1_Default;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles) == 0x000008, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles) == 0x000018, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles, Temp_bool_Variable) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles, CallFunc_IsAbilityUnlocked_ReturnValue) == 0x000001, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles::CallFunc_IsAbilityUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles, CallFunc_IsAbilityUnlocked_ReturnValue1) == 0x000002, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles::CallFunc_IsAbilityUnlocked_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles, Temp_bool_Variable1) == 0x000003, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles, K2Node_Select_Default) == 0x000008, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles, K2Node_Select1_Default) == 0x000010, "Member 'HeroLoadoutActiveAbilityDetailRow_C_UpdateTextStyles::K2Node_Select1_Default' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.SetHero
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_SetHero final
{
public:
	class UFortHero*                              Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_SetHero) == 0x000008, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_SetHero");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_SetHero) == 0x000008, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_SetHero");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_SetHero, Hero) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_SetHero::Hero' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.GetAbilityKit
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit final
{
public:
	class UFortAbilityKit*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit) == 0x000008, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit) == 0x000008, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit, ReturnValue) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_GetAbilityKit::ReturnValue' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.IsAbilityUnlocked
// 0x0001 (0x0001 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked) == 0x000001, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked) == 0x000001, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked, ReturnValue) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_IsAbilityUnlocked::ReturnValue' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.SetAbilityKit
// 0x0008 (0x0008 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit final
{
public:
	class UFortAbilityKit*                        Param_AbilityKit;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit) == 0x000008, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit) == 0x000008, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit, Param_AbilityKit) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_SetAbilityKit::Param_AbilityKit' has a wrong offset!");

// Function HeroLoadoutActiveAbilityDetailRow.HeroLoadoutActiveAbilityDetailRow_C.SetDisplayState
// 0x0003 (0x0003 - 0x0000)
struct HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState final
{
public:
	bool                                          ShowName;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowDescription;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_UseVerboseDescription;                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState) == 0x000001, "Wrong alignment on HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState");
static_assert(sizeof(HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState) == 0x000003, "Wrong size on HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState, ShowName) == 0x000000, "Member 'HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState::ShowName' has a wrong offset!");
static_assert(offsetof(HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState, ShowDescription) == 0x000001, "Member 'HeroLoadoutActiveAbilityDetailRow_C_SetDisplayState::ShowDescription' has a wrong offset!");
