#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroLoadoutPerksDetailWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.ExecuteUbergraph_HeroLoadoutPerksDetailWidget
// 0x0090 (0x0090 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue1;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin1;                         // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select2_Default;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget) == 0x000090, "Wrong size on HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, EntryPoint) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_bool_Variable) == 0x000004, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_byte_Variable) == 0x000005, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_byte_Variable1) == 0x000006, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_bool_Variable1) == 0x000007, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_struct_Variable) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_struct_Variable1) == 0x000018, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, Temp_bool_Variable2) == 0x000028, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_DynamicCast_AsFort_Hero) == 0x000030, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_Select_Default) == 0x000039, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_Select1_Default) == 0x00003C, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000050, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue1) == 0x000058, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_MakeStruct_Margin) == 0x000060, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_MakeStruct_Margin1) == 0x000070, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_MakeStruct_Margin1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget, K2Node_Select2_Default) == 0x000080, "Member 'HeroLoadoutPerksDetailWidget_C_ExecuteUbergraph_HeroLoadoutPerksDetailWidget::K2Node_Select2_Default' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.SetLoadoutSlotContext
// 0x0010 (0x0010 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext final
{
public:
	class UFortCampaignHeroLoadoutItem*           HeroLoadout;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlotName;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext) == 0x000010, "Wrong size on HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext, HeroLoadout) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext::HeroLoadout' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext, SlotName) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_SetLoadoutSlotContext::SlotName' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.HandleDifferentLoadoutSlotContextSet
// 0x0088 (0x0088 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet final
{
public:
	TSet<class UWidget*>                          PerkWidgetsToShow;                                 // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet) == 0x000088, "Wrong size on HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, PerkWidgetsToShow) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::PerkWidgetsToShow' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, Temp_int_Array_Index_Variable) == 0x000050, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, Temp_byte_Variable) == 0x00005C, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, Temp_byte_Variable1) == 0x00005D, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, Temp_bool_Variable) == 0x00005E, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, K2Node_MakeArray_Array) == 0x000060, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_Array_Get_Item) == 0x000070, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_Set_Contains_ReturnValue) == 0x00007C, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_Less_IntInt_ReturnValue) == 0x00007D, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, K2Node_Select_Default) == 0x00007E, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00007F, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet, CallFunc_EqualEqual_NameName_ReturnValue1) == 0x000080, "Member 'HeroLoadoutPerksDetailWidget_C_HandleDifferentLoadoutSlotContextSet::CallFunc_EqualEqual_NameName_ReturnValue1' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.UpdateRootVisibility
// 0x0018 (0x0018 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroLoadoutSystemEnabled_ReturnValue;   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility) == 0x000018, "Wrong size on HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, Temp_bool_Variable) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, Temp_byte_Variable) == 0x000001, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, Temp_byte_Variable1) == 0x000002, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, CallFunc_IsHeroLoadoutSystemEnabled_ReturnValue) == 0x000003, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::CallFunc_IsHeroLoadoutSystemEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, K2Node_DynamicCast_AsFort_Hero) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility, K2Node_Select_Default) == 0x000012, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateRootVisibility::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.UpdateHeroLoadoutSlotWarning
// 0x0040 (0x0040 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning final
{
public:
	class UFortHero*                              Hero;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidHeroSlot_Result;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWarningText_Result;                    // 0x0010(0x0018)()
	bool                                          CallFunc_ShouldShowWarning_Result;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning) == 0x000040, "Wrong size on HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, Hero) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::Hero' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, Temp_bool_Variable) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, Temp_byte_Variable) == 0x000009, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, Temp_byte_Variable1) == 0x00000A, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, CallFunc_IsValidHeroSlot_Result) == 0x00000B, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::CallFunc_IsValidHeroSlot_Result' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, CallFunc_GetWarningText_Result) == 0x000010, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::CallFunc_GetWarningText_Result' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, CallFunc_ShouldShowWarning_Result) == 0x000028, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::CallFunc_ShouldShowWarning_Result' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, CallFunc_BooleanAND_ReturnValue1) == 0x000029, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, K2Node_DynamicCast_AsFort_Hero) == 0x000030, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning, K2Node_Select_Default) == 0x000039, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateHeroLoadoutSlotWarning::K2Node_Select_Default' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.UpdateCommanderSlotPerkVisibility
// 0x0010 (0x0010 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility final
{
public:
	class UFortHero*                              CallFunc_GetCommanderHero_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility) == 0x000010, "Wrong size on HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility, CallFunc_GetCommanderHero_ReturnValue) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility::CallFunc_GetCommanderHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility, CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue) == 0x000009, "Member 'HeroLoadoutPerksDetailWidget_C_UpdateCommanderSlotPerkVisibility::CallFunc_IsCommanderPerkUnlockedForHero_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.ShouldShowWarning
// 0x0020 (0x0020 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_ShouldShowWarning final
{
public:
	const class UFortHero*                        SlottedHero;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              CallFunc_GetCommanderHero_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesHeroPerkApplyToCommander_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlottedHeroAbilityDuplicated_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_ShouldShowWarning");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning) == 0x000020, "Wrong size on HeroLoadoutPerksDetailWidget_C_ShouldShowWarning");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, SlottedHero) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::SlottedHero' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, Result) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::Result' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, CallFunc_GetCommanderHero_ReturnValue) == 0x000010, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::CallFunc_GetCommanderHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, CallFunc_DoesHeroPerkApplyToCommander_ReturnValue) == 0x000018, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::CallFunc_DoesHeroPerkApplyToCommander_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, CallFunc_IsSlottedHeroAbilityDuplicated_ReturnValue) == 0x000019, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::CallFunc_IsSlottedHeroAbilityDuplicated_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_ShouldShowWarning, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'HeroLoadoutPerksDetailWidget_C_ShouldShowWarning::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.GetWarningText
// 0x00B8 (0x00B8 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_GetWarningText final
{
public:
	class UFortHero*                              Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Result;                                            // 0x0008(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable1;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable1;                               // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0060(0x0018)()
	class UFortHero*                              CallFunc_GetCommanderHero_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlottedHeroAbilityDuplicated_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesHeroPerkApplyToCommander_ReturnValue; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
	class FText                                   K2Node_Select1_Default;                            // 0x00A0(0x0018)()
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_GetWarningText) == 0x000008, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_GetWarningText");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_GetWarningText) == 0x0000B8, "Wrong size on HeroLoadoutPerksDetailWidget_C_GetWarningText");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Hero) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Hero' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Result) == 0x000008, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Result' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Temp_bool_Variable) == 0x000020, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Temp_text_Variable) == 0x000028, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Temp_bool_Variable1) == 0x000040, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Temp_text_Variable1) == 0x000048, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, Temp_text_Variable2) == 0x000060, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, CallFunc_GetCommanderHero_ReturnValue) == 0x000078, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::CallFunc_GetCommanderHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, CallFunc_IsSlottedHeroAbilityDuplicated_ReturnValue) == 0x000080, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::CallFunc_IsSlottedHeroAbilityDuplicated_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, CallFunc_DoesHeroPerkApplyToCommander_ReturnValue) == 0x000081, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::CallFunc_DoesHeroPerkApplyToCommander_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, K2Node_Select_Default) == 0x000088, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_GetWarningText, K2Node_Select1_Default) == 0x0000A0, "Member 'HeroLoadoutPerksDetailWidget_C_GetWarningText::K2Node_Select1_Default' has a wrong offset!");

// Function HeroLoadoutPerksDetailWidget.HeroLoadoutPerksDetailWidget_C.IsValidHeroSlot
// 0x0006 (0x0006 - 0x0000)
struct HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot) == 0x000001, "Wrong alignment on HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot");
static_assert(sizeof(HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot) == 0x000006, "Wrong size on HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot, Result) == 0x000000, "Member 'HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot::Result' has a wrong offset!");
static_assert(offsetof(HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000001, "Member 'HeroLoadoutPerksDetailWidget_C_IsValidHeroSlot::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
