#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HexmapLevelSettings_Temperate01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HexmapLevelSettings_Temperate01.HexmapLevelSettings_Temperate01_C
// 0x0040 (0x0370 - 0x0330)
class AHexmapLevelSettings_Temperate01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        ArrowMinusOriginalLightRot;                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLightMinusMain;                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LightsRoot;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HexmapLevelSettings_Temperate01(int32 EntryPoint);
	void CustomSettings(bool Visibility);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HexmapLevelSettings_Temperate01_C">();
	}
	static class AHexmapLevelSettings_Temperate01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHexmapLevelSettings_Temperate01_C>();
	}
};
static_assert(alignof(AHexmapLevelSettings_Temperate01_C) == 0x000008, "Wrong alignment on AHexmapLevelSettings_Temperate01_C");
static_assert(sizeof(AHexmapLevelSettings_Temperate01_C) == 0x000370, "Wrong size on AHexmapLevelSettings_Temperate01_C");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, UberGraphFrame) == 0x000330, "Member 'AHexmapLevelSettings_Temperate01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, ArrowMinusOriginalLightRot) == 0x000338, "Member 'AHexmapLevelSettings_Temperate01_C::ArrowMinusOriginalLightRot' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, ExponentialHeightFog) == 0x000340, "Member 'AHexmapLevelSettings_Temperate01_C::ExponentialHeightFog' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, SkyLight) == 0x000348, "Member 'AHexmapLevelSettings_Temperate01_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, DirectionalLightMinusMain) == 0x000350, "Member 'AHexmapLevelSettings_Temperate01_C::DirectionalLightMinusMain' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, LightsRoot) == 0x000358, "Member 'AHexmapLevelSettings_Temperate01_C::LightsRoot' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, Arrow) == 0x000360, "Member 'AHexmapLevelSettings_Temperate01_C::Arrow' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, DefaultSceneRoot) == 0x000368, "Member 'AHexmapLevelSettings_Temperate01_C::DefaultSceneRoot' has a wrong offset!");

}

