#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDLayoutToolFireModePanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.ExecuteUbergraph_HUDLayoutToolFireModePanel
// 0x00B8 (0x00B8 - 0x0000)
struct HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  K2Node_CustomEvent_Tile1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHUDLayoutToolFireModeButton*>   K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_GetFireModeDescription_ReturnValue;       // 0x0020(0x0018)()
	TDelegate<void(EFireModeType NewFireMode)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFireModeSelectTile_C*                  K2Node_CustomEvent_Tile;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewOpenState;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue1;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInCustomMode_IsCustom;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInCustomMode_IsCustom1;                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFireModeType                                 K2Node_CustomEvent_NewFireMode;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCustomMode_IsCustom2;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel) == 0x0000B8, "Wrong size on HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, EntryPoint) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, Temp_bool_Variable) == 0x000004, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, Temp_byte_Variable) == 0x000006, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, Temp_byte_Variable1) == 0x000007, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_CustomEvent_Tile1) == 0x000008, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_CustomEvent_Tile1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_MakeArray_Array) == 0x000010, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_GetFireModeDescription_ReturnValue) == 0x000020, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_GetFireModeDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_CustomEvent_Tile) == 0x000048, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_CustomEvent_Tile' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_Event_bNewOpenState) == 0x000058, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_Event_bNewOpenState' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_IsValid_ReturnValue1) == 0x000059, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_ComponentBoundEvent_Button3) == 0x000060, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_PlayAnimation_ReturnValue1) == 0x000070, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_ComponentBoundEvent_Button2) == 0x000078, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, Temp_byte_Variable2) == 0x000080, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000088, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, Temp_byte_Variable3) == 0x000090, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_GetContext_ReturnValue1) == 0x000098, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_ComponentBoundEvent_Button1) == 0x0000A0, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, Temp_bool_Variable1) == 0x0000B0, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_IsInCustomMode_IsCustom) == 0x0000B1, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_IsInCustomMode_IsCustom' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_IsInCustomMode_IsCustom1) == 0x0000B2, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_IsInCustomMode_IsCustom1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_Select_Default) == 0x0000B3, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_CustomEvent_NewFireMode) == 0x0000B4, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_CustomEvent_NewFireMode' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_IsInCustomMode_IsCustom2) == 0x0000B5, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_IsInCustomMode_IsCustom2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, CallFunc_BooleanOR_ReturnValue) == 0x0000B6, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel, K2Node_Select1_Default) == 0x0000B7, "Member 'HUDLayoutToolFireModePanel_C_ExecuteUbergraph_HUDLayoutToolFireModePanel::K2Node_Select1_Default' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.OnFire Mode Changed
// 0x0001 (0x0001 - 0x0000)
struct HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed final
{
public:
	EFireModeType                                 NewFireMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed) == 0x000001, "Wrong alignment on HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed) == 0x000001, "Wrong size on HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed, NewFireMode) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_OnFire_Mode_Changed::NewFireMode' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_BndEvt__PresetsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_BndEvt__CustomButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_BndEvt__TutorialConfirm_K2Node_ComponentBoundEvent_185_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.SetOpenState
// 0x0001 (0x0001 - 0x0000)
struct HUDLayoutToolFireModePanel_C_SetOpenState final
{
public:
	bool                                          bNewOpenState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_SetOpenState) == 0x000001, "Wrong alignment on HUDLayoutToolFireModePanel_C_SetOpenState");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_SetOpenState) == 0x000001, "Wrong size on HUDLayoutToolFireModePanel_C_SetOpenState");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetOpenState, bNewOpenState) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_SetOpenState::bNewOpenState' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.NewTileSelected
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_NewTileSelected final
{
public:
	class UFireModeSelectTile_C*                  Tile;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_NewTileSelected) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_NewTileSelected");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_NewTileSelected) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_NewTileSelected");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_NewTileSelected, Tile) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_NewTileSelected::Tile' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.HandleTileButtonFocused
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_HandleTileButtonFocused final
{
public:
	class UFireModeSelectTile_C*                  Tile;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_HandleTileButtonFocused) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_HandleTileButtonFocused");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_HandleTileButtonFocused) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_HandleTileButtonFocused");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_HandleTileButtonFocused, Tile) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_HandleTileButtonFocused::Tile' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.PlayCurFocusedTileMovie
// 0x0040 (0x0040 - 0x0000)
struct HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie final
{
public:
	class UFireModeSelectTile_C*                  CurFocusedTile;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  NextPanelToPlay;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDLayoutToolFireModeButton*           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFireModeSelectTile_C*                  K2Node_DynamicCast_AsFire_Mode_Select_Tile;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie) == 0x000040, "Wrong size on HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, CurFocusedTile) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::CurFocusedTile' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, NextPanelToPlay) == 0x000008, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::NextPanelToPlay' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, Temp_int_Array_Index_Variable) == 0x000010, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, CallFunc_Array_Get_Item) == 0x000020, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, K2Node_DynamicCast_AsFire_Mode_Select_Tile) == 0x000030, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::K2Node_DynamicCast_AsFire_Mode_Select_Tile' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00003A, "Member 'HUDLayoutToolFireModePanel_C_PlayCurFocusedTileMovie::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.HandleCurSelectedTile
// 0x0010 (0x0010 - 0x0000)
struct HUDLayoutToolFireModePanel_C_HandleCurSelectedTile final
{
public:
	class UFireModeSelectTile_C*                  Tile;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_HandleCurSelectedTile) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_HandleCurSelectedTile");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_HandleCurSelectedTile) == 0x000010, "Wrong size on HUDLayoutToolFireModePanel_C_HandleCurSelectedTile");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_HandleCurSelectedTile, Tile) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_HandleCurSelectedTile::Tile' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_HandleCurSelectedTile, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'HUDLayoutToolFireModePanel_C_HandleCurSelectedTile::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_HandleCurSelectedTile, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'HUDLayoutToolFireModePanel_C_HandleCurSelectedTile::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.InitButtonBindings
// 0x0058 (0x0058 - 0x0000)
struct HUDLayoutToolFireModePanel_C_InitButtonBindings final
{
public:
	TArray<class UHUDLayoutToolFireModeButton*>   ArrayOfFireModeButtons;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDLayoutToolFireModeButton*           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFireModeSelectTile_C*                  K2Node_DynamicCast_AsFire_Mode_Select_Tile;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFireModeSelectTile_C* Tile)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFireModeSelectTile_C* Tile)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_InitButtonBindings) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_InitButtonBindings");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_InitButtonBindings) == 0x000058, "Wrong size on HUDLayoutToolFireModePanel_C_InitButtonBindings");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, ArrayOfFireModeButtons) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::ArrayOfFireModeButtons' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, Temp_int_Array_Index_Variable) == 0x000014, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, CallFunc_Array_Get_Item) == 0x000020, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, K2Node_DynamicCast_AsFire_Mode_Select_Tile) == 0x000028, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::K2Node_DynamicCast_AsFire_Mode_Select_Tile' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_InitButtonBindings, K2Node_CreateDelegate_OutputDelegate1) == 0x000048, "Member 'HUDLayoutToolFireModePanel_C_InitButtonBindings::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.OnMouseButtonDown_0
// 0x0218 (0x0218 - 0x0000)
struct HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0) == 0x000218, "Wrong size on HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'HUDLayoutToolFireModePanel_C_OnMouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.SetCustomModeVisibilities
// 0x0050 (0x0050 - 0x0000)
struct HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFireModeAvailable_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFireModeAvailable_ReturnValue1;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFireModeAvailable_ReturnValue2;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue3;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFireModeAvailable_ReturnValue3;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFireModeType                                 CallFunc_GetFireMode_FireMode;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFireMode_bAutofireEnabled;             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFireMode_bForceTouchEnabled;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFireMode_bTapToShootEnabled;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFireMode_bAlwaysShowDedicatedButton;   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities) == 0x000050, "Wrong size on HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_IsFireModeAvailable_ReturnValue) == 0x000010, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_IsFireModeAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_bool_Variable) == 0x000011, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable1) == 0x000012, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable2) == 0x000013, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetContext_ReturnValue1) == 0x000018, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_IsFireModeAvailable_ReturnValue1) == 0x000020, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_IsFireModeAvailable_ReturnValue1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, K2Node_Select_Default) == 0x000021, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_bool_Variable1) == 0x000022, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable3) == 0x000023, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable4) == 0x000024, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_IsFireModeAvailable_ReturnValue2) == 0x000030, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_IsFireModeAvailable_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, K2Node_Select1_Default) == 0x000031, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_bool_Variable2) == 0x000032, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable5) == 0x000033, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable6) == 0x000034, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, K2Node_Select2_Default) == 0x000035, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_byte_Variable7) == 0x000036, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, Temp_bool_Variable3) == 0x000037, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetContext_ReturnValue3) == 0x000038, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetContext_ReturnValue4) == 0x000040, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_IsFireModeAvailable_ReturnValue3) == 0x000048, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_IsFireModeAvailable_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetFireMode_FireMode) == 0x000049, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetFireMode_FireMode' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetFireMode_bAutofireEnabled) == 0x00004A, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetFireMode_bAutofireEnabled' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetFireMode_bForceTouchEnabled) == 0x00004B, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetFireMode_bForceTouchEnabled' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetFireMode_bTapToShootEnabled) == 0x00004C, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetFireMode_bTapToShootEnabled' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, CallFunc_GetFireMode_bAlwaysShowDedicatedButton) == 0x00004D, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::CallFunc_GetFireMode_bAlwaysShowDedicatedButton' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities, K2Node_Select3_Default) == 0x00004E, "Member 'HUDLayoutToolFireModePanel_C_SetCustomModeVisibilities::K2Node_Select3_Default' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.SetCustomFireMode
// 0x0008 (0x0008 - 0x0000)
struct HUDLayoutToolFireModePanel_C_SetCustomFireMode final
{
public:
	class UHUDLayoutToolContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_SetCustomFireMode) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_SetCustomFireMode");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_SetCustomFireMode) == 0x000008, "Wrong size on HUDLayoutToolFireModePanel_C_SetCustomFireMode");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_SetCustomFireMode, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_SetCustomFireMode::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function HUDLayoutToolFireModePanel.HUDLayoutToolFireModePanel_C.IsInCustomMode
// 0x0018 (0x0018 - 0x0000)
struct HUDLayoutToolFireModePanel_C_IsInCustomMode final
{
public:
	bool                                          IsCustom;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDLayoutToolFireModePanel_C_IsInCustomMode) == 0x000008, "Wrong alignment on HUDLayoutToolFireModePanel_C_IsInCustomMode");
static_assert(sizeof(HUDLayoutToolFireModePanel_C_IsInCustomMode) == 0x000018, "Wrong size on HUDLayoutToolFireModePanel_C_IsInCustomMode");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_IsInCustomMode, IsCustom) == 0x000000, "Member 'HUDLayoutToolFireModePanel_C_IsInCustomMode::IsCustom' has a wrong offset!");
static_assert(offsetof(HUDLayoutToolFireModePanel_C_IsInCustomMode, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'HUDLayoutToolFireModePanel_C_IsInCustomMode::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
