#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDMinusTeamMemberInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD-TeamMemberInfo.HUD-TeamMemberInfo_C
// 0x0270 (0x04E8 - 0x0278)
class UHUDMinusTeamMemberInfo_C final : public UFortPlayerTrackerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _Image__Class_Icon;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Healthbar;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Platform;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeaderImage;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMicIndicator_C*                        MicIndicator;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPowerWidget_C*                         PowerWidget_Connected;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherConnectingStranger;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherContextualInfo;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeamMemberBluGloIndicator_C*           TeamMemberBluGloIndicator;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_6;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlayerName;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    MemberInfo;                                        // 0x02E0(0x0200)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowingHealth;                                     // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HUDMinusTeamMemberInfo(int32 EntryPoint);
	void OnPlayerInfoChanged(const struct FFortTeamMemberInfo& NewInfo);
	void Construct();
	void Update(const struct FFortTeamMemberInfo& UpdatedMemberInfo);
	void SetHealth(float Value);
	void UpdateHealthData(TArray<float>& Healths, TArray<float>& Shields);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD-TeamMemberInfo_C">();
	}
	static class UHUDMinusTeamMemberInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDMinusTeamMemberInfo_C>();
	}
};
static_assert(alignof(UHUDMinusTeamMemberInfo_C) == 0x000008, "Wrong alignment on UHUDMinusTeamMemberInfo_C");
static_assert(sizeof(UHUDMinusTeamMemberInfo_C) == 0x0004E8, "Wrong size on UHUDMinusTeamMemberInfo_C");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, UberGraphFrame) == 0x000278, "Member 'UHUDMinusTeamMemberInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, _Image__Class_Icon) == 0x000280, "Member 'UHUDMinusTeamMemberInfo_C::_Image__Class_Icon' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, _Image__Healthbar) == 0x000288, "Member 'UHUDMinusTeamMemberInfo_C::_Image__Healthbar' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, CommonTextBlock_1) == 0x000290, "Member 'UHUDMinusTeamMemberInfo_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, Image_Platform) == 0x000298, "Member 'UHUDMinusTeamMemberInfo_C::Image_Platform' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, LeaderImage) == 0x0002A0, "Member 'UHUDMinusTeamMemberInfo_C::LeaderImage' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, MicIndicator) == 0x0002A8, "Member 'UHUDMinusTeamMemberInfo_C::MicIndicator' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, PowerWidget_Connected) == 0x0002B0, "Member 'UHUDMinusTeamMemberInfo_C::PowerWidget_Connected' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, SwitcherConnectingStranger) == 0x0002B8, "Member 'UHUDMinusTeamMemberInfo_C::SwitcherConnectingStranger' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, SwitcherContextualInfo) == 0x0002C0, "Member 'UHUDMinusTeamMemberInfo_C::SwitcherContextualInfo' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, TeamMemberBluGloIndicator) == 0x0002C8, "Member 'UHUDMinusTeamMemberInfo_C::TeamMemberBluGloIndicator' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, TextBlock_6) == 0x0002D0, "Member 'UHUDMinusTeamMemberInfo_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, TextPlayerName) == 0x0002D8, "Member 'UHUDMinusTeamMemberInfo_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, MemberInfo) == 0x0002E0, "Member 'UHUDMinusTeamMemberInfo_C::MemberInfo' has a wrong offset!");
static_assert(offsetof(UHUDMinusTeamMemberInfo_C, ShowingHealth) == 0x0004E0, "Member 'UHUDMinusTeamMemberInfo_C::ShowingHealth' has a wrong offset!");

}

