#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImportFriends

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ImportFriends.ImportFriends_C.ExecuteUbergraph_ImportFriends
// 0x0108 (0x0108 - 0x0000)
struct ImportFriends_C_ExecuteUbergraph_ImportFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    Temp_byte_Variable2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	ESocialImportPanelPlatform                    Temp_byte_Variable3;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    Temp_byte_Variable10;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable13;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable14;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable15;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable16;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    Temp_byte_Variable17;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESocialImportPanelType                        K2Node_Event_NewType;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFrontEndCamera                               K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialImportPanelPlatform                    CallFunc_GetSocialPlatform_OutPlatform;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSocialPlatform_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIncentivized;                        // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select1_Default;                            // 0x0058(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0070(0x0018)()
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0090(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button1;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x00F0(0x0018)()
};
static_assert(alignof(ImportFriends_C_ExecuteUbergraph_ImportFriends) == 0x000008, "Wrong alignment on ImportFriends_C_ExecuteUbergraph_ImportFriends");
static_assert(sizeof(ImportFriends_C_ExecuteUbergraph_ImportFriends) == 0x000108, "Wrong size on ImportFriends_C_ExecuteUbergraph_ImportFriends");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, EntryPoint) == 0x000000, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::EntryPoint' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable) == 0x000004, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable1) == 0x000005, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable2) == 0x000010, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_text_Variable) == 0x000018, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable3) == 0x000030, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable4) == 0x000031, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable5) == 0x000032, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable6) == 0x000033, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable7) == 0x000034, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable8) == 0x000035, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable9) == 0x000036, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable10) == 0x000037, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable11) == 0x000038, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable12) == 0x000039, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable13) == 0x00003A, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable14) == 0x00003B, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable15) == 0x00003C, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable16) == 0x00003D, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_byte_Variable17) == 0x00003E, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_IsDesignTime) == 0x00003F, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_NewType) == 0x000040, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_NewType' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, Temp_bool_Variable) == 0x000041, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select_Default) == 0x000042, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetSocialPlatform_OutPlatform) == 0x000050, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetSocialPlatform_OutPlatform' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetSocialPlatform_ReturnValue) == 0x000051, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetSocialPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_bIncentivized) == 0x000052, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_bIncentivized' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select1_Default) == 0x000058, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_MakeLiteralText_ReturnValue) == 0x000070, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select2_Default) == 0x000088, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_TextToUpper_ReturnValue) == 0x000090, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_GetEndTime_ReturnValue) == 0x0000B0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, CallFunc_PlayAnimation_ReturnValue1) == 0x0000B8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_AsIcon_Text_Button) == 0x0000C0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_AsIcon_Text_Button1) == 0x0000D0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_AsIcon_Text_Button1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_DynamicCast_bSuccess1) == 0x0000D8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_Animation) == 0x0000E0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select3_Default) == 0x0000E8, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Event_bUsingGamepad) == 0x0000E9, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ExecuteUbergraph_ImportFriends, K2Node_Select4_Default) == 0x0000F0, "Member 'ImportFriends_C_ExecuteUbergraph_ImportFriends::K2Node_Select4_Default' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImportFriends_C_OnInputModeChanged) == 0x000001, "Wrong alignment on ImportFriends_C_OnInputModeChanged");
static_assert(sizeof(ImportFriends_C_OnInputModeChanged) == 0x000001, "Wrong size on ImportFriends_C_OnInputModeChanged");
static_assert(offsetof(ImportFriends_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'ImportFriends_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct ImportFriends_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_OnAnimationFinished) == 0x000008, "Wrong alignment on ImportFriends_C_OnAnimationFinished");
static_assert(sizeof(ImportFriends_C_OnAnimationFinished) == 0x000008, "Wrong size on ImportFriends_C_OnAnimationFinished");
static_assert(offsetof(ImportFriends_C_OnAnimationFinished, Animation) == 0x000000, "Member 'ImportFriends_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.OnIncentivizedSet
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_OnIncentivizedSet final
{
public:
	bool                                          bIncentivized;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImportFriends_C_OnIncentivizedSet) == 0x000001, "Wrong alignment on ImportFriends_C_OnIncentivizedSet");
static_assert(sizeof(ImportFriends_C_OnIncentivizedSet) == 0x000001, "Wrong size on ImportFriends_C_OnIncentivizedSet");
static_assert(offsetof(ImportFriends_C_OnIncentivizedSet, bIncentivized) == 0x000000, "Member 'ImportFriends_C_OnIncentivizedSet::bIncentivized' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ImportFriends_C_BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.OnPanelTypeSet
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_OnPanelTypeSet final
{
public:
	ESocialImportPanelType                        NewType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_OnPanelTypeSet) == 0x000001, "Wrong alignment on ImportFriends_C_OnPanelTypeSet");
static_assert(sizeof(ImportFriends_C_OnPanelTypeSet) == 0x000001, "Wrong size on ImportFriends_C_OnPanelTypeSet");
static_assert(offsetof(ImportFriends_C_OnPanelTypeSet, NewType) == 0x000000, "Member 'ImportFriends_C_OnPanelTypeSet::NewType' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ImportFriends_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImportFriends_C_PreConstruct) == 0x000001, "Wrong alignment on ImportFriends_C_PreConstruct");
static_assert(sizeof(ImportFriends_C_PreConstruct) == 0x000001, "Wrong size on ImportFriends_C_PreConstruct");
static_assert(offsetof(ImportFriends_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ImportFriends_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.ScaleTextboxWithWrappingWorkaround
// 0x0078 (0x0078 - 0x0000)
struct ImportFriends_C_ScaleTextboxWithWrappingWorkaround final
{
public:
	class UScaleBox*                              ContainingScaleBox;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharLimitThreshold;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       TargetText;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrapAtHorrizontal;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleCharThreshold;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround) == 0x000008, "Wrong alignment on ImportFriends_C_ScaleTextboxWithWrappingWorkaround");
static_assert(sizeof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround) == 0x000078, "Wrong size on ImportFriends_C_ScaleTextboxWithWrappingWorkaround");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, ContainingScaleBox) == 0x000000, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::ContainingScaleBox' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CharLimitThreshold) == 0x000008, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CharLimitThreshold' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, TargetText) == 0x000010, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::TargetText' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, WrapAtHorrizontal) == 0x000018, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::WrapAtHorrizontal' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, ScaleCharThreshold) == 0x00001C, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::ScaleCharThreshold' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000050, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Len_ReturnValue) == 0x000054, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000058, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_FMax_ReturnValue) == 0x000060, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000064, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_FClamp_ReturnValue) == 0x000068, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x00006C, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextboxWithWrappingWorkaround, CallFunc_FTrunc_ReturnValue) == 0x000070, "Member 'ImportFriends_C_ScaleTextboxWithWrappingWorkaround::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.ScaleTextButton
// 0x0048 (0x0048 - 0x0000)
struct ImportFriends_C_ScaleTextButton final
{
public:
	int32                                         CharThreshold;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBox*                              ContainingScaleBox;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImportFriends_C_ScaleTextButton) == 0x000008, "Wrong alignment on ImportFriends_C_ScaleTextButton");
static_assert(sizeof(ImportFriends_C_ScaleTextButton) == 0x000048, "Wrong size on ImportFriends_C_ScaleTextButton");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CharThreshold) == 0x000000, "Member 'ImportFriends_C_ScaleTextButton::CharThreshold' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, ContainingScaleBox) == 0x000008, "Member 'ImportFriends_C_ScaleTextButton::ContainingScaleBox' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, Button) == 0x000010, "Member 'ImportFriends_C_ScaleTextButton::Button' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_Len_ReturnValue) == 0x000030, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000034, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_FMax_ReturnValue) == 0x00003C, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000040, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_ScaleTextButton, CallFunc_FClamp_ReturnValue) == 0x000044, "Member 'ImportFriends_C_ScaleTextButton::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function ImportFriends.ImportFriends_C.SetupNav
// 0x0010 (0x0010 - 0x0000)
struct ImportFriends_C_SetupNav final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImportFriends_C_SetupNav) == 0x000008, "Wrong alignment on ImportFriends_C_SetupNav");
static_assert(sizeof(ImportFriends_C_SetupNav) == 0x000010, "Wrong size on ImportFriends_C_SetupNav");
static_assert(offsetof(ImportFriends_C_SetupNav, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'ImportFriends_C_SetupNav::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_SetupNav, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000008, "Member 'ImportFriends_C_SetupNav::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImportFriends_C_SetupNav, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'ImportFriends_C_SetupNav::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

