#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputReflector

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function InputReflector.InputReflector_C.ExecuteUbergraph_InputReflector
// 0x0030 (0x0030 - 0x0000)
struct InputReflector_C_ExecuteUbergraph_InputReflector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_Event_AddedButton;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCommonInputActionHandlerData          K2Node_Event_Data;                                 // 0x0010(0x0020)(ConstParm, NoDestructor)
};
static_assert(alignof(InputReflector_C_ExecuteUbergraph_InputReflector) == 0x000008, "Wrong alignment on InputReflector_C_ExecuteUbergraph_InputReflector");
static_assert(sizeof(InputReflector_C_ExecuteUbergraph_InputReflector) == 0x000030, "Wrong size on InputReflector_C_ExecuteUbergraph_InputReflector");
static_assert(offsetof(InputReflector_C_ExecuteUbergraph_InputReflector, EntryPoint) == 0x000000, "Member 'InputReflector_C_ExecuteUbergraph_InputReflector::EntryPoint' has a wrong offset!");
static_assert(offsetof(InputReflector_C_ExecuteUbergraph_InputReflector, K2Node_Event_AddedButton) == 0x000008, "Member 'InputReflector_C_ExecuteUbergraph_InputReflector::K2Node_Event_AddedButton' has a wrong offset!");
static_assert(offsetof(InputReflector_C_ExecuteUbergraph_InputReflector, K2Node_Event_Data) == 0x000010, "Member 'InputReflector_C_ExecuteUbergraph_InputReflector::K2Node_Event_Data' has a wrong offset!");

// Function InputReflector.InputReflector_C.OnButtonAdded
// 0x0028 (0x0028 - 0x0000)
struct InputReflector_C_OnButtonAdded final
{
public:
	class UCommonButton*                          AddedButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCommonInputActionHandlerData          Data;                                              // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(InputReflector_C_OnButtonAdded) == 0x000008, "Wrong alignment on InputReflector_C_OnButtonAdded");
static_assert(sizeof(InputReflector_C_OnButtonAdded) == 0x000028, "Wrong size on InputReflector_C_OnButtonAdded");
static_assert(offsetof(InputReflector_C_OnButtonAdded, AddedButton) == 0x000000, "Member 'InputReflector_C_OnButtonAdded::AddedButton' has a wrong offset!");
static_assert(offsetof(InputReflector_C_OnButtonAdded, Data) == 0x000008, "Member 'InputReflector_C_OnButtonAdded::Data' has a wrong offset!");

// Function InputReflector.InputReflector_C.HandleAddButton
// 0x0030 (0x0030 - 0x0000)
struct InputReflector_C_HandleAddButton final
{
public:
	class UCommonButton*                          AddedButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     HBoxSlot;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          CallFunc_StyleButton_ButtonStyled;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputReflector_C_HandleAddButton) == 0x000008, "Wrong alignment on InputReflector_C_HandleAddButton");
static_assert(sizeof(InputReflector_C_HandleAddButton) == 0x000030, "Wrong size on InputReflector_C_HandleAddButton");
static_assert(offsetof(InputReflector_C_HandleAddButton, AddedButton) == 0x000000, "Member 'InputReflector_C_HandleAddButton::AddedButton' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, HBoxSlot) == 0x000008, "Member 'InputReflector_C_HandleAddButton::HBoxSlot' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, CallFunc_StyleButton_ButtonStyled) == 0x000010, "Member 'InputReflector_C_HandleAddButton::CallFunc_StyleButton_ButtonStyled' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'InputReflector_C_HandleAddButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, CallFunc_GetFeatureState_OutFeatureState) == 0x000020, "Member 'InputReflector_C_HandleAddButton::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, CallFunc_GetFeatureState_OutReason) == 0x000021, "Member 'InputReflector_C_HandleAddButton::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'InputReflector_C_HandleAddButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(InputReflector_C_HandleAddButton, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000028, "Member 'InputReflector_C_HandleAddButton::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function InputReflector.InputReflector_C.StyleButton
// 0x0038 (0x0038 - 0x0000)
struct InputReflector_C_StyleButton final
{
public:
	class UCommonButton*                          ButtonToStyle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          ButtonStyled;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputReflectorButton_C*                ReflectorButton;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputReflectorButton_C*                K2Node_DynamicCast_AsInput_Reflector_Button;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputReflector_C_StyleButton) == 0x000008, "Wrong alignment on InputReflector_C_StyleButton");
static_assert(sizeof(InputReflector_C_StyleButton) == 0x000038, "Wrong size on InputReflector_C_StyleButton");
static_assert(offsetof(InputReflector_C_StyleButton, ButtonToStyle) == 0x000000, "Member 'InputReflector_C_StyleButton::ButtonToStyle' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, ButtonStyled) == 0x000008, "Member 'InputReflector_C_StyleButton::ButtonStyled' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, ReflectorButton) == 0x000010, "Member 'InputReflector_C_StyleButton::ReflectorButton' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, K2Node_DynamicCast_AsInput_Reflector_Button) == 0x000018, "Member 'InputReflector_C_StyleButton::K2Node_DynamicCast_AsInput_Reflector_Button' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'InputReflector_C_StyleButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'InputReflector_C_StyleButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, CallFunc_GetFeatureState_OutFeatureState) == 0x000030, "Member 'InputReflector_C_StyleButton::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, CallFunc_GetFeatureState_OutReason) == 0x000031, "Member 'InputReflector_C_StyleButton::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(InputReflector_C_StyleButton, K2Node_SwitchEnum_CmpSuccess) == 0x000032, "Member 'InputReflector_C_StyleButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

