#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InviteListEntry_PartyInvite_XS1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InviteListEntry_PartyInvite_XS1.InviteListEntry_PartyInvite_XS1_C
// 0x0070 (0x0BC0 - 0x0B50)
class UInviteListEntry_PartyInvite_XS1_C final : public USocialInviteListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0B60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EmptyButtonToEatOneMouseUpEvent;                   // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RichPresence;                                 // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x0B90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x0BA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x0BB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InviteListEntry_PartyInvite_XS1(int32 EntryPoint);
	void BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void HandleOnlineIndicatorView(EOnlineStatus OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InviteListEntry_PartyInvite_XS1_C">();
	}
	static class UInviteListEntry_PartyInvite_XS1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInviteListEntry_PartyInvite_XS1_C>();
	}
};
static_assert(alignof(UInviteListEntry_PartyInvite_XS1_C) == 0x000008, "Wrong alignment on UInviteListEntry_PartyInvite_XS1_C");
static_assert(sizeof(UInviteListEntry_PartyInvite_XS1_C) == 0x000BC0, "Wrong size on UInviteListEntry_PartyInvite_XS1_C");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, UberGraphFrame) == 0x000B50, "Member 'UInviteListEntry_PartyInvite_XS1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Selected) == 0x000B58, "Member 'UInviteListEntry_PartyInvite_XS1_C::Selected' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Hovered) == 0x000B60, "Member 'UInviteListEntry_PartyInvite_XS1_C::Hovered' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Arrow) == 0x000B68, "Member 'UInviteListEntry_PartyInvite_XS1_C::Arrow' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Border_OnlineStatusIndicator) == 0x000B70, "Member 'UInviteListEntry_PartyInvite_XS1_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, EmptyButtonToEatOneMouseUpEvent) == 0x000B78, "Member 'UInviteListEntry_PartyInvite_XS1_C::EmptyButtonToEatOneMouseUpEvent' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, EntryBorder) == 0x000B80, "Member 'UInviteListEntry_PartyInvite_XS1_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Text_RichPresence) == 0x000B88, "Member 'UInviteListEntry_PartyInvite_XS1_C::Text_RichPresence' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Online) == 0x000B90, "Member 'UInviteListEntry_PartyInvite_XS1_C::Online' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Offline) == 0x000BA0, "Member 'UInviteListEntry_PartyInvite_XS1_C::Offline' has a wrong offset!");
static_assert(offsetof(UInviteListEntry_PartyInvite_XS1_C, Away) == 0x000BB0, "Member 'UInviteListEntry_PartyInvite_XS1_C::Away' has a wrong offset!");

}

