#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedVariationReceived

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ItemReceivedVariationReceived.ItemReceivedVariationReceived_C.ExecuteUbergraph_ItemReceivedVariationReceived
// 0x0058 (0x0058 - 0x0000)
struct ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReceivedItemLootInfo              CallFunc_Array_Get_Item;                           // 0x0008(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived) == 0x000008, "Wrong alignment on ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived");
static_assert(sizeof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived) == 0x000058, "Wrong size on ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived");
static_assert(offsetof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived, EntryPoint) == 0x000000, "Member 'ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived, CallFunc_Array_Get_Item) == 0x000008, "Member 'ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'ItemReceivedVariationReceived_C_ExecuteUbergraph_ItemReceivedVariationReceived::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

