#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceived_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemReceived_Base.ItemReceived_Base_C.ExecuteUbergraph_ItemReceived_Base
// 0x04B8 (0x04B8 - 0x0000)
struct ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_Passthrough;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromSelf;                            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CenterWidget;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemCardWidget_C*                      K2Node_DynamicCast_AsItem_Card_Widget;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	bool                                          Temp_bool_Variable1;                               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable1;                               // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x00A8(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortReceivedItemLootInfo              CallFunc_Array_Get_Item;                           // 0x00D8(0x0028)()
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Who;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0110(0x0080)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_197[0x1];                                      // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortReceivedItemLootInfo              CallFunc_Array_Get_Item1;                          // 0x01A8(0x0028)()
	class UItemCardWidget_C*                      CallFunc_AddItemCard_ReturnValue;                  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGiftBoxItemDefinition*             CallFunc_GetGiftBoxDefinition_ReturnValue;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue1;                  // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemCardWidget_C*                      K2Node_DynamicCast_AsItem_Card_Widget1;            // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemReceivedHeaderSubWidgetBase_C*     K2Node_DynamicCast_AsItem_Received_Header_Sub_Widget_Base; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B[0x1];                                      // 0x023B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortReceivedItemLootInfo              CallFunc_Array_Get_Item2;                          // 0x0240(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemCardWidget_C*                      CallFunc_AddItemCard_ReturnValue1;                 // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0298(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x02E0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0340(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35B[0x1];                                      // 0x035B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue1;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      CallFunc_GetItemInstancesByDefinition_Items;       // 0x0370(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item3;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFavorite_ReturnValue;                   // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x03B8(0x0020)()
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue1; // 0x03D8(0x0020)()
	TArray<struct FFortAnalyticsEventAttribute>   K2Node_MakeArray_Array1;                           // 0x03F8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0410(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0458(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0468(0x0018)()
	class FText                                   K2Node_Select3_Default;                            // 0x0480(0x0018)()
	class FText                                   K2Node_Select4_Default;                            // 0x0498(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base) == 0x000008, "Wrong alignment on ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base");
static_assert(sizeof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base) == 0x0004B8, "Wrong size on ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, EntryPoint) == 0x000000, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_byte_Variable) == 0x000008, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_IsClosed_Variable) == 0x000009, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_int_Variable) == 0x00000C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_byte_Variable1) == 0x000011, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_ComponentBoundEvent_Button2) == 0x000018, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_HandleBack_Passthrough) == 0x000020, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_HandleBack_Passthrough' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Event_bFromSelf) == 0x000021, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Event_bFromSelf' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetUINavigationManager_ReturnValue) == 0x000028, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_Variable) == 0x000030, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_CustomEvent_Index) == 0x000038, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_CustomEvent_CenterWidget) == 0x00003C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_CustomEvent_CenterWidget' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_AsItem_Card_Widget) == 0x000048, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_AsItem_Card_Widget' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_text_Variable) == 0x000058, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_Variable1) == 0x000070, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000071, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000088, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_text_Variable1) == 0x000090, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_text_Variable2) == 0x0000A8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_Variable2) == 0x0000C1, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_CustomEvent_NewParam) == 0x000100, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_CustomEvent_Who) == 0x000104, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_CustomEvent_Who' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000108, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetRarity_ReturnValue) == 0x000109, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_BPGetRarityData_ReturnValue) == 0x000110, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Length_ReturnValue1) == 0x000190, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000194, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_BooleanOR_ReturnValue) == 0x000195, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Select_Default) == 0x000196, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetContext_ReturnValue) == 0x000198, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_int_Array_Index_Variable1) == 0x0001A0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Get_Item1) == 0x0001A8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_AddItemCard_ReturnValue) == 0x0001D0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_AddItemCard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_byte_Variable2) == 0x0001D8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_byte_Variable3) == 0x0001D9, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_Variable3) == 0x0001DA, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetGiftBoxDefinition_ReturnValue) == 0x0001E0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetGiftBoxDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetChildAt_ReturnValue1) == 0x0001E8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetChildAt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Create_ReturnValue) == 0x0001F0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_AsItem_Card_Widget1) == 0x0001F8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_AsItem_Card_Widget1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_bSuccess1) == 0x000200, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_AsItem_Received_Header_Sub_Widget_Base) == 0x000208, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_AsItem_Received_Header_Sub_Widget_Base' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_bSuccess2) == 0x000210, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_AddChild_ReturnValue) == 0x000218, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Greater_IntInt_ReturnValue) == 0x000220, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_int_Loop_Counter_Variable) == 0x000224, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Add_IntInt_ReturnValue1) == 0x000228, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_byte_Variable4) == 0x00022C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_ComponentBoundEvent_Button1) == 0x000230, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_byte_Variable5) == 0x000238, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_bool_Variable4) == 0x000239, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Event_bUsingGamepad) == 0x00023A, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_int_Variable1) == 0x00023C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Get_Item2) == 0x000240, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Length_ReturnValue2) == 0x000268, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Less_IntInt_ReturnValue) == 0x00026C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00026D, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_CreateDelegate_OutputDelegate1) == 0x000270, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_ComponentBoundEvent_Button) == 0x000280, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Add_IntInt_ReturnValue2) == 0x000288, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Length_ReturnValue3) == 0x00028C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_AddItemCard_ReturnValue1) == 0x000290, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_AddItemCard_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_MakeStruct_FormatArgumentData) == 0x000298, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Add_IntInt_ReturnValue3) == 0x0002D8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_MakeStruct_FormatArgumentData1) == 0x0002E0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Length_ReturnValue4) == 0x000320, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_MakeArray_Array) == 0x000328, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Subtract_IntInt_ReturnValue) == 0x000338, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Format_ReturnValue) == 0x000340, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x000358, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Select1_Default) == 0x000359, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Select2_Default) == 0x00035A, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetChildrenCount_ReturnValue) == 0x00035C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000360, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetContext_ReturnValue1) == 0x000368, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetItemInstancesByDefinition_Items) == 0x000370, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetItemInstancesByDefinition_Items' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, Temp_int_Loop_Counter_Variable1) == 0x000380, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Get_Item3) == 0x000388, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_AsFort_Account_Item) == 0x000390, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_DynamicCast_bSuccess3) == 0x000398, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Less_IntInt_ReturnValue1) == 0x000399, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_IsFavorite_ReturnValue) == 0x00039A, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_IsFavorite_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Not_PreBool_ReturnValue) == 0x00039B, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Add_IntInt_ReturnValue4) == 0x00039C, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetContext_ReturnValue2) == 0x0003A0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_GetDisplayName_ReturnValue) == 0x0003A8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x0003B8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_ConstructAnalyticsAttribute_ReturnValue1) == 0x0003D8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_ConstructAnalyticsAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_MakeArray_Array1) == 0x0003F8, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Array_Length_ReturnValue5) == 0x000408, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_MakeStruct_FormatArgumentData2) == 0x000410, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Greater_IntInt_ReturnValue1) == 0x000450, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_MakeArray_Array2) == 0x000458, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_Format_ReturnValue1) == 0x000468, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Select3_Default) == 0x000480, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, K2Node_Select4_Default) == 0x000498, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base, CallFunc_PlayAnimation_ReturnValue1) == 0x0004B0, "Member 'ItemReceived_Base_C_ExecuteUbergraph_ItemReceived_Base::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemReceived_Base_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemReceived_Base_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemReceived_Base_C_OnInputModeChanged) == 0x000001, "Wrong alignment on ItemReceived_Base_C_OnInputModeChanged");
static_assert(sizeof(ItemReceived_Base_C_OnInputModeChanged) == 0x000001, "Wrong size on ItemReceived_Base_C_OnInputModeChanged");
static_assert(offsetof(ItemReceived_Base_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'ItemReceived_Base_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemReceived_Base_C_BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.UpdateRarityFlare
// 0x0008 (0x0008 - 0x0000)
struct ItemReceived_Base_C_UpdateRarityFlare final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Who;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceived_Base_C_UpdateRarityFlare) == 0x000004, "Wrong alignment on ItemReceived_Base_C_UpdateRarityFlare");
static_assert(sizeof(ItemReceived_Base_C_UpdateRarityFlare) == 0x000008, "Wrong size on ItemReceived_Base_C_UpdateRarityFlare");
static_assert(offsetof(ItemReceived_Base_C_UpdateRarityFlare, NewParam) == 0x000000, "Member 'ItemReceived_Base_C_UpdateRarityFlare::NewParam' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_UpdateRarityFlare, Who) == 0x000004, "Member 'ItemReceived_Base_C_UpdateRarityFlare::Who' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.SelectItem
// 0x0008 (0x0008 - 0x0000)
struct ItemReceived_Base_C_SelectItem final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CenterWidget;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemReceived_Base_C_SelectItem) == 0x000004, "Wrong alignment on ItemReceived_Base_C_SelectItem");
static_assert(sizeof(ItemReceived_Base_C_SelectItem) == 0x000008, "Wrong size on ItemReceived_Base_C_SelectItem");
static_assert(offsetof(ItemReceived_Base_C_SelectItem, Param_Index) == 0x000000, "Member 'ItemReceived_Base_C_SelectItem::Param_Index' has a wrong offset!");
static_assert(offsetof(ItemReceived_Base_C_SelectItem, CenterWidget) == 0x000004, "Member 'ItemReceived_Base_C_SelectItem::CenterWidget' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.OnGiftBoxItemSet
// 0x0001 (0x0001 - 0x0000)
struct ItemReceived_Base_C_OnGiftBoxItemSet final
{
public:
	bool                                          bFromSelf;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemReceived_Base_C_OnGiftBoxItemSet) == 0x000001, "Wrong alignment on ItemReceived_Base_C_OnGiftBoxItemSet");
static_assert(sizeof(ItemReceived_Base_C_OnGiftBoxItemSet) == 0x000001, "Wrong size on ItemReceived_Base_C_OnGiftBoxItemSet");
static_assert(offsetof(ItemReceived_Base_C_OnGiftBoxItemSet, bFromSelf) == 0x000000, "Member 'ItemReceived_Base_C_OnGiftBoxItemSet::bFromSelf' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemReceived_Base_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemReceived_Base.ItemReceived_Base_C.HandleBack
// 0x0018 (0x0018 - 0x0000)
struct ItemReceived_Base_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceived_Base_C_HandleBack) == 0x000008, "Wrong alignment on ItemReceived_Base_C_HandleBack");
static_assert(sizeof(ItemReceived_Base_C_HandleBack) == 0x000018, "Wrong size on ItemReceived_Base_C_HandleBack");
static_assert(offsetof(ItemReceived_Base_C_HandleBack, PassThrough) == 0x000000, "Member 'ItemReceived_Base_C_HandleBack::PassThrough' has a wrong offset!");
