#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedBattlePassHeader

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemReceivedBattlePassHeader.ItemReceivedBattlePassHeader_C.ExecuteUbergraph_ItemReceivedBattlePassHeader
// 0x00E8 (0x00E8 - 0x0000)
struct ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpProfileAthena*                  CallFunc_GetAthenaProfile_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortReceivedItemLootInfo              CallFunc_Array_Get_Item;                           // 0x0020(0x0028)()
	bool                                          CallFunc_HasPurchasedSeasonBook_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_Select1_Default;                            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
};
static_assert(alignof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader) == 0x000008, "Wrong alignment on ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader");
static_assert(sizeof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader) == 0x0000E8, "Wrong size on ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, EntryPoint) == 0x000000, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, Temp_bool_Variable) == 0x000004, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_GetAthenaProfile_ReturnValue) == 0x000018, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_GetAthenaProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_Array_Get_Item) == 0x000020, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_HasPurchasedSeasonBook_ReturnValue) == 0x000048, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_HasPurchasedSeasonBook_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, K2Node_Select_Default) == 0x000058, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, Temp_bool_Variable1) == 0x000060, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, K2Node_Select1_Default) == 0x000068, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_Array_Length_ReturnValue1) == 0x000078, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, K2Node_MakeArray_Array) == 0x0000C0, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'ItemReceivedBattlePassHeader_C_ExecuteUbergraph_ItemReceivedBattlePassHeader::CallFunc_Format_ReturnValue' has a wrong offset!");

}

