#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedUnGiftHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemReceivedUnGiftHeader.ItemReceivedUnGiftHeader_C.ExecuteUbergraph_ItemReceivedUnGiftHeader
// 0x0100 (0x0100 - 0x0000)
struct ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAccountID_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
	class FString                                 CallFunc_TryGetParamString_OutValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetParamString_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x00E0(0x0018)()
	bool                                          CallFunc_HasParam_ReturnValue;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader) == 0x000008, "Wrong alignment on ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader");
static_assert(sizeof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader) == 0x000100, "Wrong size on ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, EntryPoint) == 0x000000, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, Temp_bool_Variable) == 0x000004, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_HasAccountID_ReturnValue) == 0x000005, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_HasAccountID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, Temp_text_Variable) == 0x000008, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_BooleanOR_ReturnValue) == 0x000080, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, K2Node_MakeArray_Array) == 0x000088, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_Format_ReturnValue) == 0x000098, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, K2Node_Select_Default) == 0x0000B0, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_TryGetParamString_OutValue) == 0x0000C8, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_TryGetParamString_OutValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_TryGetParamString_ReturnValue) == 0x0000D8, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_TryGetParamString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_Conv_StringToText_ReturnValue1) == 0x0000E0, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader, CallFunc_HasParam_ReturnValue) == 0x0000F8, "Member 'ItemReceivedUnGiftHeader_C_ExecuteUbergraph_ItemReceivedUnGiftHeader::CallFunc_HasParam_ReturnValue' has a wrong offset!");

}

