#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectUpgradeConfirmation

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.ExecuteUbergraph_ItemInspectUpgradeConfirmation
// 0x0080 (0x0080 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInspectRefundRayImage_C*           CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRefundable_ReturnValue;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation) == 0x000080, "Wrong size on ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, EntryPoint) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, Temp_name_Variable) == 0x000010, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, Temp_byte_Variable) == 0x000018, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_Create_ReturnValue) == 0x000020, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000030, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_ComponentBoundEvent_Button1) == 0x000040, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_CustomEvent_Result) == 0x000050, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_CustomEvent_ResultName) == 0x000054, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_DynamicCast_AsFort_Account_Item) == 0x000060, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_IsRefundable_ReturnValue) == 0x000069, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_IsRefundable_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'ItemInspectUpgradeConfirmation_C_ExecuteUbergraph_ItemInspectUpgradeConfirmation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeCancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_BndEvt__UpgradeConfirmButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6
// 0x000C (0x000C - 0x0000)
struct ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6) == 0x000004, "Wrong alignment on ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6) == 0x00000C, "Wrong size on ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6, Result) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6::Result' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6, ResultName) == 0x000004, "Member 'ItemInspectUpgradeConfirmation_C_DialogResult_7CBA8AFE42D6A992B7FAA095E3A769C6::ResultName' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.Refresh
// 0x0018 (0x0018 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_Refresh final
{
public:
	class UFortPersistentResourceItemDefinition*  CallFunc_GetUpgradeResourceItemDefinition_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUpgradeCost_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_Refresh) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_Refresh");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_Refresh) == 0x000018, "Wrong size on ItemInspectUpgradeConfirmation_C_Refresh");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_Refresh, CallFunc_GetUpgradeResourceItemDefinition_ReturnValue) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_Refresh::CallFunc_GetUpgradeResourceItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_Refresh, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_Refresh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_Refresh, CallFunc_GetUpgradeCost_ReturnValue) == 0x00000C, "Member 'ItemInspectUpgradeConfirmation_C_Refresh::CallFunc_GetUpgradeCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_Refresh, CallFunc_IsVisible_ReturnValue) == 0x000010, "Member 'ItemInspectUpgradeConfirmation_C_Refresh::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.SetItemToRepresent
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_SetItemToRepresent final
{
public:
	class UFortItem*                              Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_SetItemToRepresent) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_SetItemToRepresent");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_SetItemToRepresent) == 0x000008, "Wrong size on ItemInspectUpgradeConfirmation_C_SetItemToRepresent");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_SetItemToRepresent, Param_Item) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_SetItemToRepresent::Param_Item' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.OnShow
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_OnShow final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_OnShow) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_OnShow");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_OnShow) == 0x000008, "Wrong size on ItemInspectUpgradeConfirmation_C_OnShow");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_OnShow, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_OnShow::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.RefreshOnUpgrade
// 0x0010 (0x0010 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade final
{
public:
	int32                                         CallFunc_GetMaxLevel_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUpgradeCost_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade) == 0x000004, "Wrong alignment on ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade) == 0x000010, "Wrong size on ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade, CallFunc_GetMaxLevel_ReturnValue) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade::CallFunc_GetMaxLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade, CallFunc_GetLevel_ReturnValue) == 0x000004, "Member 'ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade, CallFunc_GetUpgradeCost_ReturnValue) == 0x00000C, "Member 'ItemInspectUpgradeConfirmation_C_RefreshOnUpgrade::CallFunc_GetUpgradeCost_ReturnValue' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.IsUpgradeAvailable
// 0x0020 (0x0020 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable final
{
public:
	bool                                          UpgradeAvailable;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EItemUpgradeRestrictionReason>         CallFunc_CanBeUpgraded_OutRestrictionReasons;      // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CanBeUpgraded_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable) == 0x000020, "Wrong size on ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable, UpgradeAvailable) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable::UpgradeAvailable' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable, CallFunc_CanBeUpgraded_OutRestrictionReasons) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable::CallFunc_CanBeUpgraded_OutRestrictionReasons' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable, CallFunc_CanBeUpgraded_ReturnValue) == 0x000018, "Member 'ItemInspectUpgradeConfirmation_C_IsUpgradeAvailable::CallFunc_CanBeUpgraded_ReturnValue' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.CanAffordUpgrade
// 0x0020 (0x0020 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_CanAffordUpgrade final
{
public:
	bool                                          CanAfford;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPersistentResourceItemDefinition*  CallFunc_GetUpgradeResourceItemDefinition_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInInventory_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_CanAffordUpgrade");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade) == 0x000020, "Wrong size on ItemInspectUpgradeConfirmation_C_CanAffordUpgrade");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade, CanAfford) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_CanAffordUpgrade::CanAfford' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade, CallFunc_GetUpgradeResourceItemDefinition_ReturnValue) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_CanAffordUpgrade::CallFunc_GetUpgradeResourceItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'ItemInspectUpgradeConfirmation_C_CanAffordUpgrade::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade, CallFunc_GetNumInInventory_ReturnValue) == 0x000018, "Member 'ItemInspectUpgradeConfirmation_C_CanAffordUpgrade::CallFunc_GetNumInInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_CanAffordUpgrade, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'ItemInspectUpgradeConfirmation_C_CanAffordUpgrade::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.RefreshEnabledState
// 0x0040 (0x0040 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_RefreshEnabledState final
{
public:
	bool                                          CallFunc_IsUpgradeAvailable_UpgradeAvailable;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAffordUpgrade_CanAfford;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EItemUpgradeRestrictionReason>         CallFunc_CanBeUpgraded_OutRestrictionReasons;      // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CanBeUpgraded_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemUpgradeRestrictionReason                 CallFunc_Array_Get_Item;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetUpgradeRestrictionReasonText_ReturnValue; // 0x0020(0x0018)()
	bool                                          CallFunc_IsUpgradeAvailable_UpgradeAvailable1;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_RefreshEnabledState");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState) == 0x000040, "Wrong size on ItemInspectUpgradeConfirmation_C_RefreshEnabledState");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_IsUpgradeAvailable_UpgradeAvailable) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_IsUpgradeAvailable_UpgradeAvailable' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_CanAffordUpgrade_CanAfford) == 0x000001, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_CanAffordUpgrade_CanAfford' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_CanBeUpgraded_OutRestrictionReasons) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_CanBeUpgraded_OutRestrictionReasons' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_CanBeUpgraded_ReturnValue) == 0x000018, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_CanBeUpgraded_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_Array_Get_Item) == 0x000019, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_GetUpgradeRestrictionReasonText_ReturnValue) == 0x000020, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_GetUpgradeRestrictionReasonText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_IsUpgradeAvailable_UpgradeAvailable1) == 0x000038, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_IsUpgradeAvailable_UpgradeAvailable1' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshEnabledState, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'ItemInspectUpgradeConfirmation_C_RefreshEnabledState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ItemInspectUpgradeConfirmation.ItemInspectUpgradeConfirmation_C.RefreshLevelInfo
// 0x0108 (0x0108 - 0x0000)
struct ItemInspectUpgradeConfirmation_C_RefreshLevelInfo final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0028(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x00F0(0x0018)()
};
static_assert(alignof(ItemInspectUpgradeConfirmation_C_RefreshLevelInfo) == 0x000008, "Wrong alignment on ItemInspectUpgradeConfirmation_C_RefreshLevelInfo");
static_assert(sizeof(ItemInspectUpgradeConfirmation_C_RefreshLevelInfo) == 0x000108, "Wrong size on ItemInspectUpgradeConfirmation_C_RefreshLevelInfo");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshLevelInfo, Temp_bool_Variable) == 0x000000, "Member 'ItemInspectUpgradeConfirmation_C_RefreshLevelInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectUpgradeConfirmation_C_RefreshLevelInfo, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'ItemInspectUpgradeConfirmation_C_RefreshLevelInfo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
