#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectAlterationModScreen

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectAlterationModScreen.ItemInspectAlterationModScreen_C
// 0x00F0 (0x0498 - 0x03A8)
class UItemInspectAlterationModScreen_C final : public UFortAlterationModScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAlterationOptionsIngredientsList_C*    AlterationOptionsIngredientsList;                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderCostConfirmation;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonHBox;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConfirmButton;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DetailsButton;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameConnector;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderGrid;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TriangleMaterial;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RarityBorderMID;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    RarityData;                                        // 0x0408(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Triangles_Material;                                // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemWindow_C*                          ItemInfoWindow;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemInspectAlterationModScreen(int32 EntryPoint);
	void OnAlterationOptionChanged(class UFortAlterationOption* CurrentAlterationOption);
	void OnItemSlotChanged(bool SelectedSlot);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__DetailsButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void RefreshItemAndAlterationsBP();
	void OnAlterationModificationCompleted();
	void DialogResult_AB7FE45A4C61900417D8EAB93574F424(EFortDialogResult Result, class FName ResultName);
	void SetupHeaderColors();
	void SetupTriangles();
	void UpdateColors();
	void UpdatePurchaseButtons(bool Enabled);
	void UpdatePurchaseDetails(bool SelectedSlot);
	void UpdateShowPurchaseOptions();
	void UpdatePurchaseIngredients(TArray<struct FFortItemQuantityPair>& Ingredients);
	bool HasOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectAlterationModScreen_C">();
	}
	static class UItemInspectAlterationModScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectAlterationModScreen_C>();
	}
};
static_assert(alignof(UItemInspectAlterationModScreen_C) == 0x000008, "Wrong alignment on UItemInspectAlterationModScreen_C");
static_assert(sizeof(UItemInspectAlterationModScreen_C) == 0x000498, "Wrong size on UItemInspectAlterationModScreen_C");
static_assert(offsetof(UItemInspectAlterationModScreen_C, UberGraphFrame) == 0x0003A8, "Member 'UItemInspectAlterationModScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, AlterationOptionsIngredientsList) == 0x0003B0, "Member 'UItemInspectAlterationModScreen_C::AlterationOptionsIngredientsList' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, BorderCostConfirmation) == 0x0003B8, "Member 'UItemInspectAlterationModScreen_C::BorderCostConfirmation' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, ButtonHBox) == 0x0003C0, "Member 'UItemInspectAlterationModScreen_C::ButtonHBox' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, CancelButton) == 0x0003C8, "Member 'UItemInspectAlterationModScreen_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, ConfirmButton) == 0x0003D0, "Member 'UItemInspectAlterationModScreen_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, DetailsButton) == 0x0003D8, "Member 'UItemInspectAlterationModScreen_C::DetailsButton' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, FrameConnector) == 0x0003E0, "Member 'UItemInspectAlterationModScreen_C::FrameConnector' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, HeaderGrid) == 0x0003E8, "Member 'UItemInspectAlterationModScreen_C::HeaderGrid' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, SafeZone_0) == 0x0003F0, "Member 'UItemInspectAlterationModScreen_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, TriangleMaterial) == 0x0003F8, "Member 'UItemInspectAlterationModScreen_C::TriangleMaterial' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, RarityBorderMID) == 0x000400, "Member 'UItemInspectAlterationModScreen_C::RarityBorderMID' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, RarityData) == 0x000408, "Member 'UItemInspectAlterationModScreen_C::RarityData' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, Triangles_Material) == 0x000488, "Member 'UItemInspectAlterationModScreen_C::Triangles_Material' has a wrong offset!");
static_assert(offsetof(UItemInspectAlterationModScreen_C, ItemInfoWindow) == 0x000490, "Member 'UItemInspectAlterationModScreen_C::ItemInfoWindow' has a wrong offset!");

}

