#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemEntry.ItemEntry_C.Entry Selected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemEntry_C_Entry_Selected__DelegateSignature final
{
public:
	class UFortItemDefinition*                    Items_Definition;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemEntry_C_Entry_Selected__DelegateSignature) == 0x000008, "Wrong alignment on ItemEntry_C_Entry_Selected__DelegateSignature");
static_assert(sizeof(ItemEntry_C_Entry_Selected__DelegateSignature) == 0x000008, "Wrong size on ItemEntry_C_Entry_Selected__DelegateSignature");
static_assert(offsetof(ItemEntry_C_Entry_Selected__DelegateSignature, Items_Definition) == 0x000000, "Member 'ItemEntry_C_Entry_Selected__DelegateSignature::Items_Definition' has a wrong offset!");

// Function ItemEntry.ItemEntry_C.ExecuteUbergraph_ItemEntry
// 0x0010 (0x0010 - 0x0000)
struct ItemEntry_C_ExecuteUbergraph_ItemEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemEntry_C_ExecuteUbergraph_ItemEntry) == 0x000008, "Wrong alignment on ItemEntry_C_ExecuteUbergraph_ItemEntry");
static_assert(sizeof(ItemEntry_C_ExecuteUbergraph_ItemEntry) == 0x000010, "Wrong size on ItemEntry_C_ExecuteUbergraph_ItemEntry");
static_assert(offsetof(ItemEntry_C_ExecuteUbergraph_ItemEntry, EntryPoint) == 0x000000, "Member 'ItemEntry_C_ExecuteUbergraph_ItemEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemEntry_C_ExecuteUbergraph_ItemEntry, K2Node_Event_bIsExpanded) == 0x000004, "Member 'ItemEntry_C_ExecuteUbergraph_ItemEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(ItemEntry_C_ExecuteUbergraph_ItemEntry, K2Node_Event_bIsSelected) == 0x000005, "Member 'ItemEntry_C_ExecuteUbergraph_ItemEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ItemEntry_C_ExecuteUbergraph_ItemEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'ItemEntry_C_ExecuteUbergraph_ItemEntry::K2Node_Event_ListItemObject' has a wrong offset!");

// Function ItemEntry.ItemEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct ItemEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on ItemEntry_C_OnListItemObjectSet");
static_assert(sizeof(ItemEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on ItemEntry_C_OnListItemObjectSet");
static_assert(offsetof(ItemEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'ItemEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function ItemEntry.ItemEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on ItemEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(ItemEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on ItemEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(ItemEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'ItemEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function ItemEntry.ItemEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on ItemEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(ItemEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on ItemEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(ItemEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'ItemEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function ItemEntry.ItemEntry_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct ItemEntry_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemEntry_C_GetListItemObject) == 0x000008, "Wrong alignment on ItemEntry_C_GetListItemObject");
static_assert(sizeof(ItemEntry_C_GetListItemObject) == 0x000008, "Wrong size on ItemEntry_C_GetListItemObject");
static_assert(offsetof(ItemEntry_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'ItemEntry_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

