#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectUpgradePopupMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectUpgradePopupMenu.ItemInspectUpgradePopupMenu_C
// 0x0038 (0x0378 - 0x0340)
class UItemInspectUpgradePopupMenu_C final : public UFortPopupMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ButonLevelUp;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonPerks;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonRarity;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonViewEvolution;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainButtonVerticalBox;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemInspectUpgradePopupMenu(int32 EntryPoint);
	void BndEvt__ButtonRarity_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void OnDeactivated();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonPerks_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetLevelUpVisibility(ESlateVisibility Param_Visibility);
	void SetupPerkModVisibility(ESlateVisibility Param_Visibility);
	void SetupEvolultionVisibility(ESlateVisibility Param_Visibility);
	void SetupUpgradeRarityVisiblity(ESlateVisibility Param_Visibility);
	void InitalizeButtonNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectUpgradePopupMenu_C">();
	}
	static class UItemInspectUpgradePopupMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectUpgradePopupMenu_C>();
	}
};
static_assert(alignof(UItemInspectUpgradePopupMenu_C) == 0x000008, "Wrong alignment on UItemInspectUpgradePopupMenu_C");
static_assert(sizeof(UItemInspectUpgradePopupMenu_C) == 0x000378, "Wrong size on UItemInspectUpgradePopupMenu_C");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, UberGraphFrame) == 0x000340, "Member 'UItemInspectUpgradePopupMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, ButonLevelUp) == 0x000348, "Member 'UItemInspectUpgradePopupMenu_C::ButonLevelUp' has a wrong offset!");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, ButtonPerks) == 0x000350, "Member 'UItemInspectUpgradePopupMenu_C::ButtonPerks' has a wrong offset!");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, ButtonRarity) == 0x000358, "Member 'UItemInspectUpgradePopupMenu_C::ButtonRarity' has a wrong offset!");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, ButtonViewEvolution) == 0x000360, "Member 'UItemInspectUpgradePopupMenu_C::ButtonViewEvolution' has a wrong offset!");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, CancelButton) == 0x000368, "Member 'UItemInspectUpgradePopupMenu_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UItemInspectUpgradePopupMenu_C, MainButtonVerticalBox) == 0x000370, "Member 'UItemInspectUpgradePopupMenu_C::MainButtonVerticalBox' has a wrong offset!");

}

