#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedPCBGeneric

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedPCBGeneric.ItemReceivedPCBGeneric_C
// 0x0060 (0x02C8 - 0x0268)
class UItemReceivedPCBGeneric_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedPCBGeneric_C;           // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BattlepassUpgraded;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoltL;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoltR;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CrownGlow;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HandGlow;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGlow;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PCBIcon;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubHeader;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemReceivedPCBGeneric(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedPCBGeneric_C">();
	}
	static class UItemReceivedPCBGeneric_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedPCBGeneric_C>();
	}
};
static_assert(alignof(UItemReceivedPCBGeneric_C) == 0x000008, "Wrong alignment on UItemReceivedPCBGeneric_C");
static_assert(sizeof(UItemReceivedPCBGeneric_C) == 0x0002C8, "Wrong size on UItemReceivedPCBGeneric_C");
static_assert(offsetof(UItemReceivedPCBGeneric_C, UberGraphFrame_ItemReceivedPCBGeneric_C) == 0x000268, "Member 'UItemReceivedPCBGeneric_C::UberGraphFrame_ItemReceivedPCBGeneric_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, BattlepassUpgraded) == 0x000270, "Member 'UItemReceivedPCBGeneric_C::BattlepassUpgraded' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, BoltL) == 0x000278, "Member 'UItemReceivedPCBGeneric_C::BoltL' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, BoltR) == 0x000280, "Member 'UItemReceivedPCBGeneric_C::BoltR' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, CrownGlow) == 0x000288, "Member 'UItemReceivedPCBGeneric_C::CrownGlow' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, HandGlow) == 0x000290, "Member 'UItemReceivedPCBGeneric_C::HandGlow' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, IconGlow) == 0x000298, "Member 'UItemReceivedPCBGeneric_C::IconGlow' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, Image_9) == 0x0002A0, "Member 'UItemReceivedPCBGeneric_C::Image_9' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, Image_10) == 0x0002A8, "Member 'UItemReceivedPCBGeneric_C::Image_10' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, PCBIcon) == 0x0002B0, "Member 'UItemReceivedPCBGeneric_C::PCBIcon' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, SubHeader) == 0x0002B8, "Member 'UItemReceivedPCBGeneric_C::SubHeader' has a wrong offset!");
static_assert(offsetof(UItemReceivedPCBGeneric_C, Is_BattlePass) == 0x0002C0, "Member 'UItemReceivedPCBGeneric_C::Is_BattlePass' has a wrong offset!");

}

