#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedTwitchHeader

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemReceivedTwitchHeader.ItemReceivedTwitchHeader_C.ExecuteUbergraph_ItemReceivedTwitchHeader
// 0x0040 (0x0040 - 0x0000)
struct ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	bool                                          CallFunc_HasParam_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTextUsingParams_ReturnValue;        // 0x0028(0x0018)()
};
static_assert(alignof(ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader) == 0x000008, "Wrong alignment on ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader");
static_assert(sizeof(ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader) == 0x000040, "Wrong size on ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader");
static_assert(offsetof(ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader, EntryPoint) == 0x000000, "Member 'ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader, CallFunc_HasParam_ReturnValue) == 0x000020, "Member 'ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader::CallFunc_HasParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader, CallFunc_FormatTextUsingParams_ReturnValue) == 0x000028, "Member 'ItemReceivedTwitchHeader_C_ExecuteUbergraph_ItemReceivedTwitchHeader::CallFunc_FormatTextUsingParams_ReturnValue' has a wrong offset!");

}

