#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectRefundPopupMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemInspectRefundPopupMenu.ItemInspectRefundPopupMenu_C.ExecuteUbergraph_ItemInspectRefundPopupMenu
// 0x0050 (0x0050 - 0x0000)
struct ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectScreen_C*                   K2Node_DynamicCast_AsItem_Inspect_Screen;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInspectScreen_C*                   K2Node_DynamicCast_AsItem_Inspect_Screen1;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInspectScreen_C*                   K2Node_DynamicCast_AsItem_Inspect_Screen2;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu) == 0x000008, "Wrong alignment on ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu");
static_assert(sizeof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu) == 0x000050, "Wrong size on ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, EntryPoint) == 0x000000, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_ComponentBoundEvent_Button2) == 0x000008, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_ComponentBoundEvent_Button1) == 0x000010, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_DynamicCast_AsItem_Inspect_Screen) == 0x000020, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_DynamicCast_AsItem_Inspect_Screen' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_DynamicCast_AsItem_Inspect_Screen1) == 0x000030, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_DynamicCast_AsItem_Inspect_Screen1' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_DynamicCast_AsItem_Inspect_Screen2) == 0x000040, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_DynamicCast_AsItem_Inspect_Screen2' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'ItemInspectRefundPopupMenu_C_ExecuteUbergraph_ItemInspectRefundPopupMenu::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function ItemInspectRefundPopupMenu.ItemInspectRefundPopupMenu_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemInspectRefundPopupMenu_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemInspectRefundPopupMenu.ItemInspectRefundPopupMenu_C.BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemInspectRefundPopupMenu_C_BndEvt__ButtonViewEvolution_K2Node_ComponentBoundEvent_48_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemInspectRefundPopupMenu.ItemInspectRefundPopupMenu_C.BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemInspectRefundPopupMenu_C_BndEvt__ButonLevelUp_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemInspectRefundPopupMenu.ItemInspectRefundPopupMenu_C.InitalizeButtonNavigation
// 0x0040 (0x0040 - 0x0000)
struct ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue1;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation) == 0x000008, "Wrong alignment on ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation");
static_assert(sizeof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation) == 0x000040, "Wrong size on ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, ButtonIndex) == 0x000000, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::ButtonIndex' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, Temp_bool_Variable) == 0x000004, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, Temp_int_Variable) == 0x000014, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_GetChildAt_ReturnValue1) == 0x000020, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_GetChildAt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_GetChildrenCount_ReturnValue) == 0x000028, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_IsVisible_ReturnValue) == 0x00002C, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_BooleanAND_ReturnValue1) == 0x000037, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation, CallFunc_GetUINavigationManager_ReturnValue) == 0x000038, "Member 'ItemInspectRefundPopupMenu_C_InitalizeButtonNavigation::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

