#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedChallengeCompleteHeader

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedChallengeCompleteHeader.ItemReceivedChallengeCompleteHeader_C
// 0x0050 (0x02B8 - 0x0268)
class UItemReceivedChallengeCompleteHeader_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedChallengeCompleteHeader_C; // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BattlepassTier;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattlepassUpgraded;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_Icon;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_Title;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBattlePassIconGold;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBattlePassIconSilver;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemReceivedAccountWidget_C*           ItemReceivedAccountWidget;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemReceivedChallengeCompleteHeader(int32 EntryPoint);
	void InitFromGiftBoxItem_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedChallengeCompleteHeader_C">();
	}
	static class UItemReceivedChallengeCompleteHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedChallengeCompleteHeader_C>();
	}
};
static_assert(alignof(UItemReceivedChallengeCompleteHeader_C) == 0x000008, "Wrong alignment on UItemReceivedChallengeCompleteHeader_C");
static_assert(sizeof(UItemReceivedChallengeCompleteHeader_C) == 0x0002B8, "Wrong size on UItemReceivedChallengeCompleteHeader_C");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, UberGraphFrame_ItemReceivedChallengeCompleteHeader_C) == 0x000268, "Member 'UItemReceivedChallengeCompleteHeader_C::UberGraphFrame_ItemReceivedChallengeCompleteHeader_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, BattlepassTier) == 0x000270, "Member 'UItemReceivedChallengeCompleteHeader_C::BattlepassTier' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, BattlepassUpgraded) == 0x000278, "Member 'UItemReceivedChallengeCompleteHeader_C::BattlepassUpgraded' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, CommonTextBlock_2) == 0x000280, "Member 'UItemReceivedChallengeCompleteHeader_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, CommonWidgetSwitcher_Icon) == 0x000288, "Member 'UItemReceivedChallengeCompleteHeader_C::CommonWidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, CommonWidgetSwitcher_Title) == 0x000290, "Member 'UItemReceivedChallengeCompleteHeader_C::CommonWidgetSwitcher_Title' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, ImageBattlePassIconGold) == 0x000298, "Member 'UItemReceivedChallengeCompleteHeader_C::ImageBattlePassIconGold' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, ImageBattlePassIconSilver) == 0x0002A0, "Member 'UItemReceivedChallengeCompleteHeader_C::ImageBattlePassIconSilver' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, ItemReceivedAccountWidget) == 0x0002A8, "Member 'UItemReceivedChallengeCompleteHeader_C::ItemReceivedAccountWidget' has a wrong offset!");
static_assert(offsetof(UItemReceivedChallengeCompleteHeader_C, Is_BattlePass) == 0x0002B0, "Member 'UItemReceivedChallengeCompleteHeader_C::Is_BattlePass' has a wrong offset!");

}

