#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedFriendGiftHeader

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedFriendGiftHeader.ItemReceivedFriendGiftHeader_C
// 0x0028 (0x0290 - 0x0268)
class UItemReceivedFriendGiftHeader_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedFriendGiftHeader_C;     // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_UserMessage;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Sender;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemReceivedFriendGiftHeader(int32 EntryPoint);
	void OnInitialized();
	void CustomEvent_0(bool bSuccess, const class FString& SanitizedMsg);
	void InitFromGiftBoxItem_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedFriendGiftHeader_C">();
	}
	static class UItemReceivedFriendGiftHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedFriendGiftHeader_C>();
	}
};
static_assert(alignof(UItemReceivedFriendGiftHeader_C) == 0x000008, "Wrong alignment on UItemReceivedFriendGiftHeader_C");
static_assert(sizeof(UItemReceivedFriendGiftHeader_C) == 0x000290, "Wrong size on UItemReceivedFriendGiftHeader_C");
static_assert(offsetof(UItemReceivedFriendGiftHeader_C, UberGraphFrame_ItemReceivedFriendGiftHeader_C) == 0x000268, "Member 'UItemReceivedFriendGiftHeader_C::UberGraphFrame_ItemReceivedFriendGiftHeader_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedFriendGiftHeader_C, CommonTextBlock_1) == 0x000270, "Member 'UItemReceivedFriendGiftHeader_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UItemReceivedFriendGiftHeader_C, CommonTextBlock_UserMessage) == 0x000278, "Member 'UItemReceivedFriendGiftHeader_C::CommonTextBlock_UserMessage' has a wrong offset!");
static_assert(offsetof(UItemReceivedFriendGiftHeader_C, Sender) == 0x000280, "Member 'UItemReceivedFriendGiftHeader_C::Sender' has a wrong offset!");
static_assert(offsetof(UItemReceivedFriendGiftHeader_C, TextName) == 0x000288, "Member 'UItemReceivedFriendGiftHeader_C::TextName' has a wrong offset!");

}

