#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedVariationReceived

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedVariationReceived.ItemReceivedVariationReceived_C
// 0x0038 (0x02A0 - 0x0268)
class UItemReceivedVariationReceived_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedVariationReceived_C;    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonText_SkinName;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_YouRecieved;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_Icon;                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBattlePassIconGold;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBattlePassIconSilver;                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemReceivedVariationReceived(int32 EntryPoint);
	void InitFromGiftBoxItem_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedVariationReceived_C">();
	}
	static class UItemReceivedVariationReceived_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedVariationReceived_C>();
	}
};
static_assert(alignof(UItemReceivedVariationReceived_C) == 0x000008, "Wrong alignment on UItemReceivedVariationReceived_C");
static_assert(sizeof(UItemReceivedVariationReceived_C) == 0x0002A0, "Wrong size on UItemReceivedVariationReceived_C");
static_assert(offsetof(UItemReceivedVariationReceived_C, UberGraphFrame_ItemReceivedVariationReceived_C) == 0x000268, "Member 'UItemReceivedVariationReceived_C::UberGraphFrame_ItemReceivedVariationReceived_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedVariationReceived_C, CommonText_SkinName) == 0x000270, "Member 'UItemReceivedVariationReceived_C::CommonText_SkinName' has a wrong offset!");
static_assert(offsetof(UItemReceivedVariationReceived_C, CommonTextBlock_YouRecieved) == 0x000278, "Member 'UItemReceivedVariationReceived_C::CommonTextBlock_YouRecieved' has a wrong offset!");
static_assert(offsetof(UItemReceivedVariationReceived_C, CommonWidgetSwitcher_Icon) == 0x000280, "Member 'UItemReceivedVariationReceived_C::CommonWidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UItemReceivedVariationReceived_C, ImageBattlePassIconGold) == 0x000288, "Member 'UItemReceivedVariationReceived_C::ImageBattlePassIconGold' has a wrong offset!");
static_assert(offsetof(UItemReceivedVariationReceived_C, ImageBattlePassIconSilver) == 0x000290, "Member 'UItemReceivedVariationReceived_C::ImageBattlePassIconSilver' has a wrong offset!");
static_assert(offsetof(UItemReceivedVariationReceived_C, Is_BattlePass) == 0x000298, "Member 'UItemReceivedVariationReceived_C::Is_BattlePass' has a wrong offset!");

}

