#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedDeepFreezeBundleHeader

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedDeepFreezeBundleHeader.ItemReceivedDeepFreezeBundleHeader_C
// 0x0060 (0x02C8 - 0x0268)
class UItemReceivedDeepFreezeBundleHeader_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedDeepFreezeBundleHeader_C; // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 OneIcon;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattlepassUpgraded;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CandleLightButton;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CandleLightSwitcher;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfettiLeft;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfettiRight;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LitCandle;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UnlitCandle;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemReceivedDeepFreezeBundleHeader(int32 EntryPoint);
	void BndEvt__CandleLightButton_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedDeepFreezeBundleHeader_C">();
	}
	static class UItemReceivedDeepFreezeBundleHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedDeepFreezeBundleHeader_C>();
	}
};
static_assert(alignof(UItemReceivedDeepFreezeBundleHeader_C) == 0x000008, "Wrong alignment on UItemReceivedDeepFreezeBundleHeader_C");
static_assert(sizeof(UItemReceivedDeepFreezeBundleHeader_C) == 0x0002C8, "Wrong size on UItemReceivedDeepFreezeBundleHeader_C");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, UberGraphFrame_ItemReceivedDeepFreezeBundleHeader_C) == 0x000268, "Member 'UItemReceivedDeepFreezeBundleHeader_C::UberGraphFrame_ItemReceivedDeepFreezeBundleHeader_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, OneIcon) == 0x000270, "Member 'UItemReceivedDeepFreezeBundleHeader_C::OneIcon' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, BattlepassUpgraded) == 0x000278, "Member 'UItemReceivedDeepFreezeBundleHeader_C::BattlepassUpgraded' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, CandleLightButton) == 0x000280, "Member 'UItemReceivedDeepFreezeBundleHeader_C::CandleLightButton' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, CandleLightSwitcher) == 0x000288, "Member 'UItemReceivedDeepFreezeBundleHeader_C::CandleLightSwitcher' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, CommonTextBlock_0) == 0x000290, "Member 'UItemReceivedDeepFreezeBundleHeader_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, ConfettiLeft) == 0x000298, "Member 'UItemReceivedDeepFreezeBundleHeader_C::ConfettiLeft' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, ConfettiRight) == 0x0002A0, "Member 'UItemReceivedDeepFreezeBundleHeader_C::ConfettiRight' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, Image_5) == 0x0002A8, "Member 'UItemReceivedDeepFreezeBundleHeader_C::Image_5' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, LitCandle) == 0x0002B0, "Member 'UItemReceivedDeepFreezeBundleHeader_C::LitCandle' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, UnlitCandle) == 0x0002B8, "Member 'UItemReceivedDeepFreezeBundleHeader_C::UnlitCandle' has a wrong offset!");
static_assert(offsetof(UItemReceivedDeepFreezeBundleHeader_C, Is_BattlePass) == 0x0002C0, "Member 'UItemReceivedDeepFreezeBundleHeader_C::Is_BattlePass' has a wrong offset!");

}

