#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedFortnitemaresChallenges

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedFortnitemaresChallenges.ItemReceivedFortnitemaresChallenges_C
// 0x0028 (0x0290 - 0x0268)
class UItemReceivedFortnitemaresChallenges_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedFortnitemaresChallenges_C; // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BattlepassUpgraded;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubHeader;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemReceivedFortnitemaresChallenges(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedFortnitemaresChallenges_C">();
	}
	static class UItemReceivedFortnitemaresChallenges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedFortnitemaresChallenges_C>();
	}
};
static_assert(alignof(UItemReceivedFortnitemaresChallenges_C) == 0x000008, "Wrong alignment on UItemReceivedFortnitemaresChallenges_C");
static_assert(sizeof(UItemReceivedFortnitemaresChallenges_C) == 0x000290, "Wrong size on UItemReceivedFortnitemaresChallenges_C");
static_assert(offsetof(UItemReceivedFortnitemaresChallenges_C, UberGraphFrame_ItemReceivedFortnitemaresChallenges_C) == 0x000268, "Member 'UItemReceivedFortnitemaresChallenges_C::UberGraphFrame_ItemReceivedFortnitemaresChallenges_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedFortnitemaresChallenges_C, BattlepassUpgraded) == 0x000270, "Member 'UItemReceivedFortnitemaresChallenges_C::BattlepassUpgraded' has a wrong offset!");
static_assert(offsetof(UItemReceivedFortnitemaresChallenges_C, Glow) == 0x000278, "Member 'UItemReceivedFortnitemaresChallenges_C::Glow' has a wrong offset!");
static_assert(offsetof(UItemReceivedFortnitemaresChallenges_C, SubHeader) == 0x000280, "Member 'UItemReceivedFortnitemaresChallenges_C::SubHeader' has a wrong offset!");
static_assert(offsetof(UItemReceivedFortnitemaresChallenges_C, Is_BattlePass) == 0x000288, "Member 'UItemReceivedFortnitemaresChallenges_C::Is_BattlePass' has a wrong offset!");

}

