#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedSkullTrooperStyleChallenge

#include "Basic.hpp"

#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedSkullTrooperStyleChallenge.ItemReceivedSkullTrooperStyleChallenge_C
// 0x0030 (0x0298 - 0x0268)
class UItemReceivedSkullTrooperStyleChallenge_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedSkullTrooperStyleChallenge_C; // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BattlepassUpgraded;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubHeader;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemReceivedSkullTrooperStyleChallenge(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedSkullTrooperStyleChallenge_C">();
	}
	static class UItemReceivedSkullTrooperStyleChallenge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedSkullTrooperStyleChallenge_C>();
	}
};
static_assert(alignof(UItemReceivedSkullTrooperStyleChallenge_C) == 0x000008, "Wrong alignment on UItemReceivedSkullTrooperStyleChallenge_C");
static_assert(sizeof(UItemReceivedSkullTrooperStyleChallenge_C) == 0x000298, "Wrong size on UItemReceivedSkullTrooperStyleChallenge_C");
static_assert(offsetof(UItemReceivedSkullTrooperStyleChallenge_C, UberGraphFrame_ItemReceivedSkullTrooperStyleChallenge_C) == 0x000268, "Member 'UItemReceivedSkullTrooperStyleChallenge_C::UberGraphFrame_ItemReceivedSkullTrooperStyleChallenge_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedSkullTrooperStyleChallenge_C, BattlepassUpgraded) == 0x000270, "Member 'UItemReceivedSkullTrooperStyleChallenge_C::BattlepassUpgraded' has a wrong offset!");
static_assert(offsetof(UItemReceivedSkullTrooperStyleChallenge_C, CommonTextBlock_0) == 0x000278, "Member 'UItemReceivedSkullTrooperStyleChallenge_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UItemReceivedSkullTrooperStyleChallenge_C, Effect) == 0x000280, "Member 'UItemReceivedSkullTrooperStyleChallenge_C::Effect' has a wrong offset!");
static_assert(offsetof(UItemReceivedSkullTrooperStyleChallenge_C, SubHeader) == 0x000288, "Member 'UItemReceivedSkullTrooperStyleChallenge_C::SubHeader' has a wrong offset!");
static_assert(offsetof(UItemReceivedSkullTrooperStyleChallenge_C, Is_BattlePass) == 0x000290, "Member 'UItemReceivedSkullTrooperStyleChallenge_C::Is_BattlePass' has a wrong offset!");

}

