#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemWindow.ItemWindow_C
// 0x00A0 (0x03E8 - 0x0348)
class UItemWindow_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      CloseButton;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemIcon*                          EntryIcon;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EntryText;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 FortItemCard_M_0;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 FortItemCard_XXSSchematicItemCard;                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemButtonBox;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemButtonScrollBox;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxDetails;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherRewardType;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonButtonGroup*                     Item_Buttons;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Common_Button_Group_Type;                          // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItemDefinition*>            Item_Definitions;                                  // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FMargin                                ItemEntryPadding;                                  // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ItemWindow(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetTitleAndItems(TArray<class UFortItemDefinition*>& Info_Items, const class FText& Param_Title);
	void Initialize();
	void HandleButton(class UWidget* Content, int32 Param_Index);
	void InternalToExternalRarity(EFortRarity InRarity, class FText* ExternalRarity);
	void Set_Description_Text(class UFortItemDefinition* Item_Definition, class UCommonTextBlock* Text_Box_to_Set);
	void HandleSelectedButtonChanged(class UCommonButton* SelectedButton, int32 SelectedButtonIndex);
	void GetPeopleName(class UFortItem* InfoItemInstance, class FText* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemWindow_C">();
	}
	static class UItemWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemWindow_C>();
	}
};
static_assert(alignof(UItemWindow_C) == 0x000008, "Wrong alignment on UItemWindow_C");
static_assert(sizeof(UItemWindow_C) == 0x0003E8, "Wrong size on UItemWindow_C");
static_assert(offsetof(UItemWindow_C, UberGraphFrame) == 0x000348, "Member 'UItemWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, CloseButton) == 0x000350, "Member 'UItemWindow_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, EntryIcon) == 0x000358, "Member 'UItemWindow_C::EntryIcon' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, EntryText) == 0x000360, "Member 'UItemWindow_C::EntryText' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, FortItemCard_M_0) == 0x000368, "Member 'UItemWindow_C::FortItemCard_M_0' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, FortItemCard_XXSSchematicItemCard) == 0x000370, "Member 'UItemWindow_C::FortItemCard_XXSSchematicItemCard' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, ItemButtonBox) == 0x000378, "Member 'UItemWindow_C::ItemButtonBox' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, ItemButtonScrollBox) == 0x000380, "Member 'UItemWindow_C::ItemButtonScrollBox' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, Lightbox) == 0x000388, "Member 'UItemWindow_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, SizeBox_1) == 0x000390, "Member 'UItemWindow_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, SizeBoxDetails) == 0x000398, "Member 'UItemWindow_C::SizeBoxDetails' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, Switcher) == 0x0003A0, "Member 'UItemWindow_C::Switcher' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, SwitcherRewardType) == 0x0003A8, "Member 'UItemWindow_C::SwitcherRewardType' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, Title) == 0x0003B0, "Member 'UItemWindow_C::Title' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, Item_Buttons) == 0x0003B8, "Member 'UItemWindow_C::Item_Buttons' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, Common_Button_Group_Type) == 0x0003C0, "Member 'UItemWindow_C::Common_Button_Group_Type' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, Item_Definitions) == 0x0003C8, "Member 'UItemWindow_C::Item_Definitions' has a wrong offset!");
static_assert(offsetof(UItemWindow_C, ItemEntryPadding) == 0x0003D8, "Member 'UItemWindow_C::ItemEntryPadding' has a wrong offset!");

}

