#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectRefundConfirmationModalWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectRefundConfirmationModalWidget.ItemInspectRefundConfirmationModalWidget_C
// 0x0080 (0x03C8 - 0x0348)
class UItemInspectRefundConfirmationModalWidget_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ArrowImage;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConfirmButton;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 CurrentItemCard;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentItemLevelText;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DeclineButton;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox_NUI;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectRefundDetailsPanel_C*       RefundDetailsPanel;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 RefundedItemCard;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RefundedItemLevelText;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RefundSubHeaderText;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleWidget;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectScreen_C*                   HostScreen;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       ItemToRefund;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       RefundResultItem;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemInspectRefundConfirmationModalWidget(int32 EntryPoint);
	void OnDeactivated();
	void BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetHostScreen(class UItemInspectScreen_C* InHostScreen);
	void SetItemToRefund(class UFortAccountItem* InItemToRefund, class UFortAccountItem* InRefundResultItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectRefundConfirmationModalWidget_C">();
	}
	static class UItemInspectRefundConfirmationModalWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectRefundConfirmationModalWidget_C>();
	}
};
static_assert(alignof(UItemInspectRefundConfirmationModalWidget_C) == 0x000008, "Wrong alignment on UItemInspectRefundConfirmationModalWidget_C");
static_assert(sizeof(UItemInspectRefundConfirmationModalWidget_C) == 0x0003C8, "Wrong size on UItemInspectRefundConfirmationModalWidget_C");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, UberGraphFrame) == 0x000348, "Member 'UItemInspectRefundConfirmationModalWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, ArrowImage) == 0x000350, "Member 'UItemInspectRefundConfirmationModalWidget_C::ArrowImage' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, ConfirmButton) == 0x000358, "Member 'UItemInspectRefundConfirmationModalWidget_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, CurrentItemCard) == 0x000360, "Member 'UItemInspectRefundConfirmationModalWidget_C::CurrentItemCard' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, CurrentItemLevelText) == 0x000368, "Member 'UItemInspectRefundConfirmationModalWidget_C::CurrentItemLevelText' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, DeclineButton) == 0x000370, "Member 'UItemInspectRefundConfirmationModalWidget_C::DeclineButton' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, Lightbox_NUI) == 0x000378, "Member 'UItemInspectRefundConfirmationModalWidget_C::Lightbox_NUI' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, RefundDetailsPanel) == 0x000380, "Member 'UItemInspectRefundConfirmationModalWidget_C::RefundDetailsPanel' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, RefundedItemCard) == 0x000388, "Member 'UItemInspectRefundConfirmationModalWidget_C::RefundedItemCard' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, RefundedItemLevelText) == 0x000390, "Member 'UItemInspectRefundConfirmationModalWidget_C::RefundedItemLevelText' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, RefundSubHeaderText) == 0x000398, "Member 'UItemInspectRefundConfirmationModalWidget_C::RefundSubHeaderText' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, RootOverlay) == 0x0003A0, "Member 'UItemInspectRefundConfirmationModalWidget_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, TitleWidget) == 0x0003A8, "Member 'UItemInspectRefundConfirmationModalWidget_C::TitleWidget' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, HostScreen) == 0x0003B0, "Member 'UItemInspectRefundConfirmationModalWidget_C::HostScreen' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, ItemToRefund) == 0x0003B8, "Member 'UItemInspectRefundConfirmationModalWidget_C::ItemToRefund' has a wrong offset!");
static_assert(offsetof(UItemInspectRefundConfirmationModalWidget_C, RefundResultItem) == 0x0003C0, "Member 'UItemInspectRefundConfirmationModalWidget_C::RefundResultItem' has a wrong offset!");

}

