#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JackalVehicle_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function JackalVehicle_Athena.JackalVehicle_Athena_C.ExecuteUbergraph_JackalVehicle_Athena
// 0x0620 (0x0620 - 0x0000)
struct JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Charge1;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Charge;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0024(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormalImpulse;                     // 0x0030(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitFrictionImpulse;                   // 0x003C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0048(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_Event_HitSurfaceType;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateSurfaceType_Output;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCollision_OutResult;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_OnCollision_OutMagnitude;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_WaterSurfacePoint1;                   // 0x0088(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_WaterSurfacePoint;                    // 0x0094(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue3;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue4;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ExitSocketName;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_Event_PlayerPawn1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SeatIdx;                              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x010C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue5;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSprinting_ReturnValue;                  // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ApplyMaterialAndUseWrapIfPossible_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAthenaItemWrapDefinition*        K2Node_Event_LoadedWrap;                           // 0x0178(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable1;                             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x01AC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBump_Bump;                          // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDestroyProp__ReturnValue;           // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue6;           // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x02C4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x02F0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x031C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x03B8(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x03E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue7;           // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_ExitingPawn1;                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ExitDuration;                         // 0x0458(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0468(0x00A8)()
	class AFortPawn*                              K2Node_Event_ExitingPawn;                          // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue8;           // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0534(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x055C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue3;        // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A[0x6];                                      // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x0588(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShake*                           CallFunc_PlayCameraShake_ReturnValue1;             // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue9;           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x059C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAudibleDistance_Max_Distance;       // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue1;         // 0x05B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x05C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x05D8(0x0020)()
	bool                                          K2Node_CustomEvent_Hide;                           // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FB[0x5];                                      // 0x05FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue1;               // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerGameplay*          K2Node_DynamicCast_AsFort_Player_Controller_Gameplay; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena) == 0x000010, "Wrong alignment on JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena");
static_assert(sizeof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena) == 0x000620, "Wrong size on JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, EntryPoint) == 0x000000, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_AsPlayer_Controller) == 0x000010, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000019, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue2) == 0x00001B, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Charge1) == 0x00001C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Charge1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Charge) == 0x000020, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Charge' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitLocation) == 0x000024, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitNormalImpulse) == 0x000030, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitNormalImpulse' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitFrictionImpulse) == 0x00003C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitFrictionImpulse' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitNormal) == 0x000048, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitActor) == 0x000058, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitActor' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitSurfaceType) == 0x000060, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitSurfaceType' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_UpdateSurfaceType_Output) == 0x000064, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_UpdateSurfaceType_Output' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_OnCollision_OutResult) == 0x000068, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_OnCollision_OutResult' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_OnCollision_OutMagnitude) == 0x00006C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_OnCollision_OutMagnitude' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_AsFort_Pawn) == 0x000070, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000079, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00007A, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00007C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_WaterSurfacePoint1) == 0x000088, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_WaterSurfacePoint1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_WaterSurfacePoint) == 0x000094, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_WaterSurfacePoint' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakVector_X) == 0x0000A0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000AC, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue1) == 0x0000B0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue3) == 0x0000B1, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetRenderingDetailMode_ReturnValue) == 0x0000B4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetRenderingDetailMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue4) == 0x0000B9, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0000C0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue1) == 0x0000E0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_PlayerPawn) == 0x0000E8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_PlayerPawn' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_ExitSocketName) == 0x0000F0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_ExitSocketName' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_PlayerPawn1) == 0x000100, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_PlayerPawn1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_SeatIdx) == 0x000108, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_SeatIdx' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x00010C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsLocallyControlled_ReturnValue) == 0x000114, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue2) == 0x000115, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue3) == 0x000116, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_PlayCameraShake_ReturnValue) == 0x000118, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue5) == 0x000120, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue4) == 0x000121, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsSprinting_ReturnValue) == 0x000122, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsSprinting_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue5) == 0x000123, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, Temp_object_Variable) == 0x000128, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsValid_ReturnValue6) == 0x000130, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetActorUpVector_ReturnValue) == 0x000134, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Dot_VectorVector_ReturnValue) == 0x000140, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000144, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_GetActorForwardVector_ReturnValue) == 0x000148, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000154, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000160, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x000168, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ApplyMaterialAndUseWrapIfPossible_ReturnValue) == 0x000170, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ApplyMaterialAndUseWrapIfPossible_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_LoadedWrap) == 0x000178, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_LoadedWrap' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, Temp_object_Variable1) == 0x000180, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_HitComponent) == 0x000188, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_OtherActor) == 0x000190, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_OtherComp) == 0x000198, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0001A0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_ComponentBoundEvent_Hit) == 0x0001AC, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_bBlockingHit) == 0x000234, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_bInitialOverlap) == 0x000235, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Time) == 0x000238, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Distance) == 0x00023C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Location) == 0x000240, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_ImpactPoint) == 0x00024C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_Normal) == 0x000258, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_ImpactNormal) == 0x000264, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_HitItem) == 0x000290, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_FaceIndex) == 0x000294, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_TraceStart) == 0x000298, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BreakHitResult_TraceEnd) == 0x0002A4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ShouldBump_Bump) == 0x0002B0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ShouldBump_Bump' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ShouldDestroyProp__ReturnValue) == 0x0002B1, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ShouldDestroyProp__ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_IsDedicatedServer_ReturnValue6) == 0x0002B2, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_IsDedicatedServer_ReturnValue6' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_AsBuilding_Prop) == 0x0002B8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_AsBuilding_Prop' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_DynamicCast_bSuccess2) == 0x0002C0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_ActorHasTag_ReturnValue) == 0x0002C1, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_CreateDelegate_OutputDelegate1) == 0x0002C4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002D4, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x0002D8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_Greater_FloatFloat_ReturnValue4) == 0x0002D9, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_Greater_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_BooleanAND_ReturnValue) == 0x0002DA, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0002E0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Damage) == 0x0002E8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_DamageTags) == 0x0002F0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_Momentum) == 0x000310, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_HitInfo) == 0x00031C, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_InstigatedBy) == 0x0003A8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_DamageCauser) == 0x0003B0, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena, K2Node_Event_EffectContext) == 0x0003B8, "Member 'JackalVehicle_Athena_C_ExecuteUbergraph_JackalVehicle_Athena::K2Node_Event_EffectContext' has a wrong offset!");
