#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LargeStatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function LargeStatWidget.LargeStatWidget_C.ExecuteUbergraph_LargeStatWidget
// 0x00D8 (0x00D8 - 0x0000)
struct LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBaseStatView*                    CallFunc_GetBaseStatView_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUIStatStyle                       CallFunc_GetStatStyle_ReturnValue;                 // 0x0010(0x00C0)(ConstParm)
	float                                         CallFunc_GetStat_ReturnValue;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget) == 0x000008, "Wrong alignment on LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget");
static_assert(sizeof(LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget) == 0x0000D8, "Wrong size on LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget");
static_assert(offsetof(LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget, EntryPoint) == 0x000000, "Member 'LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget, CallFunc_GetBaseStatView_ReturnValue) == 0x000008, "Member 'LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget::CallFunc_GetBaseStatView_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget, CallFunc_GetStatStyle_ReturnValue) == 0x000010, "Member 'LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget::CallFunc_GetStatStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget, CallFunc_GetStat_ReturnValue) == 0x0000D0, "Member 'LargeStatWidget_C_ExecuteUbergraph_LargeStatWidget::CallFunc_GetStat_ReturnValue' has a wrong offset!");

// Function LargeStatWidget.LargeStatWidget_C.SetStatEntryNumber
// 0x0070 (0x0070 - 0x0000)
struct LargeStatWidget_C_SetStatEntryNumber final
{
public:
	int32                                         Param_StatEntryNumber;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
};
static_assert(alignof(LargeStatWidget_C_SetStatEntryNumber) == 0x000008, "Wrong alignment on LargeStatWidget_C_SetStatEntryNumber");
static_assert(sizeof(LargeStatWidget_C_SetStatEntryNumber) == 0x000070, "Wrong size on LargeStatWidget_C_SetStatEntryNumber");
static_assert(offsetof(LargeStatWidget_C_SetStatEntryNumber, Param_StatEntryNumber) == 0x000000, "Member 'LargeStatWidget_C_SetStatEntryNumber::Param_StatEntryNumber' has a wrong offset!");
static_assert(offsetof(LargeStatWidget_C_SetStatEntryNumber, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'LargeStatWidget_C_SetStatEntryNumber::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LargeStatWidget_C_SetStatEntryNumber, K2Node_MakeArray_Array) == 0x000048, "Member 'LargeStatWidget_C_SetStatEntryNumber::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LargeStatWidget_C_SetStatEntryNumber, CallFunc_Format_ReturnValue) == 0x000058, "Member 'LargeStatWidget_C_SetStatEntryNumber::CallFunc_Format_ReturnValue' has a wrong offset!");

}

