#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint.M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C
// 0x2040 (0x2410 - 0x03D0)
class UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4D083CFB43E11F85A96087A218BB7BAE; // 0x03D8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1872ACF04C46FFA045FC69B4A8A5BE74; // 0x03F8(0x0138)(ContainsInstancedReference)
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_DA7F616742A73676682DFE962C7A9097; // 0x0530(0x0310)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7DB76C3F48F97D8CF7DFB98F3C0DF756; // 0x0840(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F250A6D64C5D0DFA740D4AA5A241B6D7; // 0x0860(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_68C7555B4952C826BD5E4CB53F095FA7; // 0x0880(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8651B63E4AA91C51A815929C08C3C559; // 0x0B90(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_EFFE8AEA4DD194B52BCE94B3662DE607; // 0x0EA0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_38FA54CC43BC1C1D2C4408A8C09F82E6; // 0x11B0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A5E507C9415604E9DAE77683DBC92AE0; // 0x14C0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8C4AA5B641FE517FCA350DB5D1932FE4; // 0x17D0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_01EDC5964A42C785313443AE90C2EA31; // 0x1AE0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_B78997D142A0D1CF2837DF888BDB7B06; // 0x1DF0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A0C97E4A46266B7CFE56A7BC1B12FC7C; // 0x2100(0x0310)()

public:
	void ExecuteUbergraph_M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C">();
	}
	static class UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C) == 0x002410, "Wrong size on UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0003D0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_4D083CFB43E11F85A96087A218BB7BAE) == 0x0003D8, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_4D083CFB43E11F85A96087A218BB7BAE' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh_1872ACF04C46FFA045FC69B4A8A5BE74) == 0x0003F8, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh_1872ACF04C46FFA045FC69B4A8A5BE74' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_DA7F616742A73676682DFE962C7A9097) == 0x000530, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_DA7F616742A73676682DFE962C7A9097' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_7DB76C3F48F97D8CF7DFB98F3C0DF756) == 0x000840, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_7DB76C3F48F97D8CF7DFB98F3C0DF756' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_F250A6D64C5D0DFA740D4AA5A241B6D7) == 0x000860, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_F250A6D64C5D0DFA740D4AA5A241B6D7' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_68C7555B4952C826BD5E4CB53F095FA7) == 0x000880, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_68C7555B4952C826BD5E4CB53F095FA7' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_8651B63E4AA91C51A815929C08C3C559) == 0x000B90, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_8651B63E4AA91C51A815929C08C3C559' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_EFFE8AEA4DD194B52BCE94B3662DE607) == 0x000EA0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_EFFE8AEA4DD194B52BCE94B3662DE607' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_38FA54CC43BC1C1D2C4408A8C09F82E6) == 0x0011B0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_38FA54CC43BC1C1D2C4408A8C09F82E6' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_A5E507C9415604E9DAE77683DBC92AE0) == 0x0014C0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_A5E507C9415604E9DAE77683DBC92AE0' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_8C4AA5B641FE517FCA350DB5D1932FE4) == 0x0017D0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_8C4AA5B641FE517FCA350DB5D1932FE4' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_01EDC5964A42C785313443AE90C2EA31) == 0x001AE0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_01EDC5964A42C785313443AE90C2EA31' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_B78997D142A0D1CF2837DF888BDB7B06) == 0x001DF0, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_B78997D142A0D1CF2837DF888BDB7B06' has a wrong offset!");
static_assert(offsetof(UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_A0C97E4A46266B7CFE56A7BC1B12FC7C) == 0x002100, "Member 'UM_SML_Lars_FaceAccessory_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_A0C97E4A46266B7CFE56A7BC1B12FC7C' has a wrong offset!");

}

