#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchmakingInputIndicator

#include "Basic.hpp"

#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function MatchmakingInputIndicator.MatchmakingInputIndicator_C.ExecuteUbergraph_MatchmakingInputIndicator
// 0x0018 (0x0018 - 0x0000)
struct MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Event_InputType;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator) == 0x000008, "Wrong alignment on MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator");
static_assert(sizeof(MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator) == 0x000018, "Wrong size on MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator");
static_assert(offsetof(MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator, EntryPoint) == 0x000000, "Member 'MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator, K2Node_Event_InputType) == 0x000004, "Member 'MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator::K2Node_Event_InputType' has a wrong offset!");
static_assert(offsetof(MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator, CallFunc_Map_Find_Value) == 0x000008, "Member 'MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'MatchmakingInputIndicator_C_ExecuteUbergraph_MatchmakingInputIndicator::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function MatchmakingInputIndicator.MatchmakingInputIndicator_C.OnInputSourceTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct MatchmakingInputIndicator_C_OnInputSourceTypeChanged final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchmakingInputIndicator_C_OnInputSourceTypeChanged) == 0x000001, "Wrong alignment on MatchmakingInputIndicator_C_OnInputSourceTypeChanged");
static_assert(sizeof(MatchmakingInputIndicator_C_OnInputSourceTypeChanged) == 0x000001, "Wrong size on MatchmakingInputIndicator_C_OnInputSourceTypeChanged");
static_assert(offsetof(MatchmakingInputIndicator_C_OnInputSourceTypeChanged, InputType) == 0x000000, "Member 'MatchmakingInputIndicator_C_OnInputSourceTypeChanged::InputType' has a wrong offset!");

}

