#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameMode_PirateShip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MinigameMode_Skirmish_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MinigameMode_PirateShip.MinigameMode_PirateShip_C
// 0x0028 (0x0720 - 0x06F8)
class AMinigameMode_PirateShip_C final : public AMinigameMode_Skirmish_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MinigameMode_PirateShip_C;          // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UFortWorldItemDefinition*>       Pirate_Ship_Weapons;                               // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortWorldItemDefinition*>       Pirate_Ship_Ammo;                                  // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MinigameMode_PirateShip(int32 EntryPoint);
	void GiveStartingWeapon();
	void UserConstructionScript();
	struct FGameplayTagQuery GetStartQueryForPlayer(class APlayerState* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinigameMode_PirateShip_C">();
	}
	static class AMinigameMode_PirateShip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMinigameMode_PirateShip_C>();
	}
};
static_assert(alignof(AMinigameMode_PirateShip_C) == 0x000008, "Wrong alignment on AMinigameMode_PirateShip_C");
static_assert(sizeof(AMinigameMode_PirateShip_C) == 0x000720, "Wrong size on AMinigameMode_PirateShip_C");
static_assert(offsetof(AMinigameMode_PirateShip_C, UberGraphFrame_MinigameMode_PirateShip_C) == 0x0006F8, "Member 'AMinigameMode_PirateShip_C::UberGraphFrame_MinigameMode_PirateShip_C' has a wrong offset!");
static_assert(offsetof(AMinigameMode_PirateShip_C, Pirate_Ship_Weapons) == 0x000700, "Member 'AMinigameMode_PirateShip_C::Pirate_Ship_Weapons' has a wrong offset!");
static_assert(offsetof(AMinigameMode_PirateShip_C, Pirate_Ship_Ammo) == 0x000710, "Member 'AMinigameMode_PirateShip_C::Pirate_Ship_Ammo' has a wrong offset!");

}

