#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameMode_IronClad

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MinigameMode_IronClad.MinigameMode_IronClad_C.ExecuteUbergraph_MinigameMode_IronClad
// 0x00C0 (0x00C0 - 0x0000)
struct MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               CallFunc_Array_Get_Item1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolumeManager*                     CallFunc_GetVolumeManager_OutVolumeManager;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVolumeValidityResult                         CallFunc_GetVolumeManager_OutIsValid;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AController*>                    CallFunc_GetAllPlayersInVolume_ReturnValue;        // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_Array_Get_Item2;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner1_CastInput; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EquipBestWeapon_ReturnValue;              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad) == 0x000008, "Wrong alignment on MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad");
static_assert(sizeof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad) == 0x0000C0, "Wrong size on MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, EntryPoint) == 0x000000, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::EntryPoint' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, Temp_int_Array_Index_Variable) == 0x000008, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, Temp_int_Loop_Counter_Variable1) == 0x000010, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, Temp_int_Array_Index_Variable1) == 0x000018, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, Temp_int_Loop_Counter_Variable2) == 0x00001C, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, Temp_int_Array_Index_Variable2) == 0x000024, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Array_Get_Item) == 0x000028, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Array_Get_Item1) == 0x000030, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Array_Length_ReturnValue1) == 0x00003C, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Less_IntInt_ReturnValue1) == 0x000041, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_GetVolumeManager_OutVolumeManager) == 0x000048, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_GetVolumeManager_OutVolumeManager' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_GetVolumeManager_OutIsValid) == 0x000050, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_GetVolumeManager_OutIsValid' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_GetAllPlayersInVolume_ReturnValue) == 0x000058, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_GetAllPlayersInVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Array_Length_ReturnValue2) == 0x000068, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Array_Get_Item2) == 0x000070, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_Less_IntInt_ReturnValue2) == 0x000078, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000080, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x000090, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_GiveItemToInventoryOwner_InventoryOwner1_CastInput) == 0x0000A0, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_GiveItemToInventoryOwner_InventoryOwner1_CastInput' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000B0, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad, CallFunc_EquipBestWeapon_ReturnValue) == 0x0000B9, "Member 'MinigameMode_IronClad_C_ExecuteUbergraph_MinigameMode_IronClad::CallFunc_EquipBestWeapon_ReturnValue' has a wrong offset!");

}

