#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameMode_BuildTheStructure

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MinigameMode_BuildTheStructure.MinigameMode_BuildTheStructure_C.ExecuteUbergraph_MinigameMode_BuildTheStructure
// 0x0050 (0x0050 - 0x0000)
struct MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerState*>               CallFunc_GetParticipatingPlayers_OutPlayers;       // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRuntime_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalMilliseconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure) == 0x000008, "Wrong alignment on MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure");
static_assert(sizeof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure) == 0x000050, "Wrong size on MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, EntryPoint) == 0x000000, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::EntryPoint' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_GetParticipatingPlayers_OutPlayers) == 0x000008, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_GetParticipatingPlayers_OutPlayers' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_Array_Get_Item) == 0x000028, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_GetRuntime_ReturnValue) == 0x000030, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_GetRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_FromSeconds_ReturnValue) == 0x000038, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_GetTotalMilliseconds_ReturnValue) == 0x000040, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_GetTotalMilliseconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_FTrunc_ReturnValue) == 0x000048, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'MinigameMode_BuildTheStructure_C_ExecuteUbergraph_MinigameMode_BuildTheStructure::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function MinigameMode_BuildTheStructure.MinigameMode_BuildTheStructure_C.GiveWood
// 0x0058 (0x0058 - 0x0000)
struct MinigameMode_BuildTheStructure_C_GiveWood final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolumeManager*                     CallFunc_GetVolumeManager_OutVolumeManager;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVolumeValidityResult                         CallFunc_GetVolumeManager_OutIsValid;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AController*>                    CallFunc_GetAllPlayersInVolume_ReturnValue;        // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MinigameMode_BuildTheStructure_C_GiveWood) == 0x000008, "Wrong alignment on MinigameMode_BuildTheStructure_C_GiveWood");
static_assert(sizeof(MinigameMode_BuildTheStructure_C_GiveWood) == 0x000058, "Wrong size on MinigameMode_BuildTheStructure_C_GiveWood");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_GetVolumeManager_OutVolumeManager) == 0x000010, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_GetVolumeManager_OutVolumeManager' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_GetVolumeManager_OutIsValid) == 0x000018, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_GetVolumeManager_OutIsValid' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_GetAllPlayersInVolume_ReturnValue) == 0x000020, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_GetAllPlayersInVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_Array_Get_Item) == 0x000038, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000048, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MinigameMode_BuildTheStructure_C_GiveWood, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x000054, "Member 'MinigameMode_BuildTheStructure_C_GiveWood::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");

}

