#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameMode_Skirmish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MinigameMode_Skirmish.MinigameMode_Skirmish_C
// 0x0020 (0x06F8 - 0x06D8)
class AMinigameMode_Skirmish_C : public AFortMinigame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               StartingWeapon;                                    // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               StartingAmmo;                                      // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingAmmoAmmount;                               // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MinigameMode_Skirmish(int32 EntryPoint);
	void HandleMinigameWarmup();
	void UserConstructionScript();
	void SetPlayerPositionToStart();
	void SetSinglePlayerToStart(class AFortPlayerController* Player);
	void GiveStartingWeapon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinigameMode_Skirmish_C">();
	}
	static class AMinigameMode_Skirmish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMinigameMode_Skirmish_C>();
	}
};
static_assert(alignof(AMinigameMode_Skirmish_C) == 0x000008, "Wrong alignment on AMinigameMode_Skirmish_C");
static_assert(sizeof(AMinigameMode_Skirmish_C) == 0x0006F8, "Wrong size on AMinigameMode_Skirmish_C");
static_assert(offsetof(AMinigameMode_Skirmish_C, UberGraphFrame) == 0x0006D8, "Member 'AMinigameMode_Skirmish_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMinigameMode_Skirmish_C, StartingWeapon) == 0x0006E0, "Member 'AMinigameMode_Skirmish_C::StartingWeapon' has a wrong offset!");
static_assert(offsetof(AMinigameMode_Skirmish_C, StartingAmmo) == 0x0006E8, "Member 'AMinigameMode_Skirmish_C::StartingAmmo' has a wrong offset!");
static_assert(offsetof(AMinigameMode_Skirmish_C, StartingAmmoAmmount) == 0x0006F0, "Member 'AMinigameMode_Skirmish_C::StartingAmmoAmmount' has a wrong offset!");

}

