#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionDetailsModifierRow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.ExecuteUbergraph_MissionDetailsModifierRow
// 0x0004 (0x0004 - 0x0000)
struct MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow) == 0x000004, "Wrong alignment on MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow");
static_assert(sizeof(MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow) == 0x000004, "Wrong size on MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow");
static_assert(offsetof(MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow, EntryPoint) == 0x000000, "Member 'MissionDetailsModifierRow_C_ExecuteUbergraph_MissionDetailsModifierRow::EntryPoint' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.Update
// 0x0008 (0x0008 - 0x0000)
struct MissionDetailsModifierRow_C_Update final
{
public:
	struct FVector2D                              NormalSize;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_Update) == 0x000004, "Wrong alignment on MissionDetailsModifierRow_C_Update");
static_assert(sizeof(MissionDetailsModifierRow_C_Update) == 0x000008, "Wrong size on MissionDetailsModifierRow_C_Update");
static_assert(offsetof(MissionDetailsModifierRow_C_Update, NormalSize) == 0x000000, "Member 'MissionDetailsModifierRow_C_Update::NormalSize' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.PlayIntroAnimation
// 0x0008 (0x0008 - 0x0000)
struct MissionDetailsModifierRow_C_PlayIntroAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_PlayIntroAnimation) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_PlayIntroAnimation");
static_assert(sizeof(MissionDetailsModifierRow_C_PlayIntroAnimation) == 0x000008, "Wrong size on MissionDetailsModifierRow_C_PlayIntroAnimation");
static_assert(offsetof(MissionDetailsModifierRow_C_PlayIntroAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'MissionDetailsModifierRow_C_PlayIntroAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.Show Label
// 0x0005 (0x0005 - 0x0000)
struct MissionDetailsModifierRow_C_Show_Label final
{
public:
	bool                                          ShowLabel;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_Show_Label) == 0x000001, "Wrong alignment on MissionDetailsModifierRow_C_Show_Label");
static_assert(sizeof(MissionDetailsModifierRow_C_Show_Label) == 0x000005, "Wrong size on MissionDetailsModifierRow_C_Show_Label");
static_assert(offsetof(MissionDetailsModifierRow_C_Show_Label, ShowLabel) == 0x000000, "Member 'MissionDetailsModifierRow_C_Show_Label::ShowLabel' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_Show_Label, Temp_bool_Variable) == 0x000001, "Member 'MissionDetailsModifierRow_C_Show_Label::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_Show_Label, Temp_byte_Variable) == 0x000002, "Member 'MissionDetailsModifierRow_C_Show_Label::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_Show_Label, Temp_byte_Variable1) == 0x000003, "Member 'MissionDetailsModifierRow_C_Show_Label::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_Show_Label, K2Node_Select_Default) == 0x000004, "Member 'MissionDetailsModifierRow_C_Show_Label::K2Node_Select_Default' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.UpdateIcon
// 0x0030 (0x0030 - 0x0000)
struct MissionDetailsModifierRow_C_UpdateIcon final
{
public:
	struct FVector2D                              Normal_Size;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Small_Size;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_UpdateIcon) == 0x000004, "Wrong alignment on MissionDetailsModifierRow_C_UpdateIcon");
static_assert(sizeof(MissionDetailsModifierRow_C_UpdateIcon) == 0x000030, "Wrong size on MissionDetailsModifierRow_C_UpdateIcon");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, Normal_Size) == 0x000000, "Member 'MissionDetailsModifierRow_C_UpdateIcon::Normal_Size' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, Small_Size) == 0x000008, "Member 'MissionDetailsModifierRow_C_UpdateIcon::Small_Size' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, Temp_bool_Variable) == 0x000010, "Member 'MissionDetailsModifierRow_C_UpdateIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, CallFunc_BreakVector2D_X) == 0x000014, "Member 'MissionDetailsModifierRow_C_UpdateIcon::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'MissionDetailsModifierRow_C_UpdateIcon::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, CallFunc_BreakVector2D_X1) == 0x00001C, "Member 'MissionDetailsModifierRow_C_UpdateIcon::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, CallFunc_BreakVector2D_Y1) == 0x000020, "Member 'MissionDetailsModifierRow_C_UpdateIcon::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, Temp_bool_Variable1) == 0x000024, "Member 'MissionDetailsModifierRow_C_UpdateIcon::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, K2Node_Select_Default) == 0x000028, "Member 'MissionDetailsModifierRow_C_UpdateIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateIcon, K2Node_Select1_Default) == 0x00002C, "Member 'MissionDetailsModifierRow_C_UpdateIcon::K2Node_Select1_Default' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetName
// 0x0020 (0x0020 - 0x0000)
struct MissionDetailsModifierRow_C_SetName final
{
public:
	class FText                                   In_Name;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetName) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetName");
static_assert(sizeof(MissionDetailsModifierRow_C_SetName) == 0x000020, "Wrong size on MissionDetailsModifierRow_C_SetName");
static_assert(offsetof(MissionDetailsModifierRow_C_SetName, In_Name) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetName::In_Name' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetName, CallFunc_NotEqual_TextText_ReturnValue) == 0x000018, "Member 'MissionDetailsModifierRow_C_SetName::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetShowName
// 0x0002 (0x0002 - 0x0000)
struct MissionDetailsModifierRow_C_SetShowName final
{
public:
	bool                                          In_Show;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetShowName) == 0x000001, "Wrong alignment on MissionDetailsModifierRow_C_SetShowName");
static_assert(sizeof(MissionDetailsModifierRow_C_SetShowName) == 0x000002, "Wrong size on MissionDetailsModifierRow_C_SetShowName");
static_assert(offsetof(MissionDetailsModifierRow_C_SetShowName, In_Show) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetShowName::In_Show' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetShowName, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'MissionDetailsModifierRow_C_SetShowName::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetNameTextStyle
// 0x0010 (0x0010 - 0x0000)
struct MissionDetailsModifierRow_C_SetNameTextStyle final
{
public:
	class UClass*                                 In_Style;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetNameTextStyle) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetNameTextStyle");
static_assert(sizeof(MissionDetailsModifierRow_C_SetNameTextStyle) == 0x000010, "Wrong size on MissionDetailsModifierRow_C_SetNameTextStyle");
static_assert(offsetof(MissionDetailsModifierRow_C_SetNameTextStyle, In_Style) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetNameTextStyle::In_Style' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetNameTextStyle, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000008, "Member 'MissionDetailsModifierRow_C_SetNameTextStyle::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.UpdateShowName
// 0x0004 (0x0004 - 0x0000)
struct MissionDetailsModifierRow_C_UpdateShowName final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_UpdateShowName) == 0x000001, "Wrong alignment on MissionDetailsModifierRow_C_UpdateShowName");
static_assert(sizeof(MissionDetailsModifierRow_C_UpdateShowName) == 0x000004, "Wrong size on MissionDetailsModifierRow_C_UpdateShowName");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowName, Temp_bool_Variable) == 0x000000, "Member 'MissionDetailsModifierRow_C_UpdateShowName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowName, Temp_byte_Variable) == 0x000001, "Member 'MissionDetailsModifierRow_C_UpdateShowName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowName, Temp_byte_Variable1) == 0x000002, "Member 'MissionDetailsModifierRow_C_UpdateShowName::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowName, K2Node_Select_Default) == 0x000003, "Member 'MissionDetailsModifierRow_C_UpdateShowName::K2Node_Select_Default' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetDescription
// 0x0020 (0x0020 - 0x0000)
struct MissionDetailsModifierRow_C_SetDescription final
{
public:
	class FText                                   In_Description;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetDescription) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetDescription");
static_assert(sizeof(MissionDetailsModifierRow_C_SetDescription) == 0x000020, "Wrong size on MissionDetailsModifierRow_C_SetDescription");
static_assert(offsetof(MissionDetailsModifierRow_C_SetDescription, In_Description) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetDescription::In_Description' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetDescription, CallFunc_NotEqual_TextText_ReturnValue) == 0x000018, "Member 'MissionDetailsModifierRow_C_SetDescription::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetShowDescription
// 0x0002 (0x0002 - 0x0000)
struct MissionDetailsModifierRow_C_SetShowDescription final
{
public:
	bool                                          In_Show;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetShowDescription) == 0x000001, "Wrong alignment on MissionDetailsModifierRow_C_SetShowDescription");
static_assert(sizeof(MissionDetailsModifierRow_C_SetShowDescription) == 0x000002, "Wrong size on MissionDetailsModifierRow_C_SetShowDescription");
static_assert(offsetof(MissionDetailsModifierRow_C_SetShowDescription, In_Show) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetShowDescription::In_Show' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetShowDescription, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'MissionDetailsModifierRow_C_SetShowDescription::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.UpdateShowDescription
// 0x0004 (0x0004 - 0x0000)
struct MissionDetailsModifierRow_C_UpdateShowDescription final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_UpdateShowDescription) == 0x000001, "Wrong alignment on MissionDetailsModifierRow_C_UpdateShowDescription");
static_assert(sizeof(MissionDetailsModifierRow_C_UpdateShowDescription) == 0x000004, "Wrong size on MissionDetailsModifierRow_C_UpdateShowDescription");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowDescription, Temp_bool_Variable) == 0x000000, "Member 'MissionDetailsModifierRow_C_UpdateShowDescription::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowDescription, Temp_byte_Variable) == 0x000001, "Member 'MissionDetailsModifierRow_C_UpdateShowDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowDescription, Temp_byte_Variable1) == 0x000002, "Member 'MissionDetailsModifierRow_C_UpdateShowDescription::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_UpdateShowDescription, K2Node_Select_Default) == 0x000003, "Member 'MissionDetailsModifierRow_C_UpdateShowDescription::K2Node_Select_Default' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetDescriptionTextStyle
// 0x0010 (0x0010 - 0x0000)
struct MissionDetailsModifierRow_C_SetDescriptionTextStyle final
{
public:
	class UClass*                                 In_Style;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetDescriptionTextStyle) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetDescriptionTextStyle");
static_assert(sizeof(MissionDetailsModifierRow_C_SetDescriptionTextStyle) == 0x000010, "Wrong size on MissionDetailsModifierRow_C_SetDescriptionTextStyle");
static_assert(offsetof(MissionDetailsModifierRow_C_SetDescriptionTextStyle, In_Style) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetDescriptionTextStyle::In_Style' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetDescriptionTextStyle, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000008, "Member 'MissionDetailsModifierRow_C_SetDescriptionTextStyle::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetUseSmallIcon
// 0x0002 (0x0002 - 0x0000)
struct MissionDetailsModifierRow_C_SetUseSmallIcon final
{
public:
	bool                                          In_Use;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetUseSmallIcon) == 0x000001, "Wrong alignment on MissionDetailsModifierRow_C_SetUseSmallIcon");
static_assert(sizeof(MissionDetailsModifierRow_C_SetUseSmallIcon) == 0x000002, "Wrong size on MissionDetailsModifierRow_C_SetUseSmallIcon");
static_assert(offsetof(MissionDetailsModifierRow_C_SetUseSmallIcon, In_Use) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetUseSmallIcon::In_Use' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetUseSmallIcon, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'MissionDetailsModifierRow_C_SetUseSmallIcon::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetIcon
// 0x0010 (0x0010 - 0x0000)
struct MissionDetailsModifierRow_C_SetIcon final
{
public:
	class UTexture2D*                             In_Icon;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetIcon) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetIcon");
static_assert(sizeof(MissionDetailsModifierRow_C_SetIcon) == 0x000010, "Wrong size on MissionDetailsModifierRow_C_SetIcon");
static_assert(offsetof(MissionDetailsModifierRow_C_SetIcon, In_Icon) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetIcon::In_Icon' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetIcon, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'MissionDetailsModifierRow_C_SetIcon::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetIconAsset
// 0x0030 (0x0030 - 0x0000)
struct MissionDetailsModifierRow_C_SetIconAsset final
{
public:
	TSoftObjectPtr<class UTexture2D>              In_Icon;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetIconAsset) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetIconAsset");
static_assert(sizeof(MissionDetailsModifierRow_C_SetIconAsset) == 0x000030, "Wrong size on MissionDetailsModifierRow_C_SetIconAsset");
static_assert(offsetof(MissionDetailsModifierRow_C_SetIconAsset, In_Icon) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetIconAsset::In_Icon' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetIconAsset, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000028, "Member 'MissionDetailsModifierRow_C_SetIconAsset::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");

// Function MissionDetailsModifierRow.MissionDetailsModifierRow_C.SetData
// 0x0088 (0x0088 - 0x0000)
struct MissionDetailsModifierRow_C_SetData final
{
public:
	class FText                                   In_Name;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          In_Show_Name;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 In_Name_Text_Style;                                // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_Description;                                    // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          In_Show_Description;                               // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 In_Desc_Text_Style;                                // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             In_Icon;                                           // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Use_Small_Icon;                                 // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              In_Icon_Asset;                                     // 0x0060(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(MissionDetailsModifierRow_C_SetData) == 0x000008, "Wrong alignment on MissionDetailsModifierRow_C_SetData");
static_assert(sizeof(MissionDetailsModifierRow_C_SetData) == 0x000088, "Wrong size on MissionDetailsModifierRow_C_SetData");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Name) == 0x000000, "Member 'MissionDetailsModifierRow_C_SetData::In_Name' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Show_Name) == 0x000018, "Member 'MissionDetailsModifierRow_C_SetData::In_Show_Name' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Name_Text_Style) == 0x000020, "Member 'MissionDetailsModifierRow_C_SetData::In_Name_Text_Style' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Description) == 0x000028, "Member 'MissionDetailsModifierRow_C_SetData::In_Description' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Show_Description) == 0x000040, "Member 'MissionDetailsModifierRow_C_SetData::In_Show_Description' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Desc_Text_Style) == 0x000048, "Member 'MissionDetailsModifierRow_C_SetData::In_Desc_Text_Style' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Icon) == 0x000050, "Member 'MissionDetailsModifierRow_C_SetData::In_Icon' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Use_Small_Icon) == 0x000058, "Member 'MissionDetailsModifierRow_C_SetData::In_Use_Small_Icon' has a wrong offset!");
static_assert(offsetof(MissionDetailsModifierRow_C_SetData, In_Icon_Asset) == 0x000060, "Member 'MissionDetailsModifierRow_C_SetData::In_Icon_Asset' has a wrong offset!");

}

