#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionAlertIndicator

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MissionAlertIndicator.MissionAlertIndicator_C.ExecuteUbergraph_MissionAlertIndicator
// 0x0004 (0x0004 - 0x0000)
struct MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator) == 0x000004, "Wrong alignment on MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator");
static_assert(sizeof(MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator) == 0x000004, "Wrong size on MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator");
static_assert(offsetof(MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator, EntryPoint) == 0x000000, "Member 'MissionAlertIndicator_C_ExecuteUbergraph_MissionAlertIndicator::EntryPoint' has a wrong offset!");

// Function MissionAlertIndicator.MissionAlertIndicator_C.ToggleTimer
// 0x0020 (0x0020 - 0x0000)
struct MissionAlertIndicator_C_ToggleTimer final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionAlertIndicator_C_ToggleTimer) == 0x000008, "Wrong alignment on MissionAlertIndicator_C_ToggleTimer");
static_assert(sizeof(MissionAlertIndicator_C_ToggleTimer) == 0x000020, "Wrong size on MissionAlertIndicator_C_ToggleTimer");
static_assert(offsetof(MissionAlertIndicator_C_ToggleTimer, IsEnabled) == 0x000000, "Member 'MissionAlertIndicator_C_ToggleTimer::IsEnabled' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_ToggleTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000001, "Member 'MissionAlertIndicator_C_ToggleTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_ToggleTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MissionAlertIndicator_C_ToggleTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_ToggleTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'MissionAlertIndicator_C_ToggleTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function MissionAlertIndicator.MissionAlertIndicator_C.Config
// 0x0108 (0x0108 - 0x0000)
struct MissionAlertIndicator_C_Config final
{
public:
	struct FGameplayTagContainer                  AlertVisualTags;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0020(0x0048)()
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_Get_Mission_Alert_Visual_Icon_OutBrush;   // 0x0070(0x0088)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionAlertIndicator_C_Config) == 0x000008, "Wrong alignment on MissionAlertIndicator_C_Config");
static_assert(sizeof(MissionAlertIndicator_C_Config) == 0x000108, "Wrong size on MissionAlertIndicator_C_Config");
static_assert(offsetof(MissionAlertIndicator_C_Config, AlertVisualTags) == 0x000000, "Member 'MissionAlertIndicator_C_Config::AlertVisualTags' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Config, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000020, "Member 'MissionAlertIndicator_C_Config::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Config, CallFunc_DoesContainerMatchTagQuery_ReturnValue) == 0x000068, "Member 'MissionAlertIndicator_C_Config::CallFunc_DoesContainerMatchTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Config, CallFunc_Get_Mission_Alert_Visual_Icon_OutBrush) == 0x000070, "Member 'MissionAlertIndicator_C_Config::CallFunc_Get_Mission_Alert_Visual_Icon_OutBrush' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Config, K2Node_MakeStruct_LinearColor) == 0x0000F8, "Member 'MissionAlertIndicator_C_Config::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function MissionAlertIndicator.MissionAlertIndicator_C.Get Mission Alert Visual Icon
// 0x02D8 (0x02D8 - 0x0000)
struct MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateBrush                            OutBrush;                                          // 0x0020(0x0088)(Parm, OutParm)
	struct FSlateBrush                            OutSlateBrush;                                     // 0x00A8(0x0088)(Edit, BlueprintVisible)
	TMap<struct FGameplayTag, class UTexture*>    GameplayTags;                                      // 0x0130(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	class UObject*                                ElementalZoneWaterImage;                           // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ElementalZoneNatureImage;                          // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ElementalZoneFireImage;                            // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MinibossAlertImage;                                // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                StormAlertImage;                                   // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x01A8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       CallFunc_Map_Values_Values;                        // 0x01C8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class UTexture*>    K2Node_MakeVariable_MakeVariableOutput;            // 0x01E0(0x0050)(ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0240(0x0088)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item1;                          // 0x02CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon) == 0x000008, "Wrong alignment on MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon");
static_assert(sizeof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon) == 0x0002D8, "Wrong size on MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, TagContainer) == 0x000000, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::TagContainer' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, OutBrush) == 0x000020, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::OutBrush' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, OutSlateBrush) == 0x0000A8, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::OutSlateBrush' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, GameplayTags) == 0x000130, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::GameplayTags' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, ElementalZoneWaterImage) == 0x000180, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::ElementalZoneWaterImage' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, ElementalZoneNatureImage) == 0x000188, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::ElementalZoneNatureImage' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, ElementalZoneFireImage) == 0x000190, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::ElementalZoneFireImage' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, MinibossAlertImage) == 0x000198, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::MinibossAlertImage' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, StormAlertImage) == 0x0001A0, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::StormAlertImage' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Map_Keys_Keys) == 0x0001A8, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, Temp_int_Loop_Counter_Variable) == 0x0001BC, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Less_IntInt_ReturnValue) == 0x0001C0, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Map_Values_Values) == 0x0001C8, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Add_IntInt_ReturnValue) == 0x0001D8, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, K2Node_MakeVariable_MakeVariableOutput) == 0x0001E0, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, Temp_int_Array_Index_Variable) == 0x000230, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, Temp_bool_True_if_break_was_hit_Variable) == 0x000234, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Array_Get_Item) == 0x000238, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, K2Node_MakeStruct_SlateBrush) == 0x000240, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Not_PreBool_ReturnValue) == 0x0002C8, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_BooleanAND_ReturnValue) == 0x0002C9, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_Array_Get_Item1) == 0x0002CC, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon, CallFunc_HasTag_ReturnValue) == 0x0002D4, "Member 'MissionAlertIndicator_C_Get_Mission_Alert_Visual_Icon::CallFunc_HasTag_ReturnValue' has a wrong offset!");

}

