#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModalTutorialOverlay

#include "Basic.hpp"

#include "ScreenPositionEnum_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.ExecuteUbergraph_ModalTutorialOverlay
// 0x0050 (0x0050 - 0x0000)
struct ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay) == 0x000008, "Wrong alignment on ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay");
static_assert(sizeof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay) == 0x000050, "Wrong size on ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, EntryPoint) == 0x000000, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_GetEndTime_ReturnValue1) == 0x000028, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_GetEndTime_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_PlayAnimation_ReturnValue1) == 0x000038, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, Temp_int_Variable) == 0x000048, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'ModalTutorialOverlay_C_ExecuteUbergraph_ModalTutorialOverlay::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ModalTutorialOverlay_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.ShowNext
// 0x00A8 (0x00A8 - 0x0000)
struct ModalTutorialOverlay_C_ShowNext final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0008(0x0028)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item1;                          // 0x0038(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item2;                          // 0x0050(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item3;                          // 0x0080(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModalTutorialOverlay_C_ShowNext) == 0x000008, "Wrong alignment on ModalTutorialOverlay_C_ShowNext");
static_assert(sizeof(ModalTutorialOverlay_C_ShowNext) == 0x0000A8, "Wrong size on ModalTutorialOverlay_C_ShowNext");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, Temp_byte_Variable) == 0x000000, "Member 'ModalTutorialOverlay_C_ShowNext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, Temp_byte_Variable1) == 0x000001, "Member 'ModalTutorialOverlay_C_ShowNext::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_Array_Get_Item) == 0x000008, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, Temp_bool_Variable) == 0x000030, "Member 'ModalTutorialOverlay_C_ShowNext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_Array_Get_Item1) == 0x000038, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_Array_Get_Item2) == 0x000050, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_TextIsEmpty_ReturnValue) == 0x000078, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000079, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, K2Node_Select_Default) == 0x00007A, "Member 'ModalTutorialOverlay_C_ShowNext::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_Array_Get_Item3) == 0x000080, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_ShowNext, CallFunc_GetUINavigationManager_ReturnValue) == 0x0000A0, "Member 'ModalTutorialOverlay_C_ShowNext::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.UpdatePosition
// 0x0080 (0x0080 - 0x0000)
struct ModalTutorialOverlay_C_UpdatePosition final
{
public:
	EScreenPositionEnum                           InPosition;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScreenPositionEnum                           Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScreenPositionEnum                           Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable5;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable6;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable7;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScreenPositionEnum                           Temp_byte_Variable8;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable9;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable10;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable11;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable12;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable13;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable14;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin1;                         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin3;                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin4;                         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            K2Node_Select1_Default;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select2_Default;                            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModalTutorialOverlay_C_UpdatePosition) == 0x000008, "Wrong alignment on ModalTutorialOverlay_C_UpdatePosition");
static_assert(sizeof(ModalTutorialOverlay_C_UpdatePosition) == 0x000080, "Wrong size on ModalTutorialOverlay_C_UpdatePosition");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, InPosition) == 0x000000, "Member 'ModalTutorialOverlay_C_UpdatePosition::InPosition' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable) == 0x000001, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable1) == 0x000002, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable2) == 0x000003, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable3) == 0x000004, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable4) == 0x000005, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable5) == 0x000006, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable6) == 0x000007, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable7) == 0x000008, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable8) == 0x000009, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable9) == 0x00000A, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable10) == 0x00000B, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable11) == 0x00000C, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable12) == 0x00000D, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable13) == 0x00000E, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, Temp_byte_Variable14) == 0x00000F, "Member 'ModalTutorialOverlay_C_UpdatePosition::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_MakeStruct_Margin) == 0x000010, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_MakeStruct_Margin1) == 0x000020, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_MakeStruct_Margin1' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_MakeStruct_Margin2) == 0x000030, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_MakeStruct_Margin2' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_MakeStruct_Margin3) == 0x000040, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_MakeStruct_Margin3' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_MakeStruct_Margin4) == 0x000050, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_MakeStruct_Margin4' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_Select_Default) == 0x000060, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_Select1_Default) == 0x000070, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, K2Node_Select2_Default) == 0x000071, "Member 'ModalTutorialOverlay_C_UpdatePosition::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_UpdatePosition, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000078, "Member 'ModalTutorialOverlay_C_UpdatePosition::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.SetupData
// 0x0030 (0x0030 - 0x0000)
struct ModalTutorialOverlay_C_SetupData final
{
public:
	TArray<class FText>                           InTitle;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class FText>                           InDescription;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<TSoftObjectPtr<class UTexture2D>>      InTexture2D;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(ModalTutorialOverlay_C_SetupData) == 0x000008, "Wrong alignment on ModalTutorialOverlay_C_SetupData");
static_assert(sizeof(ModalTutorialOverlay_C_SetupData) == 0x000030, "Wrong size on ModalTutorialOverlay_C_SetupData");
static_assert(offsetof(ModalTutorialOverlay_C_SetupData, InTitle) == 0x000000, "Member 'ModalTutorialOverlay_C_SetupData::InTitle' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_SetupData, InDescription) == 0x000010, "Member 'ModalTutorialOverlay_C_SetupData::InDescription' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_SetupData, InTexture2D) == 0x000020, "Member 'ModalTutorialOverlay_C_SetupData::InTexture2D' has a wrong offset!");

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.SetPosition
// 0x0008 (0x0008 - 0x0000)
struct ModalTutorialOverlay_C_SetPosition final
{
public:
	EScreenPositionEnum                           InPosition;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Offset;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModalTutorialOverlay_C_SetPosition) == 0x000004, "Wrong alignment on ModalTutorialOverlay_C_SetPosition");
static_assert(sizeof(ModalTutorialOverlay_C_SetPosition) == 0x000008, "Wrong size on ModalTutorialOverlay_C_SetPosition");
static_assert(offsetof(ModalTutorialOverlay_C_SetPosition, InPosition) == 0x000000, "Member 'ModalTutorialOverlay_C_SetPosition::InPosition' has a wrong offset!");
static_assert(offsetof(ModalTutorialOverlay_C_SetPosition, Offset) == 0x000004, "Member 'ModalTutorialOverlay_C_SetPosition::Offset' has a wrong offset!");

// Function ModalTutorialOverlay.ModalTutorialOverlay_C.SetIndex
// 0x0004 (0x0004 - 0x0000)
struct ModalTutorialOverlay_C_SetIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModalTutorialOverlay_C_SetIndex) == 0x000004, "Wrong alignment on ModalTutorialOverlay_C_SetIndex");
static_assert(sizeof(ModalTutorialOverlay_C_SetIndex) == 0x000004, "Wrong size on ModalTutorialOverlay_C_SetIndex");
static_assert(offsetof(ModalTutorialOverlay_C_SetIndex, InIndex) == 0x000000, "Member 'ModalTutorialOverlay_C_SetIndex::InIndex' has a wrong offset!");

}

