#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MovieWidget.MovieWidget_C
// 0x0040 (0x02A8 - 0x0268)
class UMovieWidget_C final : public UFortMovieWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Video_Image;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Video_ScaleBox;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Shouldloop;                                        // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          AutoPlay;                                          // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          MaintainAspectRatio;                               // 0x0282(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnMediaReadyToPlay;                                // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnMediaFailedToOpen;                               // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnMediaReadyToPlay__DelegateSignature();
	void OnMediaFailedToOpen__DelegateSignature();
	void ExecuteUbergraph_MovieWidget(int32 EntryPoint);
	void OnMediaLoaded();
	void MediaDimensionsUpdated(float NewWidth, float NewHeight);
	void Destruct();
	void Init(class UMediaSource* InMediaSource, class UObject* InMediaSoundWave, int32 AudioTrack);
	void StopPlaying();
	void Play(bool ShouldRewind);
	void SetDelayedContentValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MovieWidget_C">();
	}
	static class UMovieWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieWidget_C>();
	}
};
static_assert(alignof(UMovieWidget_C) == 0x000008, "Wrong alignment on UMovieWidget_C");
static_assert(sizeof(UMovieWidget_C) == 0x0002A8, "Wrong size on UMovieWidget_C");
static_assert(offsetof(UMovieWidget_C, UberGraphFrame) == 0x000268, "Member 'UMovieWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, Video_Image) == 0x000270, "Member 'UMovieWidget_C::Video_Image' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, Video_ScaleBox) == 0x000278, "Member 'UMovieWidget_C::Video_ScaleBox' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, Shouldloop) == 0x000280, "Member 'UMovieWidget_C::Shouldloop' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, AutoPlay) == 0x000281, "Member 'UMovieWidget_C::AutoPlay' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, MaintainAspectRatio) == 0x000282, "Member 'UMovieWidget_C::MaintainAspectRatio' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, OnMediaReadyToPlay) == 0x000288, "Member 'UMovieWidget_C::OnMediaReadyToPlay' has a wrong offset!");
static_assert(offsetof(UMovieWidget_C, OnMediaFailedToOpen) == 0x000298, "Member 'UMovieWidget_C::OnMediaFailedToOpen' has a wrong offset!");

}

