#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MTXButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MTXButton.MTXButton_C
// 0x0048 (0x0280 - 0x0238)
class UMTXButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                Amount;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button;                                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlus;                                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          LargeSize;                                         // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           NegativeBalanceColor;                              // 0x025C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PositiveBalanceColor;                              // 0x026C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MTXButton(int32 EntryPoint);
	void Destruct();
	void HandleInputActionChnaged(bool bUsingGamepad);
	void BndEvt__VBucksButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Param_Button);
	void HandleLocalAccountInfoChanged(const struct FFortPrivateAccountInfo& NewInfo);
	void Construct();
	void UpdateAmount(struct FFortPrivateAccountInfo& FortPrivateAccountInfo);
	class UWidget* Get_Button_ToolTipWidget_0();
	void UpdateState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MTXButton_C">();
	}
	static class UMTXButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTXButton_C>();
	}
};
static_assert(alignof(UMTXButton_C) == 0x000008, "Wrong alignment on UMTXButton_C");
static_assert(sizeof(UMTXButton_C) == 0x000280, "Wrong size on UMTXButton_C");
static_assert(offsetof(UMTXButton_C, UberGraphFrame) == 0x000238, "Member 'UMTXButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, Amount) == 0x000240, "Member 'UMTXButton_C::Amount' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, Button) == 0x000248, "Member 'UMTXButton_C::Button' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, TextPlus) == 0x000250, "Member 'UMTXButton_C::TextPlus' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, LargeSize) == 0x000258, "Member 'UMTXButton_C::LargeSize' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, NegativeBalanceColor) == 0x00025C, "Member 'UMTXButton_C::NegativeBalanceColor' has a wrong offset!");
static_assert(offsetof(UMTXButton_C, PositiveBalanceColor) == 0x00026C, "Member 'UMTXButton_C::PositiveBalanceColor' has a wrong offset!");

}

