#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCLeaderItemPedestal

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function NPCLeaderItemPedestal.NPCLeaderItemPedestal_C.ExecuteUbergraph_NPCLeaderItemPedestal
// 0x0050 (0x0050 - 0x0000)
struct NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal) == 0x000008, "Wrong alignment on NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal");
static_assert(sizeof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal) == 0x000050, "Wrong size on NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, EntryPoint) == 0x000000, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, K2Node_CustomEvent_NewCamera) == 0x000020, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::K2Node_CustomEvent_NewCamera' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, K2Node_CustomEvent_OldCamera) == 0x000021, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::K2Node_CustomEvent_OldCamera' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_GetContext_ReturnValue1) == 0x000028, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_GetQuestManager_ReturnValue) == 0x000038, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_IsValid_ReturnValue1) == 0x000040, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_HasCompletedQuest_ReturnValue) == 0x000041, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_IsValid_ReturnValue2) == 0x000043, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000048, "Member 'NPCLeaderItemPedestal_C_ExecuteUbergraph_NPCLeaderItemPedestal::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");

// Function NPCLeaderItemPedestal.NPCLeaderItemPedestal_C.CameraChanged
// 0x0002 (0x0002 - 0x0000)
struct NPCLeaderItemPedestal_C_CameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCLeaderItemPedestal_C_CameraChanged) == 0x000001, "Wrong alignment on NPCLeaderItemPedestal_C_CameraChanged");
static_assert(sizeof(NPCLeaderItemPedestal_C_CameraChanged) == 0x000002, "Wrong size on NPCLeaderItemPedestal_C_CameraChanged");
static_assert(offsetof(NPCLeaderItemPedestal_C_CameraChanged, NewCamera) == 0x000000, "Member 'NPCLeaderItemPedestal_C_CameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(NPCLeaderItemPedestal_C_CameraChanged, OldCamera) == 0x000001, "Member 'NPCLeaderItemPedestal_C_CameraChanged::OldCamera' has a wrong offset!");

}

