#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCLeaderItemPedestal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPCLeaderItemPedestal.NPCLeaderItemPedestal_C
// 0x0020 (0x0400 - 0x03E0)
class ANPCLeaderItemPedestal_C final : public AFortItemPreviewPedestal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestToShow;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    HeroItemDefinition;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPCLeaderItemPedestal(int32 EntryPoint);
	void CameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCLeaderItemPedestal_C">();
	}
	static class ANPCLeaderItemPedestal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPCLeaderItemPedestal_C>();
	}
};
static_assert(alignof(ANPCLeaderItemPedestal_C) == 0x000008, "Wrong alignment on ANPCLeaderItemPedestal_C");
static_assert(sizeof(ANPCLeaderItemPedestal_C) == 0x000400, "Wrong size on ANPCLeaderItemPedestal_C");
static_assert(offsetof(ANPCLeaderItemPedestal_C, UberGraphFrame) == 0x0003E0, "Member 'ANPCLeaderItemPedestal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANPCLeaderItemPedestal_C, Arrow) == 0x0003E8, "Member 'ANPCLeaderItemPedestal_C::Arrow' has a wrong offset!");
static_assert(offsetof(ANPCLeaderItemPedestal_C, QuestToShow) == 0x0003F0, "Member 'ANPCLeaderItemPedestal_C::QuestToShow' has a wrong offset!");
static_assert(offsetof(ANPCLeaderItemPedestal_C, HeroItemDefinition) == 0x0003F8, "Member 'ANPCLeaderItemPedestal_C::HeroItemDefinition' has a wrong offset!");

}

