#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineStatusPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OnlineStatusPanel.OnlineStatusPanel_C
// 0x0020 (0x0268 - 0x0248)
class UOnlineStatusPanel_C final : public UFortOnlineStatusPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Opened;                                            // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OnlineStatusPanel(int32 EntryPoint);
	void OnFocused();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OnlineStatusPanel_C">();
	}
	static class UOnlineStatusPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineStatusPanel_C>();
	}
};
static_assert(alignof(UOnlineStatusPanel_C) == 0x000008, "Wrong alignment on UOnlineStatusPanel_C");
static_assert(sizeof(UOnlineStatusPanel_C) == 0x000268, "Wrong size on UOnlineStatusPanel_C");
static_assert(offsetof(UOnlineStatusPanel_C, UberGraphFrame) == 0x000248, "Member 'UOnlineStatusPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOnlineStatusPanel_C, Opened) == 0x000250, "Member 'UOnlineStatusPanel_C::Opened' has a wrong offset!");
static_assert(offsetof(UOnlineStatusPanel_C, Arrow) == 0x000258, "Member 'UOnlineStatusPanel_C::Arrow' has a wrong offset!");
static_assert(offsetof(UOnlineStatusPanel_C, UserActionMenuInputButton) == 0x000260, "Member 'UOnlineStatusPanel_C::UserActionMenuInputButton' has a wrong offset!");

}

