#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuInputDisplayOnly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuInputDisplayOnly.OptionsMenuInputDisplayOnly_C
// 0x0040 (0x0278 - 0x0238)
class UOptionsMenuInputDisplayOnly_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ActionText;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderFrame;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PrimaryKeybindText;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PrimaryKeybindTextSizeBox;                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SecondaryKeybindText;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SecondaryKeybindTextSizeBox;                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OptionsMenuInputDisplayOnly(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

	class UObject* GetListItemObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuInputDisplayOnly_C">();
	}
	static class UOptionsMenuInputDisplayOnly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuInputDisplayOnly_C>();
	}
};
static_assert(alignof(UOptionsMenuInputDisplayOnly_C) == 0x000008, "Wrong alignment on UOptionsMenuInputDisplayOnly_C");
static_assert(sizeof(UOptionsMenuInputDisplayOnly_C) == 0x000278, "Wrong size on UOptionsMenuInputDisplayOnly_C");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, UberGraphFrame) == 0x000238, "Member 'UOptionsMenuInputDisplayOnly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, ActionText) == 0x000240, "Member 'UOptionsMenuInputDisplayOnly_C::ActionText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, BorderFrame) == 0x000248, "Member 'UOptionsMenuInputDisplayOnly_C::BorderFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, CommonBorder_0) == 0x000250, "Member 'UOptionsMenuInputDisplayOnly_C::CommonBorder_0' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, PrimaryKeybindText) == 0x000258, "Member 'UOptionsMenuInputDisplayOnly_C::PrimaryKeybindText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, PrimaryKeybindTextSizeBox) == 0x000260, "Member 'UOptionsMenuInputDisplayOnly_C::PrimaryKeybindTextSizeBox' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, SecondaryKeybindText) == 0x000268, "Member 'UOptionsMenuInputDisplayOnly_C::SecondaryKeybindText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInputDisplayOnly_C, SecondaryKeybindTextSizeBox) == 0x000270, "Member 'UOptionsMenuInputDisplayOnly_C::SecondaryKeybindTextSizeBox' has a wrong offset!");

}

