#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuRowSelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.Selector Button Selected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature final
{
public:
	int32                                         Tab_Id;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature");
static_assert(sizeof(OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature) == 0x000004, "Wrong size on OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature");
static_assert(offsetof(OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature, Tab_Id) == 0x000000, "Member 'OptionsMenuRowSelector_C_Selector_Button_Selected__DelegateSignature::Tab_Id' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.ExecuteUbergraph_OptionsMenuRowSelector
// 0x02B8 (0x02B8 - 0x0000)
struct OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedButtonIndex_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* AssociatedButton, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent1;                          // 0x0078(0x0070)(ConstParm)
	class UCommonButtonGroup*                     CallFunc_SpawnObject_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x00FC(0x0008)(NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0118(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0150(0x0070)(ConstParm)
	class UFortSettingInfo*                       K2Node_DynamicCast_AsFort_Setting_Info;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       K2Node_Event_TooltipTextBlock;                     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue1;                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x01F8(0x0018)(ConstParm)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate1;             // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize1;                 // 0x0230(0x0008)(NoDestructor)
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue2;                // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x1];                                      // 0x0243(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select2_Default;                            // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_AssociatedButton;               // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      CallFunc_Create_ReturnValue1;                      // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetSettingDisplayNames_ReturnValue;       // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0270(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue1;                    // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot1;         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRotatorSettingValue_ReturnValue;       // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue1;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector");
static_assert(sizeof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector) == 0x0002B8, "Wrong size on OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, EntryPoint) == 0x000000, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Create_ReturnValue) == 0x000008, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetSelectedButtonIndex_ReturnValue) == 0x000010, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetSelectedButtonIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_bool_Variable) == 0x000015, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_int_Variable) == 0x000018, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_int_Variable1) == 0x00001C, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x000038, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetContext_ReturnValue1) == 0x000040, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetContext_ReturnValue2) == 0x000048, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_bool_Variable1) == 0x000050, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_int_Variable2) == 0x000054, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Select_Default) == 0x000058, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetButtonAtIndex_ReturnValue) == 0x000060, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetButtonAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_byte_Variable) == 0x000070, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_bIsExpanded) == 0x000071, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_bIsSelected) == 0x000072, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_MouseEvent1) == 0x000078, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_MouseEvent1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_SpawnObject_ReturnValue) == 0x0000E8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_IsDesignTime) == 0x0000F0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_int_Variable3) == 0x0000F4, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Add_IntInt_ReturnValue1) == 0x0000F8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_MakeStruct_SlateChildSize) == 0x0000FC, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_byte_Variable1) == 0x000104, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000108, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00010C, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_IsMobileGame_ReturnValue) == 0x00010D, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_ListItemObject) == 0x000110, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_MyGeometry) == 0x000118, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_MouseEvent) == 0x000150, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_DynamicCast_AsFort_Setting_Info) == 0x0001C0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_DynamicCast_AsFort_Setting_Info' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_K2_SetTimer_ReturnValue) == 0x0001D0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_TextIsEmpty_ReturnValue) == 0x0001D8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Event_TooltipTextBlock) == 0x0001E0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Event_TooltipTextBlock' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetUINavigationManager_ReturnValue) == 0x0001E8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_bool_Variable2) == 0x0001F0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_IsMobileGame_ReturnValue1) == 0x0001F1, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_IsMobileGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Select1_Default) == 0x0001F2, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_text_Variable) == 0x0001F8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_CreateDelegate_OutputDelegate1) == 0x000210, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_byte_Variable2) == 0x000220, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_AddChild_ReturnValue) == 0x000228, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_MakeStruct_SlateChildSize1) == 0x000230, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_MakeStruct_SlateChildSize1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x000238, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_DynamicCast_bSuccess1) == 0x000240, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_byte_Variable3) == 0x000241, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_IsMobileGame_ReturnValue2) == 0x000242, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_IsMobileGame_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Select2_Default) == 0x000244, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_CustomEvent_AssociatedButton) == 0x000248, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_CustomEvent_AssociatedButton' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_CustomEvent_ButtonIndex) == 0x000250, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, Temp_bool_Variable3) == 0x000254, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_Select3_Default) == 0x000255, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Create_ReturnValue1) == 0x000258, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetSettingDisplayNames_ReturnValue) == 0x000260, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetSettingDisplayNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Array_Get_Item) == 0x000270, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Array_Length_ReturnValue) == 0x000288, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_Less_IntInt_ReturnValue) == 0x00028C, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_AddChild_ReturnValue1) == 0x000290, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_AddChild_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_DynamicCast_AsHorizontal_Box_Slot1) == 0x000298, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_DynamicCast_AsHorizontal_Box_Slot1' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_DynamicCast_bSuccess2) == 0x0002A0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_GetRotatorSettingValue_ReturnValue) == 0x0002A4, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_GetRotatorSettingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, K2Node_ComponentBoundEvent_Button) == 0x0002A8, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector, CallFunc_TextIsEmpty_ReturnValue1) == 0x0002B0, "Member 'OptionsMenuRowSelector_C_ExecuteUbergraph_OptionsMenuRowSelector::CallFunc_TextIsEmpty_ReturnValue1' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuRowSelector_C_BndEvt__ButtonTouchTooltip_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.OnSelectedButtonChanged_Event_0
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0 final
{
public:
	class UCommonButton*                          AssociatedButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0");
static_assert(sizeof(OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0) == 0x000010, "Wrong size on OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0");
static_assert(offsetof(OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0, AssociatedButton) == 0x000000, "Member 'OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0::AssociatedButton' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0, ButtonIndex) == 0x000008, "Member 'OptionsMenuRowSelector_C_OnSelectedButtonChanged_Event_0::ButtonIndex' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.UpdateSetting
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuRowSelector_C_UpdateSetting final
{
public:
	class UCommonTextBlock*                       TooltipTextBlock;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_UpdateSetting) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_UpdateSetting");
static_assert(sizeof(OptionsMenuRowSelector_C_UpdateSetting) == 0x000008, "Wrong size on OptionsMenuRowSelector_C_UpdateSetting");
static_assert(offsetof(OptionsMenuRowSelector_C_UpdateSetting, TooltipTextBlock) == 0x000000, "Member 'OptionsMenuRowSelector_C_UpdateSetting::TooltipTextBlock' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct OptionsMenuRowSelector_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuRowSelector_C_OnMouseEnter) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_OnMouseEnter");
static_assert(sizeof(OptionsMenuRowSelector_C_OnMouseEnter) == 0x0000A8, "Wrong size on OptionsMenuRowSelector_C_OnMouseEnter");
static_assert(offsetof(OptionsMenuRowSelector_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'OptionsMenuRowSelector_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'OptionsMenuRowSelector_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuRowSelector_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_OnListItemObjectSet");
static_assert(sizeof(OptionsMenuRowSelector_C_OnListItemObjectSet) == 0x000008, "Wrong size on OptionsMenuRowSelector_C_OnListItemObjectSet");
static_assert(offsetof(OptionsMenuRowSelector_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'OptionsMenuRowSelector_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuRowSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuRowSelector_C_PreConstruct) == 0x000001, "Wrong alignment on OptionsMenuRowSelector_C_PreConstruct");
static_assert(sizeof(OptionsMenuRowSelector_C_PreConstruct) == 0x000001, "Wrong size on OptionsMenuRowSelector_C_PreConstruct");
static_assert(offsetof(OptionsMenuRowSelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OptionsMenuRowSelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct OptionsMenuRowSelector_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuRowSelector_C_OnMouseLeave) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_OnMouseLeave");
static_assert(sizeof(OptionsMenuRowSelector_C_OnMouseLeave) == 0x000070, "Wrong size on OptionsMenuRowSelector_C_OnMouseLeave");
static_assert(offsetof(OptionsMenuRowSelector_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'OptionsMenuRowSelector_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuRowSelector_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuRowSelector_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on OptionsMenuRowSelector_C_BP_OnItemSelectionChanged");
static_assert(sizeof(OptionsMenuRowSelector_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on OptionsMenuRowSelector_C_BP_OnItemSelectionChanged");
static_assert(offsetof(OptionsMenuRowSelector_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'OptionsMenuRowSelector_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuRowSelector_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuRowSelector_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on OptionsMenuRowSelector_C_BP_OnItemExpansionChanged");
static_assert(sizeof(OptionsMenuRowSelector_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on OptionsMenuRowSelector_C_BP_OnItemExpansionChanged");
static_assert(offsetof(OptionsMenuRowSelector_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'OptionsMenuRowSelector_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.Initialize Row Selector
// 0x0048 (0x0048 - 0x0000)
struct OptionsMenuRowSelector_C_Initialize_Row_Selector final
{
public:
	class FText                                   Row_Text;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FText>                           Buttons;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class FText>                           Param_Hover_Texts;                                 // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          Require_Selection;                                 // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Tab_Tooltip;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_Initialize_Row_Selector) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_Initialize_Row_Selector");
static_assert(sizeof(OptionsMenuRowSelector_C_Initialize_Row_Selector) == 0x000048, "Wrong size on OptionsMenuRowSelector_C_Initialize_Row_Selector");
static_assert(offsetof(OptionsMenuRowSelector_C_Initialize_Row_Selector, Row_Text) == 0x000000, "Member 'OptionsMenuRowSelector_C_Initialize_Row_Selector::Row_Text' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_Initialize_Row_Selector, Buttons) == 0x000018, "Member 'OptionsMenuRowSelector_C_Initialize_Row_Selector::Buttons' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_Initialize_Row_Selector, Param_Hover_Texts) == 0x000028, "Member 'OptionsMenuRowSelector_C_Initialize_Row_Selector::Param_Hover_Texts' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_Initialize_Row_Selector, Require_Selection) == 0x000038, "Member 'OptionsMenuRowSelector_C_Initialize_Row_Selector::Require_Selection' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_Initialize_Row_Selector, Tab_Tooltip) == 0x000040, "Member 'OptionsMenuRowSelector_C_Initialize_Row_Selector::Tab_Tooltip' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.Update Row Selector
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenuRowSelector_C_Update_Row_Selector final
{
public:
	int32                                         Tab_Number;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_Update_Row_Selector) == 0x000004, "Wrong alignment on OptionsMenuRowSelector_C_Update_Row_Selector");
static_assert(sizeof(OptionsMenuRowSelector_C_Update_Row_Selector) == 0x000004, "Wrong size on OptionsMenuRowSelector_C_Update_Row_Selector");
static_assert(offsetof(OptionsMenuRowSelector_C_Update_Row_Selector, Tab_Number) == 0x000000, "Member 'OptionsMenuRowSelector_C_Update_Row_Selector::Tab_Number' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.Button Hovered
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuRowSelector_C_Button_Hovered final
{
public:
	class UCommonButton*                          Param_Button_Hovered;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_Button_Hovered) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_Button_Hovered");
static_assert(sizeof(OptionsMenuRowSelector_C_Button_Hovered) == 0x000008, "Wrong size on OptionsMenuRowSelector_C_Button_Hovered");
static_assert(offsetof(OptionsMenuRowSelector_C_Button_Hovered, Param_Button_Hovered) == 0x000000, "Member 'OptionsMenuRowSelector_C_Button_Hovered::Param_Button_Hovered' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.DisableOption
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenuRowSelector_C_DisableOption final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_DisableOption) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_DisableOption");
static_assert(sizeof(OptionsMenuRowSelector_C_DisableOption) == 0x000028, "Wrong size on OptionsMenuRowSelector_C_DisableOption");
static_assert(offsetof(OptionsMenuRowSelector_C_DisableOption, OptionIndex) == 0x000000, "Member 'OptionsMenuRowSelector_C_DisableOption::OptionIndex' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_DisableOption, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'OptionsMenuRowSelector_C_DisableOption::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_DisableOption, CallFunc_GetButtonAtIndex_ReturnValue) == 0x000020, "Member 'OptionsMenuRowSelector_C_DisableOption::CallFunc_GetButtonAtIndex_ReturnValue' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.On Get Menu Content
// 0x0018 (0x0018 - 0x0000)
struct OptionsMenuRowSelector_C_On_Get_Menu_Content final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipMinusBasicMinusS_C*             CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_On_Get_Menu_Content) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_On_Get_Menu_Content");
static_assert(sizeof(OptionsMenuRowSelector_C_On_Get_Menu_Content) == 0x000018, "Wrong size on OptionsMenuRowSelector_C_On_Get_Menu_Content");
static_assert(offsetof(OptionsMenuRowSelector_C_On_Get_Menu_Content, ReturnValue) == 0x000000, "Member 'OptionsMenuRowSelector_C_On_Get_Menu_Content::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_On_Get_Menu_Content, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'OptionsMenuRowSelector_C_On_Get_Menu_Content::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuRowSelector_C_On_Get_Menu_Content, CallFunc_Create_ReturnValue) == 0x000010, "Member 'OptionsMenuRowSelector_C_On_Get_Menu_Content::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.Set Selection Required
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuRowSelector_C_Set_Selection_Required final
{
public:
	bool                                          Selection_Required;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuRowSelector_C_Set_Selection_Required) == 0x000001, "Wrong alignment on OptionsMenuRowSelector_C_Set_Selection_Required");
static_assert(sizeof(OptionsMenuRowSelector_C_Set_Selection_Required) == 0x000001, "Wrong size on OptionsMenuRowSelector_C_Set_Selection_Required");
static_assert(offsetof(OptionsMenuRowSelector_C_Set_Selection_Required, Selection_Required) == 0x000000, "Member 'OptionsMenuRowSelector_C_Set_Selection_Required::Selection_Required' has a wrong offset!");

// Function OptionsMenuRowSelector.OptionsMenuRowSelector_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuRowSelector_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuRowSelector_C_GetListItemObject) == 0x000008, "Wrong alignment on OptionsMenuRowSelector_C_GetListItemObject");
static_assert(sizeof(OptionsMenuRowSelector_C_GetListItemObject) == 0x000008, "Wrong size on OptionsMenuRowSelector_C_GetListItemObject");
static_assert(offsetof(OptionsMenuRowSelector_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'OptionsMenuRowSelector_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

