#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuInput

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenuInput.OptionsMenuInput_C.Input Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_Input_Clicked__DelegateSignature final
{
public:
	int32                                         Param_Number_in_List;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Primary_Button;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuInput_C_Input_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on OptionsMenuInput_C_Input_Clicked__DelegateSignature");
static_assert(sizeof(OptionsMenuInput_C_Input_Clicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuInput_C_Input_Clicked__DelegateSignature");
static_assert(offsetof(OptionsMenuInput_C_Input_Clicked__DelegateSignature, Param_Number_in_List) == 0x000000, "Member 'OptionsMenuInput_C_Input_Clicked__DelegateSignature::Param_Number_in_List' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_Input_Clicked__DelegateSignature, Is_Primary_Button) == 0x000004, "Member 'OptionsMenuInput_C_Input_Clicked__DelegateSignature::Is_Primary_Button' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.UnbindClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenuInput_C_UnbindClicked__DelegateSignature final
{
public:
	int32                                         Param_Number_in_List;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsMenuInput_C*                    Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_UnbindClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuInput_C_UnbindClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuInput_C_UnbindClicked__DelegateSignature) == 0x000010, "Wrong size on OptionsMenuInput_C_UnbindClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuInput_C_UnbindClicked__DelegateSignature, Param_Number_in_List) == 0x000000, "Member 'OptionsMenuInput_C_UnbindClicked__DelegateSignature::Param_Number_in_List' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_UnbindClicked__DelegateSignature, Widget) == 0x000008, "Member 'OptionsMenuInput_C_UnbindClicked__DelegateSignature::Widget' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.ExecuteUbergraph_OptionsMenuInput
// 0x01C0 (0x01C0 - 0x0000)
struct OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsMenuInputData*              K2Node_DynamicCast_AsFort_Options_Menu_Input_Data; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	struct FPointerEvent                          K2Node_Event_MouseEvent1;                          // 0x0088(0x0070)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0130(0x0070)(ConstParm)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput) == 0x000008, "Wrong alignment on OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput");
static_assert(sizeof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput) == 0x0001C0, "Wrong size on OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, EntryPoint) == 0x000000, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_Event_ListItemObject) == 0x000008, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_DynamicCast_AsFort_Options_Menu_Input_Data) == 0x000010, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_DynamicCast_AsFort_Options_Menu_Input_Data' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_MakeArray_Array) == 0x000060, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, CallFunc_Format_ReturnValue) == 0x000070, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_Event_MouseEvent1) == 0x000088, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_Event_MouseEvent1' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_Event_MyGeometry) == 0x0000F8, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_Event_MouseEvent) == 0x000130, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_ComponentBoundEvent_Button2) == 0x0001A0, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_ComponentBoundEvent_Button1) == 0x0001A8, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_ComponentBoundEvent_Button) == 0x0001B0, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_Event_bIsSelected) == 0x0001B8, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput, K2Node_Event_bIsExpanded) == 0x0001B9, "Member 'OptionsMenuInput_C_ExecuteUbergraph_OptionsMenuInput::K2Node_Event_bIsExpanded' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuInput_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuInput_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on OptionsMenuInput_C_BP_OnItemExpansionChanged");
static_assert(sizeof(OptionsMenuInput_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on OptionsMenuInput_C_BP_OnItemExpansionChanged");
static_assert(offsetof(OptionsMenuInput_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'OptionsMenuInput_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenuInput_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenuInput_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on OptionsMenuInput_C_BP_OnItemSelectionChanged");
static_assert(sizeof(OptionsMenuInput_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on OptionsMenuInput_C_BP_OnItemSelectionChanged");
static_assert(offsetof(OptionsMenuInput_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'OptionsMenuInput_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuInput_C_BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuInput_C_BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenuInput_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct OptionsMenuInput_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuInput_C_OnMouseEnter) == 0x000008, "Wrong alignment on OptionsMenuInput_C_OnMouseEnter");
static_assert(sizeof(OptionsMenuInput_C_OnMouseEnter) == 0x0000A8, "Wrong size on OptionsMenuInput_C_OnMouseEnter");
static_assert(offsetof(OptionsMenuInput_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'OptionsMenuInput_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'OptionsMenuInput_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct OptionsMenuInput_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OptionsMenuInput_C_OnMouseLeave) == 0x000008, "Wrong alignment on OptionsMenuInput_C_OnMouseLeave");
static_assert(sizeof(OptionsMenuInput_C_OnMouseLeave) == 0x000070, "Wrong size on OptionsMenuInput_C_OnMouseLeave");
static_assert(offsetof(OptionsMenuInput_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'OptionsMenuInput_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on OptionsMenuInput_C_OnListItemObjectSet");
static_assert(sizeof(OptionsMenuInput_C_OnListItemObjectSet) == 0x000008, "Wrong size on OptionsMenuInput_C_OnListItemObjectSet");
static_assert(offsetof(OptionsMenuInput_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'OptionsMenuInput_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.Center on Widget
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_Center_on_Widget final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_Center_on_Widget) == 0x000008, "Wrong alignment on OptionsMenuInput_C_Center_on_Widget");
static_assert(sizeof(OptionsMenuInput_C_Center_on_Widget) == 0x000008, "Wrong size on OptionsMenuInput_C_Center_on_Widget");
static_assert(offsetof(OptionsMenuInput_C_Center_on_Widget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'OptionsMenuInput_C_Center_on_Widget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.Change Key
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenuInput_C_Change_Key final
{
public:
	bool                                          Primary_Key;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Key_To_Sets;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(OptionsMenuInput_C_Change_Key) == 0x000008, "Wrong alignment on OptionsMenuInput_C_Change_Key");
static_assert(sizeof(OptionsMenuInput_C_Change_Key) == 0x000020, "Wrong size on OptionsMenuInput_C_Change_Key");
static_assert(offsetof(OptionsMenuInput_C_Change_Key, Primary_Key) == 0x000000, "Member 'OptionsMenuInput_C_Change_Key::Primary_Key' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_Change_Key, Key_To_Sets) == 0x000008, "Member 'OptionsMenuInput_C_Change_Key::Key_To_Sets' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.SetClearButtonVisibility
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenuInput_C_SetClearButtonVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue1;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_SetClearButtonVisibility) == 0x000008, "Wrong alignment on OptionsMenuInput_C_SetClearButtonVisibility");
static_assert(sizeof(OptionsMenuInput_C_SetClearButtonVisibility) == 0x000028, "Wrong size on OptionsMenuInput_C_SetClearButtonVisibility");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, Temp_byte_Variable1) == 0x000002, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000020, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, CallFunc_EqualEqual_TextText_ReturnValue1) == 0x000021, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::CallFunc_EqualEqual_TextText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenuInput_C_SetClearButtonVisibility, K2Node_Select_Default) == 0x000023, "Member 'OptionsMenuInput_C_SetClearButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenuInput.OptionsMenuInput_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenuInput_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenuInput_C_GetListItemObject) == 0x000008, "Wrong alignment on OptionsMenuInput_C_GetListItemObject");
static_assert(sizeof(OptionsMenuInput_C_GetListItemObject) == 0x000008, "Wrong size on OptionsMenuInput_C_GetListItemObject");
static_assert(offsetof(OptionsMenuInput_C_GetListItemObject, ReturnValue) == 0x000000, "Member 'OptionsMenuInput_C_GetListItemObject::ReturnValue' has a wrong offset!");

}

