#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuHudRotator

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuHudRotator.OptionsMenuHudRotator_C
// 0x0078 (0x02B0 - 0x0238)
class UOptionsMenuHudRotator_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ButtonLeft;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonRight;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DisplayText;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            MenuAnchorSettingDescription;                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextRotator_C*                         TextRotator;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HoverText;                                         // 0x0270(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   Selection_Changed;                                 // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonTextBlock*                       Tab_Tooltip_Text;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Gameplay_Tag;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TooltipTimer;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Selection_Changed__DelegateSignature(int32 Selected_Index, const struct FGameplayTag& Param_Gameplay_Tag);
	void ExecuteUbergraph_OptionsMenuHudRotator(int32 EntryPoint);
	void BndEvt__ButtonRight_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BndEvt__TextRotator_K2Node_ComponentBoundEvent_5_OnRotated__DelegateSignature(int32 Value);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void Update_Row_Selector(int32 Currently_Selected);
	void Center_on_Widget();
	void Update_Options(TArray<class FText>& NewParam);
	void UpdateSize();
	class UWidget* OnGetMenuContent();
	void ShowTooltip();

	class UObject* GetListItemObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuHudRotator_C">();
	}
	static class UOptionsMenuHudRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuHudRotator_C>();
	}
};
static_assert(alignof(UOptionsMenuHudRotator_C) == 0x000008, "Wrong alignment on UOptionsMenuHudRotator_C");
static_assert(sizeof(UOptionsMenuHudRotator_C) == 0x0002B0, "Wrong size on UOptionsMenuHudRotator_C");
static_assert(offsetof(UOptionsMenuHudRotator_C, UberGraphFrame) == 0x000238, "Member 'UOptionsMenuHudRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, ButtonLeft) == 0x000240, "Member 'UOptionsMenuHudRotator_C::ButtonLeft' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, ButtonRight) == 0x000248, "Member 'UOptionsMenuHudRotator_C::ButtonRight' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, DisplayText) == 0x000250, "Member 'UOptionsMenuHudRotator_C::DisplayText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, MenuAnchorSettingDescription) == 0x000258, "Member 'UOptionsMenuHudRotator_C::MenuAnchorSettingDescription' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, TextRotator) == 0x000260, "Member 'UOptionsMenuHudRotator_C::TextRotator' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, SelectedIndex) == 0x000268, "Member 'UOptionsMenuHudRotator_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, HoverText) == 0x000270, "Member 'UOptionsMenuHudRotator_C::HoverText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, Selection_Changed) == 0x000288, "Member 'UOptionsMenuHudRotator_C::Selection_Changed' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, Tab_Tooltip_Text) == 0x000298, "Member 'UOptionsMenuHudRotator_C::Tab_Tooltip_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, Gameplay_Tag) == 0x0002A0, "Member 'UOptionsMenuHudRotator_C::Gameplay_Tag' has a wrong offset!");
static_assert(offsetof(UOptionsMenuHudRotator_C, TooltipTimer) == 0x0002A8, "Member 'UOptionsMenuHudRotator_C::TooltipTimer' has a wrong offset!");

}

