#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_BuildingPropActor

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Parent_BuildingPropActor.Parent_BuildingPropActor_C.ExecuteUbergraph_Parent_BuildingPropActor
// 0x0480 (0x0480 - 0x0000)
struct Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 Temp_byte_Variable;                                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 CallFunc_GetPreviousDayPhase_ReturnValue;          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable1;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue2;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetPreviousDayPhase_ReturnValue1;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue1;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue2;    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue1;             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue2;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBuildingMeshComponent_ReturnValue3;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue3;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue3;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetPreviousDayPhase_ReturnValue2;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue1;          // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetPreviousDayPhase_ReturnValue3;         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue3; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable2;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue2;          // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetPreviousDayPhase_ReturnValue4;         // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue3;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable3;                               // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue4; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue5; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable3;                              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue4;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable4;                               // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable5;                               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue3;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable4;                              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable6;                               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable5;                              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue6; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetPreviousDayPhase_ReturnValue5;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue5;          // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable7;                               // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable6;                              // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetAnimatingMID_ReturnValue4;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 CallFunc_GetCurrentDayPhase_ReturnValue6;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	EFortDayPhase                                 Temp_byte_Variable8;                               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 K2Node_Event_CurrentDayPhase;                      // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_PreviousDayPhase;                     // 0x01CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAtCreation;                          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 Temp_byte_Variable9;                               // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable10;                              // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item1;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select3_Default;                            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select4_Default;                            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue1;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item2;                          // 0x01FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x020C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue1;   // 0x021C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item3;                          // 0x022C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue2;   // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item4;                          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item5;                          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select5_Default;                            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select6_Default;                            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select7_Default;                            // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select8_Default;                            // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select9_Default;                            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select10_Default;                           // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item6;                          // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue3;   // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue4;   // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable11;                              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortBounceData                        K2Node_Event_Data;                                 // 0x02C4(0x0030)(NoDestructor)
	float                                         K2Node_Select11_Default;                           // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue4;                        // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R1;                            // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G1;                            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B1;                            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A1;                            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue4;             // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue4;            // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_397[0x1];                                      // 0x0397(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 Temp_byte_Variable12;                              // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select12_Default;                           // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item7;                          // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item8;                          // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item9;                          // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item10;                         // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x03F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Array_Get_Item11;                         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor) == 0x000008, "Wrong alignment on Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor");
static_assert(sizeof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor) == 0x000480, "Wrong size on Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, EntryPoint) == 0x000000, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Variable) == 0x000008, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000010, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetAnimatingMID_ReturnValue) == 0x000018, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetAnimatingMID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Add_IntInt_ReturnValue1) == 0x00002C, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Array_Index_Variable) == 0x000030, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Array_Index_Variable1) == 0x000034, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Variable1) == 0x000038, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetAnimatingMID_ReturnValue1) == 0x000040, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetAnimatingMID_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Add_IntInt_ReturnValue2) == 0x000048, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsDedicatedServer_ReturnValue) == 0x00004C, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_byte_Variable) == 0x00004D, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_float_Variable) == 0x000050, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue1) == 0x000058, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetBuildingMeshComponent_ReturnValue) == 0x000060, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetBuildingMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsValid_ReturnValue1) == 0x000068, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetNumMaterials_ReturnValue) == 0x00006C, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetPreviousDayPhase_ReturnValue) == 0x000075, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetPreviousDayPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_float_Variable1) == 0x000078, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Loop_Counter_Variable1) == 0x00007C, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Add_IntInt_ReturnValue3) == 0x000080, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Variable2) == 0x000084, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_byte_Variable1) == 0x000088, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetAnimatingMID_ReturnValue2) == 0x000090, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetAnimatingMID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Add_IntInt_ReturnValue4) == 0x000098, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetPreviousDayPhase_ReturnValue1) == 0x00009C, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetPreviousDayPhase_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetCurrentDayPhase_ReturnValue) == 0x00009D, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetCurrentDayPhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetBuildingMeshComponent_ReturnValue1) == 0x0000A0, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetBuildingMeshComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetBuildingMeshComponent_ReturnValue2) == 0x0000A8, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetBuildingMeshComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetNumMaterials_ReturnValue1) == 0x0000B0, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetNumMaterials_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetNumMaterials_ReturnValue2) == 0x0000B4, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetNumMaterials_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Subtract_IntInt_ReturnValue1) == 0x0000B8, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Subtract_IntInt_ReturnValue2) == 0x0000BC, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetBuildingMeshComponent_ReturnValue3) == 0x0000C0, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetBuildingMeshComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x0000C8, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetNumMaterials_ReturnValue3) == 0x0000CC, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetNumMaterials_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Subtract_IntInt_ReturnValue3) == 0x0000D0, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Subtract_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2) == 0x0000D8, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetPreviousDayPhase_ReturnValue2) == 0x0000E0, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetPreviousDayPhase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsValid_ReturnValue2) == 0x0000E1, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Array_Index_Variable2) == 0x0000E4, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Loop_Counter_Variable2) == 0x0000E8, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetCurrentDayPhase_ReturnValue1) == 0x0000EC, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetCurrentDayPhase_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_Add_IntInt_ReturnValue5) == 0x0000F0, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetPreviousDayPhase_ReturnValue3) == 0x0000F4, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetPreviousDayPhase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue3) == 0x0000F8, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_byte_Variable2) == 0x000100, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsValid_ReturnValue3) == 0x000101, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetCurrentDayPhase_ReturnValue2) == 0x000102, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetCurrentDayPhase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetPreviousDayPhase_ReturnValue4) == 0x000103, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetPreviousDayPhase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetCurrentDayPhase_ReturnValue3) == 0x000104, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetCurrentDayPhase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_byte_Variable3) == 0x000105, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue4) == 0x000108, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsValid_ReturnValue4) == 0x000110, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue5) == 0x000118, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_float_Variable2) == 0x000120, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_IsValid_ReturnValue5) == 0x000124, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_float_Variable3) == 0x000128, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetCurrentDayPhase_ReturnValue4) == 0x00012C, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetCurrentDayPhase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_byte_Variable4) == 0x00012D, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000130, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor, Temp_int_Variable3) == 0x000134, "Member 'Parent_BuildingPropActor_C_ExecuteUbergraph_Parent_BuildingPropActor::Temp_int_Variable3' has a wrong offset!");
