#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartySuggestionButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PartySuggestionButton.PartySuggestionButton_C.ExecuteUbergraph_PartySuggestionButton
// 0x0118 (0x0118 - 0x0000)
struct PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue3;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue4;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FloatSpringInterp_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_Select1_Default;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select2_Default;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select3_Default;                            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyInProgressEnabled_ReturnValue;     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Event_LFGTime;                              // 0x00E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInvited;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsPlaying;                           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_DateTimeDateTime_ReturnValue;    // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue5;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue2;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton) == 0x000008, "Wrong alignment on PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton");
static_assert(sizeof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton) == 0x000118, "Wrong size on PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, EntryPoint) == 0x000000, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_bool_Variable) == 0x000004, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_bool_Variable1) == 0x000005, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_bool_Variable2) == 0x000006, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_float_Variable) == 0x000008, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_bool_Variable3) == 0x00000C, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_struct_Variable) == 0x000010, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, Temp_struct_Variable1) == 0x000020, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_DateTimeMinValue_ReturnValue) == 0x000038, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_PlayAnimation_ReturnValue1) == 0x000040, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000048, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_PlayAnimation_ReturnValue2) == 0x000050, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000058, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Select_Default) == 0x00005C, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_PlayAnimation_ReturnValue3) == 0x000060, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_PlayAnimation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Event_MyGeometry) == 0x000068, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Event_InDeltaTime) == 0x0000A0, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A4, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_PlayAnimation_ReturnValue4) == 0x0000A8, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_PlayAnimation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000B0, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_BooleanAND_ReturnValue) == 0x0000B4, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_FloatSpringInterp_ReturnValue) == 0x0000B8, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_FloatSpringInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Select1_Default) == 0x0000C0, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Select2_Default) == 0x0000C8, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Select3_Default) == 0x0000D0, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_IsPartyInProgressEnabled_ReturnValue) == 0x0000E0, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_IsPartyInProgressEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Event_LFGTime) == 0x0000E8, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Event_LFGTime' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Event_bIsInvited) == 0x0000F0, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Event_bIsInvited' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_Event_bIsPlaying) == 0x0000F1, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_Event_bIsPlaying' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_BooleanAND_ReturnValue1) == 0x0000F2, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_NotEqual_DateTimeDateTime_ReturnValue) == 0x0000F3, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_NotEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_IsVisible_ReturnValue) == 0x0000F4, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_IsAnimationPlaying_ReturnValue1) == 0x0000F5, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_IsAnimationPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_PlayAnimation_ReturnValue5) == 0x000108, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_PlayAnimation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton, CallFunc_IsAnimationPlaying_ReturnValue2) == 0x000110, "Member 'PartySuggestionButton_C_ExecuteUbergraph_PartySuggestionButton::CallFunc_IsAnimationPlaying_ReturnValue2' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.OnDisplayInfoUpdated
// 0x0010 (0x0010 - 0x0000)
struct PartySuggestionButton_C_OnDisplayInfoUpdated final
{
public:
	struct FDateTime                              LFGTime;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInvited;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlaying;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartySuggestionButton_C_OnDisplayInfoUpdated) == 0x000008, "Wrong alignment on PartySuggestionButton_C_OnDisplayInfoUpdated");
static_assert(sizeof(PartySuggestionButton_C_OnDisplayInfoUpdated) == 0x000010, "Wrong size on PartySuggestionButton_C_OnDisplayInfoUpdated");
static_assert(offsetof(PartySuggestionButton_C_OnDisplayInfoUpdated, LFGTime) == 0x000000, "Member 'PartySuggestionButton_C_OnDisplayInfoUpdated::LFGTime' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_OnDisplayInfoUpdated, bIsInvited) == 0x000008, "Member 'PartySuggestionButton_C_OnDisplayInfoUpdated::bIsInvited' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_OnDisplayInfoUpdated, bIsPlaying) == 0x000009, "Member 'PartySuggestionButton_C_OnDisplayInfoUpdated::bIsPlaying' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct PartySuggestionButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_Tick) == 0x000004, "Wrong alignment on PartySuggestionButton_C_Tick");
static_assert(sizeof(PartySuggestionButton_C_Tick) == 0x00003C, "Wrong size on PartySuggestionButton_C_Tick");
static_assert(offsetof(PartySuggestionButton_C_Tick, MyGeometry) == 0x000000, "Member 'PartySuggestionButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_Tick, InDeltaTime) == 0x000038, "Member 'PartySuggestionButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.InitPhysAnim
// 0x0010 (0x0010 - 0x0000)
struct PartySuggestionButton_C_InitPhysAnim final
{
public:
	struct FFloatSpringState                      K2Node_MakeStruct_FloatSpringState;                // 0x0000(0x0008)(NoDestructor)
	struct FFloatSpringState                      K2Node_MakeStruct_FloatSpringState1;               // 0x0008(0x0008)(NoDestructor)
};
static_assert(alignof(PartySuggestionButton_C_InitPhysAnim) == 0x000004, "Wrong alignment on PartySuggestionButton_C_InitPhysAnim");
static_assert(sizeof(PartySuggestionButton_C_InitPhysAnim) == 0x000010, "Wrong size on PartySuggestionButton_C_InitPhysAnim");
static_assert(offsetof(PartySuggestionButton_C_InitPhysAnim, K2Node_MakeStruct_FloatSpringState) == 0x000000, "Member 'PartySuggestionButton_C_InitPhysAnim::K2Node_MakeStruct_FloatSpringState' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_InitPhysAnim, K2Node_MakeStruct_FloatSpringState1) == 0x000008, "Member 'PartySuggestionButton_C_InitPhysAnim::K2Node_MakeStruct_FloatSpringState1' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.SetMainMIDs
// 0x0068 (0x0068 - 0x0000)
struct PartySuggestionButton_C_SetMainMIDs final
{
public:
	class UMaterialInstanceDynamic*               BorderMID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TailMID;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SparklesMID;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LC_Cur_Border_L;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LC_CurBorder_R;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurMIDScalar_ShapeChange;                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue1;  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartySuggestionButton_C_SetMainMIDs) == 0x000008, "Wrong alignment on PartySuggestionButton_C_SetMainMIDs");
static_assert(sizeof(PartySuggestionButton_C_SetMainMIDs) == 0x000068, "Wrong size on PartySuggestionButton_C_SetMainMIDs");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, BorderMID) == 0x000000, "Member 'PartySuggestionButton_C_SetMainMIDs::BorderMID' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, TailMID) == 0x000008, "Member 'PartySuggestionButton_C_SetMainMIDs::TailMID' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, SparklesMID) == 0x000010, "Member 'PartySuggestionButton_C_SetMainMIDs::SparklesMID' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, LC_Cur_Border_L) == 0x000018, "Member 'PartySuggestionButton_C_SetMainMIDs::LC_Cur_Border_L' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, LC_CurBorder_R) == 0x000028, "Member 'PartySuggestionButton_C_SetMainMIDs::LC_CurBorder_R' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CurMIDScalar_ShapeChange) == 0x000038, "Member 'PartySuggestionButton_C_SetMainMIDs::CurMIDScalar_ShapeChange' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000040, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_K2_GetVectorParameterValue_ReturnValue1) == 0x000050, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_K2_GetVectorParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_IsValid_ReturnValue1) == 0x000060, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetMainMIDs, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000064, "Member 'PartySuggestionButton_C_SetMainMIDs::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");

// Function PartySuggestionButton.PartySuggestionButton_C.SetupMIDReferences
// 0x0040 (0x0040 - 0x0000)
struct PartySuggestionButton_C_SetupMIDReferences final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue3; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue4; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartySuggestionButton_C_SetupMIDReferences) == 0x000008, "Wrong alignment on PartySuggestionButton_C_SetupMIDReferences");
static_assert(sizeof(PartySuggestionButton_C_SetupMIDReferences) == 0x000040, "Wrong size on PartySuggestionButton_C_SetupMIDReferences");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartySuggestionButton_C_SetupMIDReferences, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'PartySuggestionButton_C_SetupMIDReferences::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
