#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCB_InfoPannel

#include "Basic.hpp"


namespace SDK::Params
{

// Function PCB_InfoPannel.PCB_InfoPannel_C.ExecuteUbergraph_PCB_InfoPannel
// 0x0038 (0x0038 - 0x0000)
struct PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPCBHeader_ReturnValue;                 // 0x0008(0x0018)()
	class FText                                   CallFunc_GetPCBDescription_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel) == 0x000008, "Wrong alignment on PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel");
static_assert(sizeof(PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel) == 0x000038, "Wrong size on PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel");
static_assert(offsetof(PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel, EntryPoint) == 0x000000, "Member 'PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel::EntryPoint' has a wrong offset!");
static_assert(offsetof(PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel, CallFunc_GetPCBHeader_ReturnValue) == 0x000008, "Member 'PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel::CallFunc_GetPCBHeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel, CallFunc_GetPCBDescription_ReturnValue) == 0x000020, "Member 'PCB_InfoPannel_C_ExecuteUbergraph_PCB_InfoPannel::CallFunc_GetPCBDescription_ReturnValue' has a wrong offset!");

}

