#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCB_InfoPannel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PCB_InfoPannel.PCB_InfoPannel_C
// 0x0068 (0x02D0 - 0x0268)
class UPCB_InfoPannel_C final : public UFortPCBInfoPannel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BoltL;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoltR;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CrownGlow;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HandGlow;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderGlow;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGlow;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PCBIcon;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Body;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PCB_InfoPannel(int32 EntryPoint);
	void CmsDataRead();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PCB_InfoPannel_C">();
	}
	static class UPCB_InfoPannel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCB_InfoPannel_C>();
	}
};
static_assert(alignof(UPCB_InfoPannel_C) == 0x000008, "Wrong alignment on UPCB_InfoPannel_C");
static_assert(sizeof(UPCB_InfoPannel_C) == 0x0002D0, "Wrong size on UPCB_InfoPannel_C");
static_assert(offsetof(UPCB_InfoPannel_C, UberGraphFrame) == 0x000268, "Member 'UPCB_InfoPannel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, BoltL) == 0x000270, "Member 'UPCB_InfoPannel_C::BoltL' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, BoltR) == 0x000278, "Member 'UPCB_InfoPannel_C::BoltR' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, Border) == 0x000280, "Member 'UPCB_InfoPannel_C::Border' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, CrownGlow) == 0x000288, "Member 'UPCB_InfoPannel_C::CrownGlow' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, HandGlow) == 0x000290, "Member 'UPCB_InfoPannel_C::HandGlow' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, HeaderGlow) == 0x000298, "Member 'UPCB_InfoPannel_C::HeaderGlow' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, IconGlow) == 0x0002A0, "Member 'UPCB_InfoPannel_C::IconGlow' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, Image_9) == 0x0002A8, "Member 'UPCB_InfoPannel_C::Image_9' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, Image_10) == 0x0002B0, "Member 'UPCB_InfoPannel_C::Image_10' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, PCBIcon) == 0x0002B8, "Member 'UPCB_InfoPannel_C::PCBIcon' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, Text_Body) == 0x0002C0, "Member 'UPCB_InfoPannel_C::Text_Body' has a wrong offset!");
static_assert(offsetof(UPCB_InfoPannel_C, Text_Header) == 0x0002C8, "Member 'UPCB_InfoPannel_C::Text_Header' has a wrong offset!");

}

