#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkSystemOptInHelpScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkSystemOptInHelpScreen.PerkSystemOptInHelpScreen_C
// 0x0080 (0x02B8 - 0x0238)
class UPerkSystemOptInHelpScreen_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               AcceptChanges;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButonCancel;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButonContinue;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonAccept;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonCancelPreview;                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonDonotshow;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonInfo;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Empty;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageCheckmark;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OptinInfo;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  OptinSwitcher;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxHelpText;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ViewMode;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Override_State;                                    // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Override_Value;                                    // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PerkSystemOptInHelpScreen(int32 EntryPoint);
	void BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature(class UCommonButton* Button, bool Selected);
	void Construct();
	void SetMode(int32 Mode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkSystemOptInHelpScreen_C">();
	}
	static class UPerkSystemOptInHelpScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkSystemOptInHelpScreen_C>();
	}
};
static_assert(alignof(UPerkSystemOptInHelpScreen_C) == 0x000008, "Wrong alignment on UPerkSystemOptInHelpScreen_C");
static_assert(sizeof(UPerkSystemOptInHelpScreen_C) == 0x0002B8, "Wrong size on UPerkSystemOptInHelpScreen_C");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, UberGraphFrame) == 0x000238, "Member 'UPerkSystemOptInHelpScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, AcceptChanges) == 0x000240, "Member 'UPerkSystemOptInHelpScreen_C::AcceptChanges' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ButonCancel) == 0x000248, "Member 'UPerkSystemOptInHelpScreen_C::ButonCancel' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ButonContinue) == 0x000250, "Member 'UPerkSystemOptInHelpScreen_C::ButonContinue' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ButtonAccept) == 0x000258, "Member 'UPerkSystemOptInHelpScreen_C::ButtonAccept' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ButtonCancelPreview) == 0x000260, "Member 'UPerkSystemOptInHelpScreen_C::ButtonCancelPreview' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ButtonDonotshow) == 0x000268, "Member 'UPerkSystemOptInHelpScreen_C::ButtonDonotshow' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ButtonInfo) == 0x000270, "Member 'UPerkSystemOptInHelpScreen_C::ButtonInfo' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, Empty) == 0x000278, "Member 'UPerkSystemOptInHelpScreen_C::Empty' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ImageCheckmark) == 0x000280, "Member 'UPerkSystemOptInHelpScreen_C::ImageCheckmark' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, Lightbox) == 0x000288, "Member 'UPerkSystemOptInHelpScreen_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, OptinInfo) == 0x000290, "Member 'UPerkSystemOptInHelpScreen_C::OptinInfo' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, OptinSwitcher) == 0x000298, "Member 'UPerkSystemOptInHelpScreen_C::OptinSwitcher' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ScrollBoxHelpText) == 0x0002A0, "Member 'UPerkSystemOptInHelpScreen_C::ScrollBoxHelpText' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, ViewMode) == 0x0002A8, "Member 'UPerkSystemOptInHelpScreen_C::ViewMode' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, Override_State) == 0x0002AC, "Member 'UPerkSystemOptInHelpScreen_C::Override_State' has a wrong offset!");
static_assert(offsetof(UPerkSystemOptInHelpScreen_C, Override_Value) == 0x0002B0, "Member 'UPerkSystemOptInHelpScreen_C::Override_Value' has a wrong offset!");

}

