#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkSystemOptInHelpScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PerkSystemOptInHelpScreen.PerkSystemOptInHelpScreen_C.ExecuteUbergraph_PerkSystemOptInHelpScreen
// 0x0048 (0x0048 - 0x0000)
struct PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHidePerkRecombobulatorHelp_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen) == 0x000008, "Wrong alignment on PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen");
static_assert(sizeof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen) == 0x000048, "Wrong size on PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, EntryPoint) == 0x000000, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, Temp_bool_Variable) == 0x000004, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, Temp_byte_Variable) == 0x000005, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, Temp_bool_Variable1) == 0x000006, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, Temp_byte_Variable1) == 0x000007, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, Temp_byte_Variable2) == 0x000008, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, CallFunc_GetContext_ReturnValue1) == 0x000018, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, CallFunc_GetHidePerkRecombobulatorHelp_ReturnValue) == 0x000020, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::CallFunc_GetHidePerkRecombobulatorHelp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, K2Node_Select_Default) == 0x000021, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, K2Node_ComponentBoundEvent_Button1) == 0x000028, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, K2Node_ComponentBoundEvent_Selected) == 0x000030, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, Temp_byte_Variable3) == 0x000040, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen, K2Node_Select1_Default) == 0x000041, "Member 'PerkSystemOptInHelpScreen_C_ExecuteUbergraph_PerkSystemOptInHelpScreen::K2Node_Select1_Default' has a wrong offset!");

// Function PerkSystemOptInHelpScreen.PerkSystemOptInHelpScreen_C.BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PerkSystemOptInHelpScreen_C_BndEvt__ButtonInfo_K2Node_ComponentBoundEvent_177_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PerkSystemOptInHelpScreen.PerkSystemOptInHelpScreen_C.BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature");
static_assert(sizeof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature) == 0x000010, "Wrong size on PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature, Selected) == 0x000008, "Member 'PerkSystemOptInHelpScreen_C_BndEvt__ButtonDonotshow_K2Node_ComponentBoundEvent_225_CommonSelectedStateChanged__DelegateSignature::Selected' has a wrong offset!");

// Function PerkSystemOptInHelpScreen.PerkSystemOptInHelpScreen_C.SetMode
// 0x0008 (0x0008 - 0x0000)
struct PerkSystemOptInHelpScreen_C_SetMode final
{
public:
	int32                                         Mode;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkSystemOptInHelpScreen_C_SetMode) == 0x000004, "Wrong alignment on PerkSystemOptInHelpScreen_C_SetMode");
static_assert(sizeof(PerkSystemOptInHelpScreen_C_SetMode) == 0x000008, "Wrong size on PerkSystemOptInHelpScreen_C_SetMode");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_SetMode, Mode) == 0x000000, "Member 'PerkSystemOptInHelpScreen_C_SetMode::Mode' has a wrong offset!");
static_assert(offsetof(PerkSystemOptInHelpScreen_C_SetMode, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'PerkSystemOptInHelpScreen_C_SetMode::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

