#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PieChartRowWidget

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PieChartRowWidget.PieChartRowWidget_C
// 0x0020 (0x0258 - 0x0238)
class UPieChartRowWidget_C final : public UCommonUserWidget
{
public:
	class UBorder*                                LegendColorBorder;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Name_PieChartRowWidget_C;                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Num;                                               // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Value;                                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Setup(int32 Param_Num, const class FText& Param_Name, float Param_Value, ECommonNumericType NumericType, const struct FLinearColor& LegendColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PieChartRowWidget_C">();
	}
	static class UPieChartRowWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPieChartRowWidget_C>();
	}
};
static_assert(alignof(UPieChartRowWidget_C) == 0x000008, "Wrong alignment on UPieChartRowWidget_C");
static_assert(sizeof(UPieChartRowWidget_C) == 0x000258, "Wrong size on UPieChartRowWidget_C");
static_assert(offsetof(UPieChartRowWidget_C, LegendColorBorder) == 0x000238, "Member 'UPieChartRowWidget_C::LegendColorBorder' has a wrong offset!");
static_assert(offsetof(UPieChartRowWidget_C, Name_PieChartRowWidget_C) == 0x000240, "Member 'UPieChartRowWidget_C::Name_PieChartRowWidget_C' has a wrong offset!");
static_assert(offsetof(UPieChartRowWidget_C, Num) == 0x000248, "Member 'UPieChartRowWidget_C::Num' has a wrong offset!");
static_assert(offsetof(UPieChartRowWidget_C, Value) == 0x000250, "Member 'UPieChartRowWidget_C::Value' has a wrong offset!");

}

