#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PieChartRowWidget

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PieChartRowWidget.PieChartRowWidget_C.Setup
// 0x00B8 (0x00B8 - 0x0000)
struct PieChartRowWidget_C_Setup final
{
public:
	int32                                         Param_Num;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_Name;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Param_Value;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonNumericType                            NumericType;                                       // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LegendColor;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(PieChartRowWidget_C_Setup) == 0x000008, "Wrong alignment on PieChartRowWidget_C_Setup");
static_assert(sizeof(PieChartRowWidget_C_Setup) == 0x0000B8, "Wrong size on PieChartRowWidget_C_Setup");
static_assert(offsetof(PieChartRowWidget_C_Setup, Param_Num) == 0x000000, "Member 'PieChartRowWidget_C_Setup::Param_Num' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, Param_Name) == 0x000008, "Member 'PieChartRowWidget_C_Setup::Param_Name' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, Param_Value) == 0x000020, "Member 'PieChartRowWidget_C_Setup::Param_Value' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, NumericType) == 0x000024, "Member 'PieChartRowWidget_C_Setup::NumericType' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, LegendColor) == 0x000028, "Member 'PieChartRowWidget_C_Setup::LegendColor' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'PieChartRowWidget_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'PieChartRowWidget_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, K2Node_MakeArray_Array) == 0x000090, "Member 'PieChartRowWidget_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PieChartRowWidget_C_Setup, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'PieChartRowWidget_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");

}

