#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlacementStatRowWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlacementStatRowWidget.PlacementStatRowWidget_C
// 0x0020 (0x0268 - 0x0248)
class UPlacementStatRowWidget_C final : public UAthenaProfileStatWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       OnestPlace1;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatName;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                StatValue;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlacementStatRowWidget(int32 EntryPoint);
	void OnStatChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlacementStatRowWidget_C">();
	}
	static class UPlacementStatRowWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlacementStatRowWidget_C>();
	}
};
static_assert(alignof(UPlacementStatRowWidget_C) == 0x000008, "Wrong alignment on UPlacementStatRowWidget_C");
static_assert(sizeof(UPlacementStatRowWidget_C) == 0x000268, "Wrong size on UPlacementStatRowWidget_C");
static_assert(offsetof(UPlacementStatRowWidget_C, UberGraphFrame) == 0x000248, "Member 'UPlacementStatRowWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlacementStatRowWidget_C, OnestPlace1) == 0x000250, "Member 'UPlacementStatRowWidget_C::OnestPlace1' has a wrong offset!");
static_assert(offsetof(UPlacementStatRowWidget_C, StatName) == 0x000258, "Member 'UPlacementStatRowWidget_C::StatName' has a wrong offset!");
static_assert(offsetof(UPlacementStatRowWidget_C, StatValue) == 0x000260, "Member 'UPlacementStatRowWidget_C::StatValue' has a wrong offset!");

}

