#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerNameDropdown

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PlayerNameDropdown.PlayerNameDropdown_C.ExecuteUbergraph_PlayerNameDropdown
// 0x00B8 (0x00B8 - 0x0000)
struct PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUISubsystem*                     CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGameFeedbackBase*                  K2Node_DynamicCast_AsFort_Game_Feedback_Base;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerNameInfoContainer               CallFunc_GetPlayerNameInfoContainer_ReturnValue;   // 0x0048(0x0018)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerNameInfo                        CallFunc_Array_Get_Item;                           // 0x0068(0x0048)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown) == 0x000008, "Wrong alignment on PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown");
static_assert(sizeof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown) == 0x0000B8, "Wrong size on PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, EntryPoint) == 0x000000, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_GetInputManager_ReturnValue) == 0x000010, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_Create_ReturnValue) == 0x000020, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, K2Node_DynamicCast_AsFort_Game_Feedback_Base) == 0x000038, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::K2Node_DynamicCast_AsFort_Game_Feedback_Base' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_GetPlayerNameInfoContainer_ReturnValue) == 0x000048, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_GetPlayerNameInfoContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_Array_Get_Item) == 0x000068, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'PlayerNameDropdown_C_ExecuteUbergraph_PlayerNameDropdown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

