#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Constructor

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "IFFBoneConfig_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.ExecuteUbergraph_PlayerPawn_Constructor
// 0x0490 (0x0490 - 0x0000)
struct PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Plasma_Pulse_Location;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType4;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters4;               // 0x0038(0x00B8)(ContainsInstancedReference)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType3;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters3;               // 0x00F8(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x01B8(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType1;                // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters1;               // 0x02A8(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0368(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGender_IsMale;                         // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsFemale;                       // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Menus_Screen_Anim_BP; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Toggle1;                        // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Toggle;                         // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47B[0x5];                                      // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Constructor_BASE_C*                  K2Node_CustomEvent_SavedBase;                      // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Perk_C_Constructor_BASE_C*           K2Node_CustomEvent_SavedBASE2;                     // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor");
static_assert(sizeof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor) == 0x000490, "Wrong size on PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, EntryPoint) == 0x000000, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_CustomEvent_Plasma_Pulse_Location) == 0x000004, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_CustomEvent_Plasma_Pulse_Location' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000010, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_GetSocketLocation_ReturnValue) == 0x000018, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000028, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_EventType4) == 0x000031, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_EventType4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_Parameters4) == 0x000038, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_Parameters4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_EventType3) == 0x0000F0, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_EventType3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_Parameters3) == 0x0000F8, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_Parameters3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_SwitchEnum_CmpSuccess) == 0x0001B0, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_SwitchEnum1_CmpSuccess) == 0x0001B1, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_EventType2) == 0x0001B2, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_Parameters2) == 0x0001B8, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_SwitchEnum2_CmpSuccess) == 0x000270, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000274, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000280, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x000290, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000298, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_IsValid_ReturnValue1) == 0x0002A0, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_IsValid_ReturnValue2) == 0x0002A1, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_HasAuthority_ReturnValue) == 0x0002A2, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_EventType1) == 0x0002A3, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_EventType1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_Parameters1) == 0x0002A8, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_Parameters1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_SwitchEnum3_CmpSuccess) == 0x000360, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_EventType) == 0x000361, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_GameplayCueEvent_Parameters) == 0x000368, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_SwitchEnum4_CmpSuccess) == 0x000420, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000428, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000430, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, Temp_bool_Variable) == 0x000438, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_Select_Default) == 0x00043C, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000448, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000450, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_SpawnSoundAttached_ReturnValue1) == 0x000458, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_SpawnSoundAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_GetAnimInstance_ReturnValue) == 0x000460, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_GetGender_IsMale) == 0x000468, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_GetGender_IsMale' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, CallFunc_GetGender_IsFemale) == 0x000469, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::CallFunc_GetGender_IsFemale' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_DynamicCast_AsFortnite_M_Avg_Player_Menus_Screen_Anim_BP) == 0x000470, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_DynamicCast_AsFortnite_M_Avg_Player_Menus_Screen_Anim_BP' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_DynamicCast_bSuccess) == 0x000478, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_CustomEvent_Toggle1) == 0x000479, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_CustomEvent_Toggle1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_CustomEvent_Toggle) == 0x00047A, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_CustomEvent_Toggle' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_CustomEvent_SavedBase) == 0x000480, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_CustomEvent_SavedBase' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor, K2Node_CustomEvent_SavedBASE2) == 0x000488, "Member 'PlayerPawn_Constructor_C_ExecuteUbergraph_PlayerPawn_Constructor::K2Node_CustomEvent_SavedBASE2' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.SetPlasmaPulseLocation
// 0x000C (0x000C - 0x0000)
struct PlayerPawn_Constructor_C_SetPlasmaPulseLocation final
{
public:
	struct FVector                                Param_Plasma_Pulse_Location;                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Constructor_C_SetPlasmaPulseLocation) == 0x000004, "Wrong alignment on PlayerPawn_Constructor_C_SetPlasmaPulseLocation");
static_assert(sizeof(PlayerPawn_Constructor_C_SetPlasmaPulseLocation) == 0x00000C, "Wrong size on PlayerPawn_Constructor_C_SetPlasmaPulseLocation");
static_assert(offsetof(PlayerPawn_Constructor_C_SetPlasmaPulseLocation, Param_Plasma_Pulse_Location) == 0x000000, "Member 'PlayerPawn_Constructor_C_SetPlasmaPulseLocation::Param_Plasma_Pulse_Location' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.SetBase2
// 0x0008 (0x0008 - 0x0000)
struct PlayerPawn_Constructor_C_SetBase2 final
{
public:
	class AB_Perk_C_Constructor_BASE_C*           Param_SavedBASE2;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Constructor_C_SetBase2) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_SetBase2");
static_assert(sizeof(PlayerPawn_Constructor_C_SetBase2) == 0x000008, "Wrong size on PlayerPawn_Constructor_C_SetBase2");
static_assert(offsetof(PlayerPawn_Constructor_C_SetBase2, Param_SavedBASE2) == 0x000000, "Member 'PlayerPawn_Constructor_C_SetBase2::Param_SavedBASE2' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.SetBase
// 0x0008 (0x0008 - 0x0000)
struct PlayerPawn_Constructor_C_SetBase final
{
public:
	class AB_Constructor_BASE_C*                  Param_SavedBase;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Constructor_C_SetBase) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_SetBase");
static_assert(sizeof(PlayerPawn_Constructor_C_SetBase) == 0x000008, "Wrong size on PlayerPawn_Constructor_C_SetBase");
static_assert(offsetof(PlayerPawn_Constructor_C_SetBase, Param_SavedBase) == 0x000000, "Member 'PlayerPawn_Constructor_C_SetBase::Param_SavedBase' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.ToggleShield
// 0x0001 (0x0001 - 0x0000)
struct PlayerPawn_Constructor_C_ToggleShield final
{
public:
	bool                                          Toggle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPawn_Constructor_C_ToggleShield) == 0x000001, "Wrong alignment on PlayerPawn_Constructor_C_ToggleShield");
static_assert(sizeof(PlayerPawn_Constructor_C_ToggleShield) == 0x000001, "Wrong size on PlayerPawn_Constructor_C_ToggleShield");
static_assert(offsetof(PlayerPawn_Constructor_C_ToggleShield, Toggle) == 0x000000, "Member 'PlayerPawn_Constructor_C_ToggleShield::Toggle' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.MultiToggleShield
// 0x0001 (0x0001 - 0x0000)
struct PlayerPawn_Constructor_C_MultiToggleShield final
{
public:
	bool                                          Toggle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPawn_Constructor_C_MultiToggleShield) == 0x000001, "Wrong alignment on PlayerPawn_Constructor_C_MultiToggleShield");
static_assert(sizeof(PlayerPawn_Constructor_C_MultiToggleShield) == 0x000001, "Wrong size on PlayerPawn_Constructor_C_MultiToggleShield");
static_assert(offsetof(PlayerPawn_Constructor_C_MultiToggleShield, Toggle) == 0x000000, "Member 'PlayerPawn_Constructor_C_MultiToggleShield::Toggle' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2
// 0x00C0 (0x00C0 - 0x0000)
struct PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2 final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2");
static_assert(sizeof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2) == 0x0000C0, "Wrong size on PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2, EventType) == 0x000000, "Member 'PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2::EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2, Parameters) == 0x000008, "Member 'PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2::Parameters' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1
// 0x00C0 (0x00C0 - 0x0000)
struct PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1 final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1");
static_assert(sizeof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1) == 0x0000C0, "Wrong size on PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1, EventType) == 0x000000, "Member 'PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1::EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1, Parameters) == 0x000008, "Member 'PlayerPawn_Constructor_C_GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1::Parameters' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.GameplayCue.Constructor.ToInfinityAndBeyond.ActiveFX
// 0x00C0 (0x00C0 - 0x0000)
struct PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX");
static_assert(sizeof(PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX) == 0x0000C0, "Wrong size on PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX, EventType) == 0x000000, "Member 'PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX::EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX, Parameters) == 0x000008, "Member 'PlayerPawn_Constructor_C_GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX::Parameters' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.GameplayCue.Constructor.PlasmaPulse.IFFCoding
// 0x00C0 (0x00C0 - 0x0000)
struct PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding");
static_assert(sizeof(PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding) == 0x0000C0, "Wrong size on PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding, EventType) == 0x000000, "Member 'PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding::EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding, Parameters) == 0x000008, "Member 'PlayerPawn_Constructor_C_GameplayCue_Constructor_PlasmaPulse_IFFCoding::Parameters' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.GameplayCue.Damage
// 0x00C0 (0x00C0 - 0x0000)
struct PlayerPawn_Constructor_C_GameplayCue_Damage final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PlayerPawn_Constructor_C_GameplayCue_Damage) == 0x000008, "Wrong alignment on PlayerPawn_Constructor_C_GameplayCue_Damage");
static_assert(sizeof(PlayerPawn_Constructor_C_GameplayCue_Damage) == 0x0000C0, "Wrong size on PlayerPawn_Constructor_C_GameplayCue_Damage");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Damage, EventType) == 0x000000, "Member 'PlayerPawn_Constructor_C_GameplayCue_Damage::EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_GameplayCue_Damage, Parameters) == 0x000008, "Member 'PlayerPawn_Constructor_C_GameplayCue_Damage::Parameters' has a wrong offset!");

// Function PlayerPawn_Constructor.PlayerPawn_Constructor_C.SetIFFMeshesEnabled
// 0x0120 (0x0120 - 0x0000)
struct PlayerPawn_Constructor_C_SetIFFMeshesEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIFFBoneConfig                         CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item1;                          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPawn_Constructor_C_SetIFFMeshesEnabled) == 0x000010, "Wrong alignment on PlayerPawn_Constructor_C_SetIFFMeshesEnabled");
static_assert(sizeof(PlayerPawn_Constructor_C_SetIFFMeshesEnabled) == 0x000120, "Wrong size on PlayerPawn_Constructor_C_SetIFFMeshesEnabled");
static_assert(offsetof(PlayerPawn_Constructor_C_SetIFFMeshesEnabled, IsEnabled) == 0x000000, "Member 'PlayerPawn_Constructor_C_SetIFFMeshesEnabled::IsEnabled' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_SetIFFMeshesEnabled, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PlayerPawn_Constructor_C_SetIFFMeshesEnabled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Constructor_C_SetIFFMeshesEnabled, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PlayerPawn_Constructor_C_SetIFFMeshesEnabled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
