#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerActionedWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerActionedWindow.PlayerActionedWindow_C.ExecuteUbergraph_PlayerActionedWindow
// 0x0020 (0x0020 - 0x0000)
struct PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow) == 0x000008, "Wrong alignment on PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow");
static_assert(sizeof(PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow) == 0x000020, "Wrong size on PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow");
static_assert(offsetof(PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow, EntryPoint) == 0x000000, "Member 'PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'PlayerActionedWindow_C_ExecuteUbergraph_PlayerActionedWindow::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function PlayerActionedWindow.PlayerActionedWindow_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PlayerActionedWindow_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

