#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Constructor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "IFFBoneConfig_structs.hpp"
#include "PlayerPawn_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerPawn_Constructor.PlayerPawn_Constructor_C
// 0x0130 (0x2770 - 0x2640)
class APlayerPawn_Constructor_C final : public APlayerPawn_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PlayerPawn_Constructor_C;           // 0x2638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ShieldCollider;                                    // 0x2640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShieldCollisionAttachLocation;                     // 0x2648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ServerShieldMesh;                                  // 0x2650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ShieldMesh;                                        // 0x2658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IFFShield_Light;                                   // 0x2660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BullRushPoke;                                      // 0x2668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TakeDamageTimeline_LineBrightness_E993138E4A26ED909055A89FDA7BCA47; // 0x2670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TakeDamageTimeline_DamageFlash_E993138E4A26ED909055A89FDA7BCA47; // 0x2674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TakeDamageTimeline__Direction_E993138E4A26ED909055A89FDA7BCA47; // 0x2678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2679[0x7];                                     // 0x2679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TakeDamageTimeline;                                // 0x2680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_Activate;                                        // 0x2688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ShieldPlayerMesh;                                  // 0x2690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_IFF_ShieldFlicker;                             // 0x2698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamageFlash;                                       // 0x26A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LineBrightness;                                    // 0x26A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        P_TIABExplosion;                                   // 0x26B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_TIAB;                                        // 0x26B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Kinetic_Overload;                            // 0x26C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Shield_Start;                                // 0x26C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Shield_Stop;                                 // 0x26D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_Shield_Impact_0;                             // 0x26D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Finalized_IFF_BackPack_Offset;                     // 0x26E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IFF_Local_Offset_Without_Backpack;                 // 0x26EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IFF_Local_Offset_With_Back_Pack;                   // 0x26F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2704[0x4];                                     // 0x2704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   PlayArmAnim;                                       // 0x2708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UPrimitiveComponent*>            AllIFFMeshes;                                      // 0x2718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                     IFFMaterialParent;                                 // 0x2728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIFFBoneConfig>                 IFFBoneConfigs;                                    // 0x2730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AB_Constructor_BASE_C*                  SavedBase;                                         // 0x2740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Perk_C_Constructor_BASE_C*           SavedBASE2;                                        // 0x2748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    NewVar_0;                                          // 0x2750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Plasma_Pulse_Location;                             // 0x2758(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayArmAnim__DelegateSignature();
	void ExecuteUbergraph_PlayerPawn_Constructor(int32 EntryPoint);
	void SetPlasmaPulseLocation(const struct FVector& Param_Plasma_Pulse_Location);
	void SetBase2(class AB_Perk_C_Constructor_BASE_C* Param_SavedBASE2);
	void SetBase(class AB_Constructor_BASE_C* Param_SavedBase);
	void ToggleShield(bool Toggle);
	void MultiToggleShield(bool Toggle);
	void SetMenuScreenClassName();
	void TestEndIFF();
	void PlayArm();
	void GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnCharacterPartsReinitialized();
	void TestIFF();
	void ReceiveBeginPlay();
	void GameplayCue_Constructor_ToInfinityAndBeyond_ActiveFX(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Constructor_PlasmaPulse_IFFCoding(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void TakeDamageTimeline__UpdateFunc();
	void TakeDamageTimeline__FinishedFunc();
	void UserConstructionScript();
	void SetIFFMeshesEnabled(bool IsEnabled);
	void OnRep_SavedBase();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerPawn_Constructor_C">();
	}
	static class APlayerPawn_Constructor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerPawn_Constructor_C>();
	}
};
static_assert(alignof(APlayerPawn_Constructor_C) == 0x000010, "Wrong alignment on APlayerPawn_Constructor_C");
static_assert(sizeof(APlayerPawn_Constructor_C) == 0x002770, "Wrong size on APlayerPawn_Constructor_C");
static_assert(offsetof(APlayerPawn_Constructor_C, UberGraphFrame_PlayerPawn_Constructor_C) == 0x002638, "Member 'APlayerPawn_Constructor_C::UberGraphFrame_PlayerPawn_Constructor_C' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, ShieldCollider) == 0x002640, "Member 'APlayerPawn_Constructor_C::ShieldCollider' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, ShieldCollisionAttachLocation) == 0x002648, "Member 'APlayerPawn_Constructor_C::ShieldCollisionAttachLocation' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, ServerShieldMesh) == 0x002650, "Member 'APlayerPawn_Constructor_C::ServerShieldMesh' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, ShieldMesh) == 0x002658, "Member 'APlayerPawn_Constructor_C::ShieldMesh' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, IFFShield_Light) == 0x002660, "Member 'APlayerPawn_Constructor_C::IFFShield_Light' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, BullRushPoke) == 0x002668, "Member 'APlayerPawn_Constructor_C::BullRushPoke' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, TakeDamageTimeline_LineBrightness_E993138E4A26ED909055A89FDA7BCA47) == 0x002670, "Member 'APlayerPawn_Constructor_C::TakeDamageTimeline_LineBrightness_E993138E4A26ED909055A89FDA7BCA47' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, TakeDamageTimeline_DamageFlash_E993138E4A26ED909055A89FDA7BCA47) == 0x002674, "Member 'APlayerPawn_Constructor_C::TakeDamageTimeline_DamageFlash_E993138E4A26ED909055A89FDA7BCA47' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, TakeDamageTimeline__Direction_E993138E4A26ED909055A89FDA7BCA47) == 0x002678, "Member 'APlayerPawn_Constructor_C::TakeDamageTimeline__Direction_E993138E4A26ED909055A89FDA7BCA47' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, TakeDamageTimeline) == 0x002680, "Member 'APlayerPawn_Constructor_C::TakeDamageTimeline' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, P_Activate) == 0x002688, "Member 'APlayerPawn_Constructor_C::P_Activate' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, ShieldPlayerMesh) == 0x002690, "Member 'APlayerPawn_Constructor_C::ShieldPlayerMesh' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, MID_IFF_ShieldFlicker) == 0x002698, "Member 'APlayerPawn_Constructor_C::MID_IFF_ShieldFlicker' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, DamageFlash) == 0x0026A0, "Member 'APlayerPawn_Constructor_C::DamageFlash' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, LineBrightness) == 0x0026A8, "Member 'APlayerPawn_Constructor_C::LineBrightness' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, P_TIABExplosion) == 0x0026B0, "Member 'APlayerPawn_Constructor_C::P_TIABExplosion' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Sound_TIAB) == 0x0026B8, "Member 'APlayerPawn_Constructor_C::Sound_TIAB' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Sound_Kinetic_Overload) == 0x0026C0, "Member 'APlayerPawn_Constructor_C::Sound_Kinetic_Overload' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Sound_Shield_Start) == 0x0026C8, "Member 'APlayerPawn_Constructor_C::Sound_Shield_Start' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Sound_Shield_Stop) == 0x0026D0, "Member 'APlayerPawn_Constructor_C::Sound_Shield_Stop' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Sound_Shield_Impact_0) == 0x0026D8, "Member 'APlayerPawn_Constructor_C::Sound_Shield_Impact_0' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Finalized_IFF_BackPack_Offset) == 0x0026E0, "Member 'APlayerPawn_Constructor_C::Finalized_IFF_BackPack_Offset' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, IFF_Local_Offset_Without_Backpack) == 0x0026EC, "Member 'APlayerPawn_Constructor_C::IFF_Local_Offset_Without_Backpack' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, IFF_Local_Offset_With_Back_Pack) == 0x0026F8, "Member 'APlayerPawn_Constructor_C::IFF_Local_Offset_With_Back_Pack' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, PlayArmAnim) == 0x002708, "Member 'APlayerPawn_Constructor_C::PlayArmAnim' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, AllIFFMeshes) == 0x002718, "Member 'APlayerPawn_Constructor_C::AllIFFMeshes' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, IFFMaterialParent) == 0x002728, "Member 'APlayerPawn_Constructor_C::IFFMaterialParent' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, IFFBoneConfigs) == 0x002730, "Member 'APlayerPawn_Constructor_C::IFFBoneConfigs' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, SavedBase) == 0x002740, "Member 'APlayerPawn_Constructor_C::SavedBase' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, SavedBASE2) == 0x002748, "Member 'APlayerPawn_Constructor_C::SavedBASE2' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, NewVar_0) == 0x002750, "Member 'APlayerPawn_Constructor_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(APlayerPawn_Constructor_C, Plasma_Pulse_Location) == 0x002758, "Member 'APlayerPawn_Constructor_C::Plasma_Pulse_Location' has a wrong offset!");

}

