#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawn_Outlander

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerPawn_Outlander.PlayerPawn_Outlander_C.ExecuteUbergraph_PlayerPawn_Outlander
// 0x0CD0 (0x0CD0 - 0x0000)
struct PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType10;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters10;              // 0x0008(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_NewController;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType9;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters9;               // 0x00E0(0x00B8)(ContainsInstancedReference)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType8;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters8;               // 0x01A0(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType7;                // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters7;               // 0x0260(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue1;           // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue3;          // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue4;          // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue5;          // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue6;          // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_VSpawnColor;                    // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Activate;                       // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType6;                // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters6;               // 0x03A0(0x00B8)(ContainsInstancedReference)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType5;                // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters5;               // 0x0460(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51A[0x6];                                      // 0x051A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue1;               // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller1;      // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0550(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x057C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0618(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType4;                // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters4;               // 0x0648(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0704(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType3;                // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters3;               // 0x0718(0x00B8)(ContainsInstancedReference)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue3;        // 0x07D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x07E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x07EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x07F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue4;        // 0x0800(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0808(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType2;                // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_815[0x3];                                      // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters2;               // 0x0818(0x00B8)(ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DD[0x3];                                      // 0x08DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue2;               // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue7;          // 0x08F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller2;      // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0901(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType1;                // 0x0902(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_903[0x5];                                      // 0x0903(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters1;               // 0x0908(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x09C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C1[0x7];                                      // 0x09C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue3;               // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller3;      // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue1;     // 0x09D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x09DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DB[0x5];                                      // 0x09DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x09E0(0x00B8)(ContainsInstancedReference)
	class AController*                            CallFunc_GetController_ReturnValue4;               // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA1[0x7];                                      // 0x0AA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller4;      // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0AB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB2[0x2];                                      // 0x0AB2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0AB4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType11;               // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC1[0x7];                                      // 0x0AC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters11;              // 0x0AC8(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0B81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B82[0x2];                                      // 0x0B82(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0B84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0B88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B89[0x3];                                      // 0x0B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0B8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0B90(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface1_CastInput; // 0x0BA8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue1;  // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0BC0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD1[0x3];                                      // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0BD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDC[0x4];                                      // 0x0BDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item1;                          // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0BEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0BF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF1[0x3];                                      // 0x0BF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0BF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_CustomEvent_MontageName;                    // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0C08(0x0010)(ZeroConstructor, ReferenceParm)
	class USceneComponent*                        CallFunc_Array_Get_Item2;                          // 0x0C18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0C20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C24[0x4];                                      // 0x0C24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0C28(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0C31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C32[0x6];                                      // 0x0C32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0C38(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0C49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4A[0x6];                                      // 0x0C4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0C58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C59[0x3];                                      // 0x0C59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0C5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0C60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGender_IsMale;                         // 0x0C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsFemale;                       // 0x0C69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6A[0x6];                                      // 0x0C6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateZone*                     K2Node_DynamicCast_AsFort_Game_State_Zone;         // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsMale1;                        // 0x0C79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGender_IsFemale1;                      // 0x0C7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C7B[0x5];                                      // 0x0C7B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue1;             // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Menus_Screen_Anim_BP; // 0x0C88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C91[0x3];                                      // 0x0C91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue1;           // 0x0C94(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue5;        // 0x0CA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0CAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0CB8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC4[0x4];                                      // 0x0CC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue6;        // 0x0CC8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander) == 0x000008, "Wrong alignment on PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander");
static_assert(sizeof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander) == 0x000CD0, "Wrong size on PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, EntryPoint) == 0x000000, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType10) == 0x000004, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType10' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters10) == 0x000008, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters10' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum_CmpSuccess) == 0x0000C0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_NewController) == 0x0000C8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_NewController' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000D0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType9) == 0x0000D8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType9' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters9) == 0x0000E0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters9' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType8) == 0x000198, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType8' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters8) == 0x0001A0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters8' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum1_CmpSuccess) == 0x000258, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum2_CmpSuccess) == 0x000259, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType7) == 0x00025A, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType7' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters7) == 0x000260, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters7' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum3_CmpSuccess) == 0x000318, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_IsDedicatedServer_ReturnValue) == 0x000319, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000320, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue1) == 0x000328, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_IsDedicatedServer_ReturnValue1) == 0x000330, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_IsDedicatedServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000338, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue3) == 0x000340, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue4) == 0x000348, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, Temp_int_Array_Index_Variable) == 0x000350, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue5) == 0x000358, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue5' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue6) == 0x000360, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue6' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000368, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_CustomEvent_VSpawnColor) == 0x000370, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_CustomEvent_VSpawnColor' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_CustomEvent_Activate) == 0x000380, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_CustomEvent_Activate' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAttached_ReturnValue2) == 0x000388, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000390, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType6) == 0x000398, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType6' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters6) == 0x0003A0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters6' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType5) == 0x000458, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType5' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters5) == 0x000460, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters5' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum4_CmpSuccess) == 0x000518, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum5_CmpSuccess) == 0x000519, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetController_ReturnValue) == 0x000520, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetController_ReturnValue1) == 0x000528, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000530, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_bSuccess) == 0x000538, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_AsFort_Player_Controller1) == 0x000540, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_AsFort_Player_Controller1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_bSuccess1) == 0x000548, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_Damage) == 0x00054C, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_DamageTags) == 0x000550, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_Momentum) == 0x000570, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_HitInfo) == 0x00057C, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_InstigatedBy) == 0x000608, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_DamageCauser) == 0x000610, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_Event_EffectContext) == 0x000618, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_Array_Length_ReturnValue) == 0x000630, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_Array_Get_Item) == 0x000638, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_Array_Length_ReturnValue1) == 0x000640, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType4) == 0x000644, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters4) == 0x000648, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum6_CmpSuccess) == 0x000700, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_MakeRotFromX_ReturnValue) == 0x000704, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType3) == 0x000710, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters3) == 0x000718, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0007D0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAttached_ReturnValue3) == 0x0007D8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetSocketRotation_ReturnValue) == 0x0007E0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetSocketLocation_ReturnValue) == 0x0007EC, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x0007F8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnEmitterAttached_ReturnValue4) == 0x000800, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnEmitterAttached_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000808, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType2) == 0x000814, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters2) == 0x000818, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_BreakVector_X) == 0x0008D0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_BreakVector_Y) == 0x0008D4, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_BreakVector_Z) == 0x0008D8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum7_CmpSuccess) == 0x0008DC, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0008E0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetController_ReturnValue2) == 0x0008E8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_SpawnSoundAttached_ReturnValue7) == 0x0008F0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_SpawnSoundAttached_ReturnValue7' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_AsFort_Player_Controller2) == 0x0008F8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_AsFort_Player_Controller2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_bSuccess2) == 0x000900, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000901, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType1) == 0x000902, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters1) == 0x000908, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum8_CmpSuccess) == 0x0009C0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetController_ReturnValue3) == 0x0009C8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_AsFort_Player_Controller3) == 0x0009D0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_AsFort_Player_Controller3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_bSuccess3) == 0x0009D8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_IsLocalPlayerController_ReturnValue1) == 0x0009D9, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_IsLocalPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType) == 0x0009DA, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters) == 0x0009E0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_GetController_ReturnValue4) == 0x000A98, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_GetController_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum9_CmpSuccess) == 0x000AA0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_AsFort_Player_Controller4) == 0x000AA8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_AsFort_Player_Controller4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_DynamicCast_bSuccess4) == 0x000AB0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, Temp_bool_Has_Been_Initd_Variable) == 0x000AB1, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000AB4, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_EventType11) == 0x000AC0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_EventType11' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_GameplayCueEvent_Parameters11) == 0x000AC8, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_GameplayCueEvent_Parameters11' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, K2Node_SwitchEnum10_CmpSuccess) == 0x000B80, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, Temp_bool_IsClosed_Variable) == 0x000B81, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, Temp_int_Loop_Counter_Variable) == 0x000B84, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_Less_IntInt_ReturnValue) == 0x000B88, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_Add_IntInt_ReturnValue) == 0x000B8C, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000B90, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000BA0, "Member 'PlayerPawn_Outlander_C_ExecuteUbergraph_PlayerPawn_Outlander::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
