#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProfileStatsMatchesSubScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProfileStatsMatchesSubScreen.ProfileStatsMatchesSubScreen_C
// 0x0050 (0x0370 - 0x0320)
class UProfileStatsMatchesSubScreen_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaProfileStatBox*                  ListProfileStatBox;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        MatchList;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaProfileStatBox*                  MatchProfileStatBox;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlacementStatRowWidget_C*              PlacementStatRowWidget;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreStatRowWidget_C*                  ScoreStatRowWidget;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USmallStatRowWidget_C*                  Stat1;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTopWeaponStatRow_C*                    TopWeaponStatRow;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_ProfileStatsMatchesSubScreen(int32 EntryPoint);
	void BndEvt__MatchList_K2Node_ComponentBoundEvent_326_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__MatchList_K2Node_ComponentBoundEvent_47_OnListViewItemClicked__DelegateSignature(class UObject* Item, bool bIsHovered);
	void OnActivated();
	void HandleStatViewChanged(class UAthenaBaseStatView* StatView);
	void Construct();
	void HandleBack(bool* PassThrough);
	void SetMatches(const TArray<class UObject*>& InDataProvider);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProfileStatsMatchesSubScreen_C">();
	}
	static class UProfileStatsMatchesSubScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProfileStatsMatchesSubScreen_C>();
	}
};
static_assert(alignof(UProfileStatsMatchesSubScreen_C) == 0x000008, "Wrong alignment on UProfileStatsMatchesSubScreen_C");
static_assert(sizeof(UProfileStatsMatchesSubScreen_C) == 0x000370, "Wrong size on UProfileStatsMatchesSubScreen_C");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, UberGraphFrame) == 0x000320, "Member 'UProfileStatsMatchesSubScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, ListProfileStatBox) == 0x000328, "Member 'UProfileStatsMatchesSubScreen_C::ListProfileStatBox' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, MatchList) == 0x000330, "Member 'UProfileStatsMatchesSubScreen_C::MatchList' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, MatchProfileStatBox) == 0x000338, "Member 'UProfileStatsMatchesSubScreen_C::MatchProfileStatBox' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, PlacementStatRowWidget) == 0x000340, "Member 'UProfileStatsMatchesSubScreen_C::PlacementStatRowWidget' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, ScoreStatRowWidget) == 0x000348, "Member 'UProfileStatsMatchesSubScreen_C::ScoreStatRowWidget' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, Stat1) == 0x000350, "Member 'UProfileStatsMatchesSubScreen_C::Stat1' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, TopWeaponStatRow) == 0x000358, "Member 'UProfileStatsMatchesSubScreen_C::TopWeaponStatRow' has a wrong offset!");
static_assert(offsetof(UProfileStatsMatchesSubScreen_C, BackAction) == 0x000360, "Member 'UProfileStatsMatchesSubScreen_C::BackAction' has a wrong offset!");

}

