#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProfileStatsAllStatsSubScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProfileStatsAllStatsSubScreen.ProfileStatsAllStatsSubScreen_C
// 0x0040 (0x0360 - 0x0320)
class UProfileStatsAllStatsSubScreen_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               StatWrapBox;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGameplayTagContainer                  StatsToDisplay;                                    // 0x0340(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ProfileStatsAllStatsSubScreen(int32 EntryPoint);
	void Construct();
	void HandleBack(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProfileStatsAllStatsSubScreen_C">();
	}
	static class UProfileStatsAllStatsSubScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProfileStatsAllStatsSubScreen_C>();
	}
};
static_assert(alignof(UProfileStatsAllStatsSubScreen_C) == 0x000008, "Wrong alignment on UProfileStatsAllStatsSubScreen_C");
static_assert(sizeof(UProfileStatsAllStatsSubScreen_C) == 0x000360, "Wrong size on UProfileStatsAllStatsSubScreen_C");
static_assert(offsetof(UProfileStatsAllStatsSubScreen_C, UberGraphFrame) == 0x000320, "Member 'UProfileStatsAllStatsSubScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProfileStatsAllStatsSubScreen_C, StatWrapBox) == 0x000328, "Member 'UProfileStatsAllStatsSubScreen_C::StatWrapBox' has a wrong offset!");
static_assert(offsetof(UProfileStatsAllStatsSubScreen_C, BackAction) == 0x000330, "Member 'UProfileStatsAllStatsSubScreen_C::BackAction' has a wrong offset!");
static_assert(offsetof(UProfileStatsAllStatsSubScreen_C, StatsToDisplay) == 0x000340, "Member 'UProfileStatsAllStatsSubScreen_C::StatsToDisplay' has a wrong offset!");

}

