#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PublishModal

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PublishModal.PublishModal_C.ExecuteUbergraph_PublishModal
// 0x0098 (0x0098 - 0x0000)
struct PublishModal_C_ExecuteUbergraph_PublishModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Text1;                          // 0x0008(0x0018)(ConstParm)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0038(0x0018)(ConstParm)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PublishModal_C_ExecuteUbergraph_PublishModal) == 0x000008, "Wrong alignment on PublishModal_C_ExecuteUbergraph_PublishModal");
static_assert(sizeof(PublishModal_C_ExecuteUbergraph_PublishModal) == 0x000098, "Wrong size on PublishModal_C_ExecuteUbergraph_PublishModal");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, EntryPoint) == 0x000000, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_CustomEvent_Text1) == 0x000008, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_CustomEvent_Text1' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_ComponentBoundEvent_Button3) == 0x000020, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_ComponentBoundEvent_Button2) == 0x000028, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_CustomEvent_Text) == 0x000038, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_GetUINavigationManager_ReturnValue) == 0x000050, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_Event_bSuccess) == 0x000058, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_Event_bSuccess' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_GetContext_ReturnValue) == 0x000068, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_PlayAnimation_ReturnValue1) == 0x000070, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_ComponentBoundEvent_Button1) == 0x000078, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_GetContext_ReturnValue1) == 0x000088, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PublishModal_C_ExecuteUbergraph_PublishModal, CallFunc_PlayAnimation_ReturnValue2) == 0x000090, "Member 'PublishModal_C_ExecuteUbergraph_PublishModal::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");

// Function PublishModal.PublishModal_C.BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PublishModal_C_BndEvt__Button_CopyCode_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PublishModal.PublishModal_C.BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PublishModal_C_BndEvt__Button_Submit_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PublishModal.PublishModal_C.OnValidCheckComplete
// 0x0001 (0x0001 - 0x0000)
struct PublishModal_C_OnValidCheckComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PublishModal_C_OnValidCheckComplete) == 0x000001, "Wrong alignment on PublishModal_C_OnValidCheckComplete");
static_assert(sizeof(PublishModal_C_OnValidCheckComplete) == 0x000001, "Wrong size on PublishModal_C_OnValidCheckComplete");
static_assert(offsetof(PublishModal_C_OnValidCheckComplete, bSuccess) == 0x000000, "Member 'PublishModal_C_OnValidCheckComplete::bSuccess' has a wrong offset!");

// Function PublishModal.PublishModal_C.BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PublishModal_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PublishModal.PublishModal_C.BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PublishModal_C_BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PublishModal.PublishModal_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct PublishModal_C_CustomEvent_0 final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PublishModal_C_CustomEvent_0) == 0x000008, "Wrong alignment on PublishModal_C_CustomEvent_0");
static_assert(sizeof(PublishModal_C_CustomEvent_0) == 0x000018, "Wrong size on PublishModal_C_CustomEvent_0");
static_assert(offsetof(PublishModal_C_CustomEvent_0, Text) == 0x000000, "Member 'PublishModal_C_CustomEvent_0::Text' has a wrong offset!");

// Function PublishModal.PublishModal_C.OnMouseButtonDown_0
// 0x0220 (0x0220 - 0x0000)
struct PublishModal_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(PublishModal_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on PublishModal_C_OnMouseButtonDown_0");
static_assert(sizeof(PublishModal_C_OnMouseButtonDown_0) == 0x000220, "Wrong size on PublishModal_C_OnMouseButtonDown_0");
static_assert(offsetof(PublishModal_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'PublishModal_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(PublishModal_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'PublishModal_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(PublishModal_C_OnMouseButtonDown_0, ReturnValue) == 0x0000A8, "Member 'PublishModal_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(PublishModal_C_OnMouseButtonDown_0, CallFunc_GetContext_ReturnValue) == 0x000160, "Member 'PublishModal_C_OnMouseButtonDown_0::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PublishModal_C_OnMouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'PublishModal_C_OnMouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function PublishModal.PublishModal_C.OnTextChanged_Event_0
// 0x0018 (0x0018 - 0x0000)
struct PublishModal_C_OnTextChanged_Event_0 final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PublishModal_C_OnTextChanged_Event_0) == 0x000008, "Wrong alignment on PublishModal_C_OnTextChanged_Event_0");
static_assert(sizeof(PublishModal_C_OnTextChanged_Event_0) == 0x000018, "Wrong size on PublishModal_C_OnTextChanged_Event_0");
static_assert(offsetof(PublishModal_C_OnTextChanged_Event_0, Text) == 0x000000, "Member 'PublishModal_C_OnTextChanged_Event_0::Text' has a wrong offset!");

}

