#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseHistoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PurchaseHistoryEntry.PurchaseHistoryEntry_C
// 0x0070 (0x0BB0 - 0x0B40)
class UPurchaseHistoryEntry_C final : public UFortPurchaseHistoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_ItemBackground;                       // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlockPlusXITEMS;                         // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 FortMultiSizeItemCard_0;                           // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 FortMultiSizeItemCard_1;                           // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 HiddenFortMultiSizeItemCard_Spacer;                // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemCardHB;                                        // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayPlusXItems;                                 // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_RefundStatus;                             // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Purchased;                                    // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Refunded;                                     // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DEVisDisabled;                                     // 0x0BA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA9[0x3];                                      // 0x0BA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollOffset;                                      // 0x0BAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PurchaseHistoryEntry(int32 EntryPoint);
	void UpdateItemList(const TArray<class UFortMultiSizeItemCard*>& ItemCards);
	void PreConstruct(bool IsDesignTime);
	void DisableAppearance(bool IsDisabled);
	void SetPurchaseText(const class FText& PurchaseText, bool bHasBeenRefunded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PurchaseHistoryEntry_C">();
	}
	static class UPurchaseHistoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPurchaseHistoryEntry_C>();
	}
};
static_assert(alignof(UPurchaseHistoryEntry_C) == 0x000008, "Wrong alignment on UPurchaseHistoryEntry_C");
static_assert(sizeof(UPurchaseHistoryEntry_C) == 0x000BB0, "Wrong size on UPurchaseHistoryEntry_C");
static_assert(offsetof(UPurchaseHistoryEntry_C, UberGraphFrame) == 0x000B40, "Member 'UPurchaseHistoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, CommonBorder_ItemBackground) == 0x000B48, "Member 'UPurchaseHistoryEntry_C::CommonBorder_ItemBackground' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, CommonTextBlock_0) == 0x000B50, "Member 'UPurchaseHistoryEntry_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, CommonTextBlockPlusXITEMS) == 0x000B58, "Member 'UPurchaseHistoryEntry_C::CommonTextBlockPlusXITEMS' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, FortMultiSizeItemCard_0) == 0x000B60, "Member 'UPurchaseHistoryEntry_C::FortMultiSizeItemCard_0' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, FortMultiSizeItemCard_1) == 0x000B68, "Member 'UPurchaseHistoryEntry_C::FortMultiSizeItemCard_1' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, HiddenFortMultiSizeItemCard_Spacer) == 0x000B70, "Member 'UPurchaseHistoryEntry_C::HiddenFortMultiSizeItemCard_Spacer' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Image_Arrow) == 0x000B78, "Member 'UPurchaseHistoryEntry_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, ItemCardHB) == 0x000B80, "Member 'UPurchaseHistoryEntry_C::ItemCardHB' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, OverlayPlusXItems) == 0x000B88, "Member 'UPurchaseHistoryEntry_C::OverlayPlusXItems' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Switcher_RefundStatus) == 0x000B90, "Member 'UPurchaseHistoryEntry_C::Switcher_RefundStatus' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Text_Purchased) == 0x000B98, "Member 'UPurchaseHistoryEntry_C::Text_Purchased' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, Text_Refunded) == 0x000BA0, "Member 'UPurchaseHistoryEntry_C::Text_Refunded' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, DEVisDisabled) == 0x000BA8, "Member 'UPurchaseHistoryEntry_C::DEVisDisabled' has a wrong offset!");
static_assert(offsetof(UPurchaseHistoryEntry_C, ScrollOffset) == 0x000BAC, "Member 'UPurchaseHistoryEntry_C::ScrollOffset' has a wrong offset!");

}

