#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseHistoryEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function PurchaseHistoryEntry.PurchaseHistoryEntry_C.ExecuteUbergraph_PurchaseHistoryEntry
// 0x0160 (0x0160 - 0x0000)
struct PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_PurchaseText;                         // 0x0028(0x0018)(ConstParm)
	bool                                          K2Node_Event_bHasBeenRefunded;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_isDisabled;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortMultiSizeItemCard*>         K2Node_Event_ItemCards;                            // 0x0060(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UFortMultiSizeItemCard*                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             CallFunc_GetCardSize_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue1;                    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select2_Default;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry) == 0x000008, "Wrong alignment on PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry");
static_assert(sizeof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry) == 0x000160, "Wrong size on PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, EntryPoint) == 0x000000, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_bool_Variable) == 0x000004, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_byte_Variable) == 0x000005, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_byte_Variable1) == 0x000006, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_bool_True_if_break_was_hit_Variable) == 0x000007, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_struct_Variable) == 0x000014, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Event_PurchaseText) == 0x000028, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Event_PurchaseText' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Event_bHasBeenRefunded) == 0x000040, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Event_bHasBeenRefunded' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_CustomEvent_isDisabled) == 0x000041, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_CustomEvent_isDisabled' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Event_IsDesignTime) == 0x000042, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Select_Default) == 0x000043, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_struct_Variable1) == 0x000048, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Add_IntInt_ReturnValue1) == 0x000058, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Event_ItemCards) == 0x000060, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Event_ItemCards' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Array_Get_Item) == 0x000070, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_GetCardSize_ReturnValue) == 0x000078, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_GetCardSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Array_Length_ReturnValue1) == 0x000080, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_BooleanAND_ReturnValue) == 0x000085, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_AddChild_ReturnValue1) == 0x000090, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_AddChild_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_bool_Variable1) == 0x000098, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x0000A0, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Select1_Default) == 0x0000AC, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_MakeLiteralInt_ReturnValue) == 0x0000BC, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_object_Variable) == 0x0000C0, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Subtract_IntInt_ReturnValue1) == 0x0000D4, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_BooleanAND_ReturnValue1) == 0x0000D8, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_MakeArray_Array) == 0x000120, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_object_Variable1) == 0x000130, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, CallFunc_Format_ReturnValue) == 0x000138, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, Temp_bool_Variable2) == 0x000150, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry, K2Node_Select2_Default) == 0x000158, "Member 'PurchaseHistoryEntry_C_ExecuteUbergraph_PurchaseHistoryEntry::K2Node_Select2_Default' has a wrong offset!");

// Function PurchaseHistoryEntry.PurchaseHistoryEntry_C.UpdateItemList
// 0x0010 (0x0010 - 0x0000)
struct PurchaseHistoryEntry_C_UpdateItemList final
{
public:
	TArray<class UFortMultiSizeItemCard*>         ItemCards;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(PurchaseHistoryEntry_C_UpdateItemList) == 0x000008, "Wrong alignment on PurchaseHistoryEntry_C_UpdateItemList");
static_assert(sizeof(PurchaseHistoryEntry_C_UpdateItemList) == 0x000010, "Wrong size on PurchaseHistoryEntry_C_UpdateItemList");
static_assert(offsetof(PurchaseHistoryEntry_C_UpdateItemList, ItemCards) == 0x000000, "Member 'PurchaseHistoryEntry_C_UpdateItemList::ItemCards' has a wrong offset!");

// Function PurchaseHistoryEntry.PurchaseHistoryEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PurchaseHistoryEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PurchaseHistoryEntry_C_PreConstruct) == 0x000001, "Wrong alignment on PurchaseHistoryEntry_C_PreConstruct");
static_assert(sizeof(PurchaseHistoryEntry_C_PreConstruct) == 0x000001, "Wrong size on PurchaseHistoryEntry_C_PreConstruct");
static_assert(offsetof(PurchaseHistoryEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PurchaseHistoryEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PurchaseHistoryEntry.PurchaseHistoryEntry_C.DisableAppearance
// 0x0001 (0x0001 - 0x0000)
struct PurchaseHistoryEntry_C_DisableAppearance final
{
public:
	bool                                          IsDisabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PurchaseHistoryEntry_C_DisableAppearance) == 0x000001, "Wrong alignment on PurchaseHistoryEntry_C_DisableAppearance");
static_assert(sizeof(PurchaseHistoryEntry_C_DisableAppearance) == 0x000001, "Wrong size on PurchaseHistoryEntry_C_DisableAppearance");
static_assert(offsetof(PurchaseHistoryEntry_C_DisableAppearance, IsDisabled) == 0x000000, "Member 'PurchaseHistoryEntry_C_DisableAppearance::IsDisabled' has a wrong offset!");

// Function PurchaseHistoryEntry.PurchaseHistoryEntry_C.SetPurchaseText
// 0x0020 (0x0020 - 0x0000)
struct PurchaseHistoryEntry_C_SetPurchaseText final
{
public:
	class FText                                   PurchaseText;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bHasBeenRefunded;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PurchaseHistoryEntry_C_SetPurchaseText) == 0x000008, "Wrong alignment on PurchaseHistoryEntry_C_SetPurchaseText");
static_assert(sizeof(PurchaseHistoryEntry_C_SetPurchaseText) == 0x000020, "Wrong size on PurchaseHistoryEntry_C_SetPurchaseText");
static_assert(offsetof(PurchaseHistoryEntry_C_SetPurchaseText, PurchaseText) == 0x000000, "Member 'PurchaseHistoryEntry_C_SetPurchaseText::PurchaseText' has a wrong offset!");
static_assert(offsetof(PurchaseHistoryEntry_C_SetPurchaseText, bHasBeenRefunded) == 0x000018, "Member 'PurchaseHistoryEntry_C_SetPurchaseText::bHasBeenRefunded' has a wrong offset!");

}

