#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMapNodeLayout1Minus1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestMapNodeLayout1-1.QuestMapNodeLayout1-1_C
// 0x0040 (0x02D8 - 0x0298)
class UQuestMapNodeLayout1Minus1_C final : public UFortQuestMapNodeLayout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         Node_Arrows_0;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         Node_Arrows_1;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMapLayoutNode_C*                  Quest0;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMapLayoutNode_C*                  Quest1;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UQuestMiniTile_C*>               Quests;                                            // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_QuestMapNodeLayout1Minus1(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestMapNodeLayout1-1_C">();
	}
	static class UQuestMapNodeLayout1Minus1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMapNodeLayout1Minus1_C>();
	}
};
static_assert(alignof(UQuestMapNodeLayout1Minus1_C) == 0x000008, "Wrong alignment on UQuestMapNodeLayout1Minus1_C");
static_assert(sizeof(UQuestMapNodeLayout1Minus1_C) == 0x0002D8, "Wrong size on UQuestMapNodeLayout1Minus1_C");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, UberGraphFrame) == 0x000298, "Member 'UQuestMapNodeLayout1Minus1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, CanvasPanel) == 0x0002A0, "Member 'UQuestMapNodeLayout1Minus1_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, Node_Arrows_0) == 0x0002A8, "Member 'UQuestMapNodeLayout1Minus1_C::Node_Arrows_0' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, Node_Arrows_1) == 0x0002B0, "Member 'UQuestMapNodeLayout1Minus1_C::Node_Arrows_1' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, Quest0) == 0x0002B8, "Member 'UQuestMapNodeLayout1Minus1_C::Quest0' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, Quest1) == 0x0002C0, "Member 'UQuestMapNodeLayout1Minus1_C::Quest1' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayout1Minus1_C, Quests) == 0x0002C8, "Member 'UQuestMapNodeLayout1Minus1_C::Quests' has a wrong offset!");

}

