#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestTreeEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestTreeEntry.QuestTreeEntry_C
// 0x00B0 (0x0BF0 - 0x0B40)
class UQuestTreeEntry_C final : public UFortQuestTreeItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_QuestExpiresWidget_C*               BP_QuestExpiresWidget;                             // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ExpansionIndicator;                                // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageComplete;                                     // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainOrSubCategory;                                 // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Name_QuestTreeEntry_C;                             // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper;                                 // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PercentageComplete;                                // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PercentageCompleteIndicator;                       // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PinnedEmptyBox;                                    // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PinnedImage;                                       // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PinnedSwitcher;                                    // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               QuestIconOverlay;                                  // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       QuestTreeLazyIcon;                                 // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherProgress;                            // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         CurrentQuest;                                      // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPinned_;                                         // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestCategory*                     CurrentQuestCategory;                              // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TwitchIconColor;                                   // 0x0BD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultIconColor;                                  // 0x0BE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestTreeEntry(int32 EntryPoint);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnDeselected();
	void Destruct();
	void OnQuestSeen_Event_0(class UFortQuestItem* Quest);
	void BP_OnHovered();
	void OnQuestsUpdated();
	void BP_OnSelected();
	void SetupAsQuest(class UFortQuestItem* Category);
	void SetupAsCategory(class UFortQuestCategory* Category);
	void SetPinnedState();
	void Unpin();
	void SetCompletionPercentage();
	void Update_Quest_Item_Bang_State();
	void Update_Quest_Item_Seen();
	void Update_Quest_Category_Bang_State();
	void Quest_Category_Have_Unseen_Quests(bool* HasUnseen);
	void Get_Quest_Item_Def(class UFortQuestItemDefinition** AsFort_Quest_Item_Definition);
	void Set_Quest_Display_Name();
	void Set_Quest_Category_Display_Name();
	void Is_Streaming_Quest(bool* bStreamingQuest);
	void Get_Streaming_Attached_Quest_Name(class FText* ModifiedName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestTreeEntry_C">();
	}
	static class UQuestTreeEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestTreeEntry_C>();
	}
};
static_assert(alignof(UQuestTreeEntry_C) == 0x000008, "Wrong alignment on UQuestTreeEntry_C");
static_assert(sizeof(UQuestTreeEntry_C) == 0x000BF0, "Wrong size on UQuestTreeEntry_C");
static_assert(offsetof(UQuestTreeEntry_C, UberGraphFrame) == 0x000B40, "Member 'UQuestTreeEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, BP_QuestExpiresWidget) == 0x000B48, "Member 'UQuestTreeEntry_C::BP_QuestExpiresWidget' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, ExpansionIndicator) == 0x000B50, "Member 'UQuestTreeEntry_C::ExpansionIndicator' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, ImageComplete) == 0x000B58, "Member 'UQuestTreeEntry_C::ImageComplete' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, MainOrSubCategory) == 0x000B60, "Member 'UQuestTreeEntry_C::MainOrSubCategory' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, Name_QuestTreeEntry_C) == 0x000B68, "Member 'UQuestTreeEntry_C::Name_QuestTreeEntry_C' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, NormalBangWrapper) == 0x000B70, "Member 'UQuestTreeEntry_C::NormalBangWrapper' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, PercentageComplete) == 0x000B78, "Member 'UQuestTreeEntry_C::PercentageComplete' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, PercentageCompleteIndicator) == 0x000B80, "Member 'UQuestTreeEntry_C::PercentageCompleteIndicator' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, PinnedEmptyBox) == 0x000B88, "Member 'UQuestTreeEntry_C::PinnedEmptyBox' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, PinnedImage) == 0x000B90, "Member 'UQuestTreeEntry_C::PinnedImage' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, PinnedSwitcher) == 0x000B98, "Member 'UQuestTreeEntry_C::PinnedSwitcher' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, QuestIconOverlay) == 0x000BA0, "Member 'UQuestTreeEntry_C::QuestIconOverlay' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, QuestTreeLazyIcon) == 0x000BA8, "Member 'UQuestTreeEntry_C::QuestTreeLazyIcon' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, WidgetSwitcherProgress) == 0x000BB0, "Member 'UQuestTreeEntry_C::WidgetSwitcherProgress' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, CurrentQuest) == 0x000BB8, "Member 'UQuestTreeEntry_C::CurrentQuest' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, IsPinned_) == 0x000BC0, "Member 'UQuestTreeEntry_C::IsPinned_' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, CurrentQuestCategory) == 0x000BC8, "Member 'UQuestTreeEntry_C::CurrentQuestCategory' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, TwitchIconColor) == 0x000BD0, "Member 'UQuestTreeEntry_C::TwitchIconColor' has a wrong offset!");
static_assert(offsetof(UQuestTreeEntry_C, DefaultIconColor) == 0x000BE0, "Member 'UQuestTreeEntry_C::DefaultIconColor' has a wrong offset!");

}

