#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMinusRewardCardMinusWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Quest-RewardCard-Widget.Quest-RewardCard-Widget_C.ExecuteUbergraph_Quest-RewardCard-Widget
// 0x0008 (0x0008 - 0x0000)
struct QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget) == 0x000004, "Wrong alignment on QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget");
static_assert(sizeof(QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget) == 0x000008, "Wrong size on QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget, EntryPoint) == 0x000000, "Member 'QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'QuestMinusRewardCardMinusWidget_C_ExecuteUbergraph_QuestMinusRewardCardMinusWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Quest-RewardCard-Widget.Quest-RewardCard-Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct QuestMinusRewardCardMinusWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestMinusRewardCardMinusWidget_C_PreConstruct) == 0x000001, "Wrong alignment on QuestMinusRewardCardMinusWidget_C_PreConstruct");
static_assert(sizeof(QuestMinusRewardCardMinusWidget_C_PreConstruct) == 0x000001, "Wrong size on QuestMinusRewardCardMinusWidget_C_PreConstruct");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'QuestMinusRewardCardMinusWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Quest-RewardCard-Widget.Quest-RewardCard-Widget_C.Item-Setup
// 0x0030 (0x0030 - 0x0000)
struct QuestMinusRewardCardMinusWidget_C_ItemMinusSetup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterialFromRewardItem_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue1;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup) == 0x000008, "Wrong alignment on QuestMinusRewardCardMinusWidget_C_ItemMinusSetup");
static_assert(sizeof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup) == 0x000030, "Wrong size on QuestMinusRewardCardMinusWidget_C_ItemMinusSetup");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, Temp_bool_Variable) == 0x000000, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, Temp_byte_Variable) == 0x000001, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, Temp_byte_Variable1) == 0x000002, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, CallFunc_GetMaterialFromRewardItem_ReturnValue) == 0x000008, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::CallFunc_GetMaterialFromRewardItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000018, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, K2Node_Select_Default) == 0x000020, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusSetup, CallFunc_GetDynamicMaterial_ReturnValue1) == 0x000028, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusSetup::CallFunc_GetDynamicMaterial_ReturnValue1' has a wrong offset!");

// Function Quest-RewardCard-Widget.Quest-RewardCard-Widget_C.Item-DataPolpulate
// 0x0418 (0x0418 - 0x0000)
struct QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate final
{
public:
	class FText                                   CallFunc_TryGetCategory_OutCategoryDisplayName;    // 0x0000(0x0018)()
	bool                                          CallFunc_TryGetCategory_OutHasIcon;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    CallFunc_TryGetCategory_OutCategoryIconBrush;      // 0x0020(0x0330)()
	bool                                          CallFunc_TryGetCategory_ReturnValue;               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue;         // 0x0358(0x0028)(HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0390(0x0080)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0413(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate) == 0x000008, "Wrong alignment on QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate");
static_assert(sizeof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate) == 0x000418, "Wrong size on QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_TryGetCategory_OutCategoryDisplayName) == 0x000000, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_TryGetCategory_OutCategoryDisplayName' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_TryGetCategory_OutHasIcon) == 0x000018, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_TryGetCategory_OutHasIcon' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_TryGetCategory_OutCategoryIconBrush) == 0x000020, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_TryGetCategory_OutCategoryIconBrush' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_TryGetCategory_ReturnValue) == 0x000350, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_TryGetCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_GetLargePreviewImage_ReturnValue) == 0x000358, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_GetLargePreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000380, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_GetRarity_ReturnValue) == 0x000388, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_IsValid_ReturnValue) == 0x000389, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, CallFunc_BPGetRarityData_ReturnValue) == 0x000390, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, Temp_byte_Variable) == 0x000410, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, Temp_byte_Variable1) == 0x000411, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, Temp_bool_Variable) == 0x000412, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate, K2Node_Select_Default) == 0x000413, "Member 'QuestMinusRewardCardMinusWidget_C_ItemMinusDataPolpulate::K2Node_Select_Default' has a wrong offset!");

// Function Quest-RewardCard-Widget.Quest-RewardCard-Widget_C.GetMaterialFromRewardItem
// 0x0040 (0x0040 - 0x0000)
struct QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetItemType_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select1_Default;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem) == 0x000008, "Wrong alignment on QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem");
static_assert(sizeof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem) == 0x000040, "Wrong size on QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, ReturnValue) == 0x000000, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, Temp_object_Variable) == 0x000008, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, Temp_bool_Variable) == 0x000010, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, Temp_object_Variable1) == 0x000018, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, Temp_object_Variable2) == 0x000020, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, Temp_bool_Variable1) == 0x000028, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, CallFunc_GetItemType_ReturnValue) == 0x000029, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x00002B, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00002C, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, K2Node_Select_Default) == 0x000030, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem, K2Node_Select1_Default) == 0x000038, "Member 'QuestMinusRewardCardMinusWidget_C_GetMaterialFromRewardItem::K2Node_Select1_Default' has a wrong offset!");

}

