#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMinusRewardCardMinusWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest-RewardCard-Widget.Quest-RewardCard-Widget_C
// 0x0068 (0x02A0 - 0x0238)
class UQuestMinusRewardCardMinusWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CardBackground;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CardBottomBorder;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CardComposition;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CardShadow;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CardSheen;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconItemtype;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemDefinition*                    CardType;                                          // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusCardComp;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusCardBottomBorder;                          // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShadowOff;                                         // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              ItemToRepresent;                                   // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSetTextureParams;                               // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_QuestMinusRewardCardMinusWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ItemMinusSetup();
	void ItemMinusDataPolpulate();
	void Card_Initialize();
	class UMaterialInterface* GetMaterialFromRewardItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest-RewardCard-Widget_C">();
	}
	static class UQuestMinusRewardCardMinusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMinusRewardCardMinusWidget_C>();
	}
};
static_assert(alignof(UQuestMinusRewardCardMinusWidget_C) == 0x000008, "Wrong alignment on UQuestMinusRewardCardMinusWidget_C");
static_assert(sizeof(UQuestMinusRewardCardMinusWidget_C) == 0x0002A0, "Wrong size on UQuestMinusRewardCardMinusWidget_C");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, UberGraphFrame) == 0x000238, "Member 'UQuestMinusRewardCardMinusWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CardBackground) == 0x000240, "Member 'UQuestMinusRewardCardMinusWidget_C::CardBackground' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CardBottomBorder) == 0x000248, "Member 'UQuestMinusRewardCardMinusWidget_C::CardBottomBorder' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CardComposition) == 0x000250, "Member 'UQuestMinusRewardCardMinusWidget_C::CardComposition' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CardShadow) == 0x000258, "Member 'UQuestMinusRewardCardMinusWidget_C::CardShadow' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CardSheen) == 0x000260, "Member 'UQuestMinusRewardCardMinusWidget_C::CardSheen' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, IconItemtype) == 0x000268, "Member 'UQuestMinusRewardCardMinusWidget_C::IconItemtype' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CardType) == 0x000270, "Member 'UQuestMinusRewardCardMinusWidget_C::CardType' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, MIDMinusCardComp) == 0x000278, "Member 'UQuestMinusRewardCardMinusWidget_C::MIDMinusCardComp' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, MIDMinusCardBottomBorder) == 0x000280, "Member 'UQuestMinusRewardCardMinusWidget_C::MIDMinusCardBottomBorder' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, ShadowOff) == 0x000288, "Member 'UQuestMinusRewardCardMinusWidget_C::ShadowOff' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, ItemToRepresent) == 0x000290, "Member 'UQuestMinusRewardCardMinusWidget_C::ItemToRepresent' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCardMinusWidget_C, CanSetTextureParams) == 0x000298, "Member 'UQuestMinusRewardCardMinusWidget_C::CanSetTextureParams' has a wrong offset!");

}

