#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMapNodeLayoutMinus1Minus1Minus1Minus1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestMapNodeLayout-1-1-1-1.QuestMapNodeLayout-1-1-1-1_C
// 0x0040 (0x02D8 - 0x0298)
class UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C final : public UFortQuestMapNodeLayout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         Node_Arrows_0;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         Node_Arrows_1;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMapLayoutNode_C*                  Quest0;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMapLayoutNode_C*                  Quest1;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMapLayoutNode_C*                  Quest2;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMapLayoutNode_C*                  Quest3;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestMapNodeLayoutMinus1Minus1Minus1Minus1(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestMapNodeLayout-1-1-1-1_C">();
	}
	static class UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C>();
	}
};
static_assert(alignof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C) == 0x000008, "Wrong alignment on UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C");
static_assert(sizeof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C) == 0x0002D8, "Wrong size on UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, UberGraphFrame) == 0x000298, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, CanvasPanel) == 0x0002A0, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, Node_Arrows_0) == 0x0002A8, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::Node_Arrows_0' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, Node_Arrows_1) == 0x0002B0, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::Node_Arrows_1' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, Quest0) == 0x0002B8, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::Quest0' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, Quest1) == 0x0002C0, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::Quest1' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, Quest2) == 0x0002C8, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::Quest2' has a wrong offset!");
static_assert(offsetof(UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C, Quest3) == 0x0002D0, "Member 'UQuestMapNodeLayoutMinus1Minus1Minus1Minus1_C::Quest3' has a wrong offset!");

}

