#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMiniTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestMiniTile.QuestMiniTile_C
// 0x00C0 (0x02F8 - 0x0238)
class UQuestMiniTile_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseSelectedTileBackground;                       // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PulseSelectedTileBackgroundAndIcon;                // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          BorderShell;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BottomTextQuest;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonQuest;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_C*                                Node_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_C*                                Node_Selected;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestTypeIcon;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxShell;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TopTextQuest;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest_Item_Def;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               Proto_Item_Def;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           TilePulseTimer;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Text_On_Bottom;                               // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          UseHighContrast;                                   // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          OverrideWidth;                                     // 0x02B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          OverrideHeight;                                    // 0x02B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Width;                                             // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Height;                                            // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   HandleQuestTileHovered;                            // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HandleQuestTileUnhovered;                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AllowSelection;                                    // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Label_Text_Style;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseTinyMode;                                       // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void HandleQuestTileHovered__DelegateSignature(class UFortQuestItemDefinition* QuestItemDef);
	void HandleQuestTileUnhovered__DelegateSignature(class UFortQuestItemDefinition* QuestItemDef);
	void ExecuteUbergraph_QuestMiniTile(int32 EntryPoint);
	void Construct();
	void BndEvt__ButtonQuest_K2Node_ComponentBoundEvent_4_CommonSelectedStateChanged__DelegateSignature(class UCommonButton* Button, bool Selected);
	void BndEvt__ButtonQuest_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonQuest_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonQuest_K2Node_ComponentBoundEvent_113_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void Init();
	void SetState(class UFortQuestItem* InCurrentQuest, bool* QuestFound);
	void ToggleCurrentQuestTileTimer(bool IsEnabled);
	void PlayTileAnimation();
	void SetStateAndFindIncompleteQuest(bool* QuestFound);
	void HandleSizeOverrides();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestMiniTile_C">();
	}
	static class UQuestMiniTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMiniTile_C>();
	}
};
static_assert(alignof(UQuestMiniTile_C) == 0x000008, "Wrong alignment on UQuestMiniTile_C");
static_assert(sizeof(UQuestMiniTile_C) == 0x0002F8, "Wrong size on UQuestMiniTile_C");
static_assert(offsetof(UQuestMiniTile_C, UberGraphFrame) == 0x000238, "Member 'UQuestMiniTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, PulseSelectedTileBackground) == 0x000240, "Member 'UQuestMiniTile_C::PulseSelectedTileBackground' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, PulseSelectedTileBackgroundAndIcon) == 0x000248, "Member 'UQuestMiniTile_C::PulseSelectedTileBackgroundAndIcon' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, BorderShell) == 0x000250, "Member 'UQuestMiniTile_C::BorderShell' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, BottomTextQuest) == 0x000258, "Member 'UQuestMiniTile_C::BottomTextQuest' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, ButtonQuest) == 0x000260, "Member 'UQuestMiniTile_C::ButtonQuest' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Node_Background) == 0x000268, "Member 'UQuestMiniTile_C::Node_Background' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Node_Selected) == 0x000270, "Member 'UQuestMiniTile_C::Node_Selected' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, QuestTypeIcon) == 0x000278, "Member 'UQuestMiniTile_C::QuestTypeIcon' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, ScaleBox_0) == 0x000280, "Member 'UQuestMiniTile_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, SizeBoxShell) == 0x000288, "Member 'UQuestMiniTile_C::SizeBoxShell' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, TopTextQuest) == 0x000290, "Member 'UQuestMiniTile_C::TopTextQuest' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Quest_Item_Def) == 0x000298, "Member 'UQuestMiniTile_C::Quest_Item_Def' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Proto_Item_Def) == 0x0002A0, "Member 'UQuestMiniTile_C::Proto_Item_Def' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, TilePulseTimer) == 0x0002A8, "Member 'UQuestMiniTile_C::TilePulseTimer' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Show_Text_On_Bottom) == 0x0002B0, "Member 'UQuestMiniTile_C::Show_Text_On_Bottom' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, UseHighContrast) == 0x0002B1, "Member 'UQuestMiniTile_C::UseHighContrast' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, OverrideWidth) == 0x0002B2, "Member 'UQuestMiniTile_C::OverrideWidth' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, OverrideHeight) == 0x0002B3, "Member 'UQuestMiniTile_C::OverrideHeight' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Width) == 0x0002B4, "Member 'UQuestMiniTile_C::Width' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Height) == 0x0002B8, "Member 'UQuestMiniTile_C::Height' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, HandleQuestTileHovered) == 0x0002C0, "Member 'UQuestMiniTile_C::HandleQuestTileHovered' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, HandleQuestTileUnhovered) == 0x0002D0, "Member 'UQuestMiniTile_C::HandleQuestTileUnhovered' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, AllowSelection) == 0x0002E0, "Member 'UQuestMiniTile_C::AllowSelection' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, Label_Text_Style) == 0x0002E8, "Member 'UQuestMiniTile_C::Label_Text_Style' has a wrong offset!");
static_assert(offsetof(UQuestMiniTile_C, UseTinyMode) == 0x0002F0, "Member 'UQuestMiniTile_C::UseTinyMode' has a wrong offset!");

}

