#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMapLayoutNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestMapLayoutNode.QuestMapLayoutNode_C
// 0x0018 (0x0270 - 0x0258)
class UQuestMapLayoutNode_C final : public UFortLayoutQuestNode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Quest_Tile_Show_Bottom_Text;                       // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               Quest_Tile_Item_Def;                               // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestMapLayoutNode(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetQuestTileProps();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestMapLayoutNode_C">();
	}
	static class UQuestMapLayoutNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMapLayoutNode_C>();
	}
};
static_assert(alignof(UQuestMapLayoutNode_C) == 0x000008, "Wrong alignment on UQuestMapLayoutNode_C");
static_assert(sizeof(UQuestMapLayoutNode_C) == 0x000270, "Wrong size on UQuestMapLayoutNode_C");
static_assert(offsetof(UQuestMapLayoutNode_C, UberGraphFrame) == 0x000258, "Member 'UQuestMapLayoutNode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestMapLayoutNode_C, Quest_Tile_Show_Bottom_Text) == 0x000260, "Member 'UQuestMapLayoutNode_C::Quest_Tile_Show_Bottom_Text' has a wrong offset!");
static_assert(offsetof(UQuestMapLayoutNode_C, Quest_Tile_Item_Def) == 0x000268, "Member 'UQuestMapLayoutNode_C::Quest_Tile_Item_Def' has a wrong offset!");

}

