#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMinusRewardCards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest-RewardCards.Quest-RewardCards_C
// 0x0148 (0x0390 - 0x0248)
class UQuestMinusRewardCards_C final : public UFortQuestMapCosmeticListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroMinusFourReward;                              // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroMinusThreeReward;                             // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroMinusTwoReward;                               // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroMinusOneReward;                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BounceMinusFourReward;                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BounceMinusThreeReward;                            // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BounceMinusTwoReward;                              // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BounceMinusOneReward;                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ChoiceRewardMinusQuestionMark;                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget1a;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget2a;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget2b;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget3a;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget3b;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget3c;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget4a;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget4b;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget4c;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMinusRewardCardMinusWidget_C*     RewardCardWidget4d;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlareMinus01;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlareMinus02;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlareMinus03;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewardFlareMinus04;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           OneCardMinusRarity;                                // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusFlareMinus01;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusFlareMinus02;                              // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusFareMinus03;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDMinusFlareMinus04;                              // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GlowColorMinusOveride;                             // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ExplicitMinusGlowColor;                            // 0x0344(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChoiceRewardMinusOveride;                          // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             ChoiceMaterialArray;                               // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Widget_Index;                                      // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    Card_Slot_01;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Card_Slot_02;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Card_Slot_03;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Card_Slot_04;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestMinusRewardCards(int32 EntryPoint);
	void UpdateCosmeticListDisplay();
	void Construct();
	void HandleIntroComplete();
	void WidgetSetUp();
	void PopulateCards(TArray<class UFortItemDefinition*>& InItemDefinitions);
	void PlayBounceLoop();
	void PlayIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest-RewardCards_C">();
	}
	static class UQuestMinusRewardCards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMinusRewardCards_C>();
	}
};
static_assert(alignof(UQuestMinusRewardCards_C) == 0x000008, "Wrong alignment on UQuestMinusRewardCards_C");
static_assert(sizeof(UQuestMinusRewardCards_C) == 0x000390, "Wrong size on UQuestMinusRewardCards_C");
static_assert(offsetof(UQuestMinusRewardCards_C, UberGraphFrame) == 0x000248, "Member 'UQuestMinusRewardCards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, IntroMinusFourReward) == 0x000250, "Member 'UQuestMinusRewardCards_C::IntroMinusFourReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, IntroMinusThreeReward) == 0x000258, "Member 'UQuestMinusRewardCards_C::IntroMinusThreeReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, IntroMinusTwoReward) == 0x000260, "Member 'UQuestMinusRewardCards_C::IntroMinusTwoReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, IntroMinusOneReward) == 0x000268, "Member 'UQuestMinusRewardCards_C::IntroMinusOneReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, BounceMinusFourReward) == 0x000270, "Member 'UQuestMinusRewardCards_C::BounceMinusFourReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, BounceMinusThreeReward) == 0x000278, "Member 'UQuestMinusRewardCards_C::BounceMinusThreeReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, BounceMinusTwoReward) == 0x000280, "Member 'UQuestMinusRewardCards_C::BounceMinusTwoReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, BounceMinusOneReward) == 0x000288, "Member 'UQuestMinusRewardCards_C::BounceMinusOneReward' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, ChoiceRewardMinusQuestionMark) == 0x000290, "Member 'UQuestMinusRewardCards_C::ChoiceRewardMinusQuestionMark' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, CommonWidgetSwitcher_0) == 0x000298, "Member 'UQuestMinusRewardCards_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget1a) == 0x0002A0, "Member 'UQuestMinusRewardCards_C::RewardCardWidget1a' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget2a) == 0x0002A8, "Member 'UQuestMinusRewardCards_C::RewardCardWidget2a' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget2b) == 0x0002B0, "Member 'UQuestMinusRewardCards_C::RewardCardWidget2b' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget3a) == 0x0002B8, "Member 'UQuestMinusRewardCards_C::RewardCardWidget3a' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget3b) == 0x0002C0, "Member 'UQuestMinusRewardCards_C::RewardCardWidget3b' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget3c) == 0x0002C8, "Member 'UQuestMinusRewardCards_C::RewardCardWidget3c' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget4a) == 0x0002D0, "Member 'UQuestMinusRewardCards_C::RewardCardWidget4a' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget4b) == 0x0002D8, "Member 'UQuestMinusRewardCards_C::RewardCardWidget4b' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget4c) == 0x0002E0, "Member 'UQuestMinusRewardCards_C::RewardCardWidget4c' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardCardWidget4d) == 0x0002E8, "Member 'UQuestMinusRewardCards_C::RewardCardWidget4d' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardFlareMinus01) == 0x0002F0, "Member 'UQuestMinusRewardCards_C::RewardFlareMinus01' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardFlareMinus02) == 0x0002F8, "Member 'UQuestMinusRewardCards_C::RewardFlareMinus02' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardFlareMinus03) == 0x000300, "Member 'UQuestMinusRewardCards_C::RewardFlareMinus03' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, RewardFlareMinus04) == 0x000308, "Member 'UQuestMinusRewardCards_C::RewardFlareMinus04' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, OneCardMinusRarity) == 0x000310, "Member 'UQuestMinusRewardCards_C::OneCardMinusRarity' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, MIDMinusFlareMinus01) == 0x000320, "Member 'UQuestMinusRewardCards_C::MIDMinusFlareMinus01' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, MIDMinusFlareMinus02) == 0x000328, "Member 'UQuestMinusRewardCards_C::MIDMinusFlareMinus02' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, MIDMinusFareMinus03) == 0x000330, "Member 'UQuestMinusRewardCards_C::MIDMinusFareMinus03' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, MIDMinusFlareMinus04) == 0x000338, "Member 'UQuestMinusRewardCards_C::MIDMinusFlareMinus04' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, GlowColorMinusOveride) == 0x000340, "Member 'UQuestMinusRewardCards_C::GlowColorMinusOveride' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, ExplicitMinusGlowColor) == 0x000344, "Member 'UQuestMinusRewardCards_C::ExplicitMinusGlowColor' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, ChoiceRewardMinusOveride) == 0x000354, "Member 'UQuestMinusRewardCards_C::ChoiceRewardMinusOveride' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, ChoiceMaterialArray) == 0x000358, "Member 'UQuestMinusRewardCards_C::ChoiceMaterialArray' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, Widget_Index) == 0x000368, "Member 'UQuestMinusRewardCards_C::Widget_Index' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, Card_Slot_01) == 0x000370, "Member 'UQuestMinusRewardCards_C::Card_Slot_01' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, Card_Slot_02) == 0x000378, "Member 'UQuestMinusRewardCards_C::Card_Slot_02' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, Card_Slot_03) == 0x000380, "Member 'UQuestMinusRewardCards_C::Card_Slot_03' has a wrong offset!");
static_assert(offsetof(UQuestMinusRewardCards_C, Card_Slot_04) == 0x000388, "Member 'UQuestMinusRewardCards_C::Card_Slot_04' has a wrong offset!");

}

