#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestScanningRobot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QuestScanningRobot.QuestScanningRobot_C
// 0x0020 (0x0788 - 0x0768)
class AQuestScanningRobot_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BaseBotGame;                                       // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestScanningRobot(int32 EntryPoint);
	void Animdone(class UAnimMontage* Montage, bool bInterrupted);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestScanningRobot_C">();
	}
	static class AQuestScanningRobot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AQuestScanningRobot_C>();
	}
};
static_assert(alignof(AQuestScanningRobot_C) == 0x000008, "Wrong alignment on AQuestScanningRobot_C");
static_assert(sizeof(AQuestScanningRobot_C) == 0x000788, "Wrong size on AQuestScanningRobot_C");
static_assert(offsetof(AQuestScanningRobot_C, UberGraphFrame) == 0x000768, "Member 'AQuestScanningRobot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AQuestScanningRobot_C, BaseBotGame) == 0x000770, "Member 'AQuestScanningRobot_C::BaseBotGame' has a wrong offset!");
static_assert(offsetof(AQuestScanningRobot_C, SkeletalMesh) == 0x000778, "Member 'AQuestScanningRobot_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AQuestScanningRobot_C, DefaultSceneRoot) == 0x000780, "Member 'AQuestScanningRobot_C::DefaultSceneRoot' has a wrong offset!");

}

