#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RefundConfirmationModal

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RefundConfirmationModal.RefundConfirmationModal_C.ExecuteUbergraph_RefundConfirmationModal
// 0x0170 (0x0170 - 0x0000)
struct RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RefundsRemaining;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalRefunds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0090(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x00E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0150(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal) == 0x000008, "Wrong alignment on RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal");
static_assert(sizeof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal) == 0x000170, "Wrong size on RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, EntryPoint) == 0x000000, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_Event_RefundsRemaining) == 0x000004, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_Event_RefundsRemaining' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_Event_TotalRefunds) == 0x000008, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_Event_TotalRefunds' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_MakeStruct_FormatArgumentData1) == 0x000050, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_MakeStruct_FormatArgumentData2) == 0x000090, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_MakeArray_Array) == 0x0000D8, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_MakeStruct_FormatArgumentData3) == 0x0000E8, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, CallFunc_Format_ReturnValue) == 0x000128, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, K2Node_MakeArray_Array1) == 0x000140, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, CallFunc_Format_ReturnValue1) == 0x000150, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000168, "Member 'RefundConfirmationModal_C_ExecuteUbergraph_RefundConfirmationModal::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");

// Function RefundConfirmationModal.RefundConfirmationModal_C.SetRefundsRemainingText
// 0x0008 (0x0008 - 0x0000)
struct RefundConfirmationModal_C_SetRefundsRemainingText final
{
public:
	int32                                         RefundsRemaining;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRefunds;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RefundConfirmationModal_C_SetRefundsRemainingText) == 0x000004, "Wrong alignment on RefundConfirmationModal_C_SetRefundsRemainingText");
static_assert(sizeof(RefundConfirmationModal_C_SetRefundsRemainingText) == 0x000008, "Wrong size on RefundConfirmationModal_C_SetRefundsRemainingText");
static_assert(offsetof(RefundConfirmationModal_C_SetRefundsRemainingText, RefundsRemaining) == 0x000000, "Member 'RefundConfirmationModal_C_SetRefundsRemainingText::RefundsRemaining' has a wrong offset!");
static_assert(offsetof(RefundConfirmationModal_C_SetRefundsRemainingText, TotalRefunds) == 0x000004, "Member 'RefundConfirmationModal_C_SetRefundsRemainingText::TotalRefunds' has a wrong offset!");

}

