#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReportPlayer.ReportPlayer_C
// 0x0140 (0x0508 - 0x03C8)
class UReportPlayer_C final : public UFeedbackReportPlayerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ImageLoaded;                                       // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReportSent;                                        // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      B_Tab_AdditionalInfo;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      B_Tab_PlayerName;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      B_Tab_Reason;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_ReportFinished;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCurrentReportStackingEntry_C*          CurrentReportStackingEntry;                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_34;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox_0;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_StackingEntry;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MainPanelContent;                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_TabContent;                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_PlayerReporting;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_StackingEntryContainer;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ModalHeader_Title;                                 // 0x0458(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TabTitle_PlayerName;                               // 0x0470(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TabTitle_AdditionalInfo;                           // 0x0488(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TabTitle_TabReason;                                // 0x04A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ButtonLabel_SendPlayerReport;                      // 0x04B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UIconTextButton_C*>              TabButtons;                                        // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FDataTableRowHandle                    BackAction;                                        // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UCurrentReportStackingEntry_C*>  StackingSelectedDisplays;                          // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          ImagedLoadComplete;                                // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ReportPlayer(int32 EntryPoint);
	void OnFeedbackSentSuccessful_1();
	void BndEvt__Button_ReportFinished_K2Node_ComponentBoundEvent_138_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Send_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnListViewSelectionMade(EPlayerReportingStep ReportingStep, const class FText& SelectedText);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__B_Tab_AdditionalInfo_K2Node_ComponentBoundEvent_35_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__B_Tab_Reason_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__B_Tab_PlayerName_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnPopulateView(EPlayerReportingStep CurrentStep);
	void OnActivated();
	void OnTabClicked(class UCommonButton* Button);
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_1184_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void OnLoaded_69F2E4A6451E92C2AF9C36808D6C297B(class UObject* Loaded);
	void HandleBottomBarBackButtonClicked(bool* Passhtrough);
	void EnableTabByCurrentStep(EPlayerReportingStep CurrentStep);
	void SetEnableTabButton(class UIconTextButton_C* InTabButton, bool Param_bIsEnabled);
	void HandleTabsByCurrentStep(EPlayerReportingStep CurStep);
	void DisableTabsByCurrentStep(EPlayerReportingStep CurStep);
	void HandleDisplayNewReportPlayerEntryItemSelection(EPlayerReportingStep DisplayedStep, const class FText& DisplayedText);
	void RemoveStackedEntriesByStep(EPlayerReportingStep CurrentStep);
	void ClearStackingEntries();
	void ResetAnims();
	void ResetSwitcherStates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReportPlayer_C">();
	}
	static class UReportPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReportPlayer_C>();
	}
};
static_assert(alignof(UReportPlayer_C) == 0x000008, "Wrong alignment on UReportPlayer_C");
static_assert(sizeof(UReportPlayer_C) == 0x000508, "Wrong size on UReportPlayer_C");
static_assert(offsetof(UReportPlayer_C, UberGraphFrame) == 0x0003C8, "Member 'UReportPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, ImageLoaded) == 0x0003D0, "Member 'UReportPlayer_C::ImageLoaded' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, ReportSent) == 0x0003D8, "Member 'UReportPlayer_C::ReportSent' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, Intro) == 0x0003E0, "Member 'UReportPlayer_C::Intro' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, B_Tab_AdditionalInfo) == 0x0003E8, "Member 'UReportPlayer_C::B_Tab_AdditionalInfo' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, B_Tab_PlayerName) == 0x0003F0, "Member 'UReportPlayer_C::B_Tab_PlayerName' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, B_Tab_Reason) == 0x0003F8, "Member 'UReportPlayer_C::B_Tab_Reason' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, Button_ReportFinished) == 0x000400, "Member 'UReportPlayer_C::Button_ReportFinished' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, CircularThrobber_0) == 0x000408, "Member 'UReportPlayer_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, CurrentReportStackingEntry) == 0x000410, "Member 'UReportPlayer_C::CurrentReportStackingEntry' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, Image_34) == 0x000418, "Member 'UReportPlayer_C::Image_34' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, Lightbox_0) == 0x000420, "Member 'UReportPlayer_C::Lightbox_0' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, SafeZone_0) == 0x000428, "Member 'UReportPlayer_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, SB_StackingEntry) == 0x000430, "Member 'UReportPlayer_C::SB_StackingEntry' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, Switcher_MainPanelContent) == 0x000438, "Member 'UReportPlayer_C::Switcher_MainPanelContent' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, Switcher_TabContent) == 0x000440, "Member 'UReportPlayer_C::Switcher_TabContent' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, T_PlayerReporting) == 0x000448, "Member 'UReportPlayer_C::T_PlayerReporting' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, VB_StackingEntryContainer) == 0x000450, "Member 'UReportPlayer_C::VB_StackingEntryContainer' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, ModalHeader_Title) == 0x000458, "Member 'UReportPlayer_C::ModalHeader_Title' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, TabTitle_PlayerName) == 0x000470, "Member 'UReportPlayer_C::TabTitle_PlayerName' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, TabTitle_AdditionalInfo) == 0x000488, "Member 'UReportPlayer_C::TabTitle_AdditionalInfo' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, TabTitle_TabReason) == 0x0004A0, "Member 'UReportPlayer_C::TabTitle_TabReason' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, ButtonLabel_SendPlayerReport) == 0x0004B8, "Member 'UReportPlayer_C::ButtonLabel_SendPlayerReport' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, TabButtons) == 0x0004D0, "Member 'UReportPlayer_C::TabButtons' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, BackAction) == 0x0004E0, "Member 'UReportPlayer_C::BackAction' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, StackingSelectedDisplays) == 0x0004F0, "Member 'UReportPlayer_C::StackingSelectedDisplays' has a wrong offset!");
static_assert(offsetof(UReportPlayer_C, ImagedLoadComplete) == 0x000500, "Member 'UReportPlayer_C::ImagedLoadComplete' has a wrong offset!");

}

