#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportablePlayerReasonEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReportablePlayerReasonEntry.ReportablePlayerReasonEntry_C
// 0x0018 (0x0B60 - 0x0B48)
class UReportablePlayerReasonEntry_C final : public UFeedbackReportPlayerReasonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ReportablePlayerReasonEntry(int32 EntryPoint);
	void SetSelectionState(bool bIsSelected, bool bAnimateOnSelect);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReportablePlayerReasonEntry_C">();
	}
	static class UReportablePlayerReasonEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReportablePlayerReasonEntry_C>();
	}
};
static_assert(alignof(UReportablePlayerReasonEntry_C) == 0x000008, "Wrong alignment on UReportablePlayerReasonEntry_C");
static_assert(sizeof(UReportablePlayerReasonEntry_C) == 0x000B60, "Wrong size on UReportablePlayerReasonEntry_C");
static_assert(offsetof(UReportablePlayerReasonEntry_C, UberGraphFrame) == 0x000B48, "Member 'UReportablePlayerReasonEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReportablePlayerReasonEntry_C, Image_0) == 0x000B50, "Member 'UReportablePlayerReasonEntry_C::Image_0' has a wrong offset!");
static_assert(offsetof(UReportablePlayerReasonEntry_C, VerticalBox_0) == 0x000B58, "Member 'UReportablePlayerReasonEntry_C::VerticalBox_0' has a wrong offset!");

}

