#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardsListEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RewardListEntryType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RewardsListEntry.RewardsListEntry_C.ExecuteUbergraph_RewardsListEntry
// 0x02A8 (0x02A8 - 0x0000)
struct RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0040(0x0028)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0068(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue1;              // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x00E0(0x0028)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0120(0x0018)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue1;              // 0x0138(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPrimaryCategory_ItemCategoryText;      // 0x0158(0x0018)()
	bool                                          CallFunc_GetPrimaryCategory_ReturnValue;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPrimaryCategory_ItemCategoryText1;     // 0x0178(0x0018)()
	bool                                          CallFunc_GetPrimaryCategory_ReturnValue1;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0198(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue2;              // 0x01D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x01F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0240(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue1;        // 0x0258(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue2;        // 0x0280(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry) == 0x000008, "Wrong alignment on RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry");
static_assert(sizeof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry) == 0x0002A8, "Wrong size on RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, EntryPoint) == 0x000000, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetRarityColor_ReturnValue) == 0x000004, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x000040, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetDisplayName_ReturnValue) == 0x000068, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetRarityColor_ReturnValue1) == 0x0000C0, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetRarityColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeArray_Array) == 0x0000D0, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeStruct_SlateColor1) == 0x0000E0, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_Format_ReturnValue) == 0x000108, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetEmptyText_ReturnValue) == 0x000120, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetDisplayName_ReturnValue1) == 0x000138, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetDisplayName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000150, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetPrimaryCategory_ItemCategoryText) == 0x000158, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetPrimaryCategory_ItemCategoryText' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetPrimaryCategory_ReturnValue) == 0x000170, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetPrimaryCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetPrimaryCategory_ItemCategoryText1) == 0x000178, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetPrimaryCategory_ItemCategoryText1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetPrimaryCategory_ReturnValue1) == 0x000190, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetPrimaryCategory_ReturnValue1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeStruct_FormatArgumentData1) == 0x000198, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetDisplayName_ReturnValue2) == 0x0001D8, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetDisplayName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeStruct_FormatArgumentData2) == 0x0001F0, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, K2Node_MakeArray_Array1) == 0x000230, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_Format_ReturnValue1) == 0x000240, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetSmallPreviewImage_ReturnValue1) == 0x000258, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetSmallPreviewImage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry, CallFunc_GetSmallPreviewImage_ReturnValue2) == 0x000280, "Member 'RewardsListEntry_C_ExecuteUbergraph_RewardsListEntry::CallFunc_GetSmallPreviewImage_ReturnValue2' has a wrong offset!");

// Function RewardsListEntry.RewardsListEntry_C.SetReward
// 0x0040 (0x0040 - 0x0000)
struct RewardsListEntry_C_SetReward final
{
public:
	ERewardListEntryType                          InRewardType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              InRewardItem;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            InTextColor;                                       // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardsListEntry_C_SetReward) == 0x000008, "Wrong alignment on RewardsListEntry_C_SetReward");
static_assert(sizeof(RewardsListEntry_C_SetReward) == 0x000040, "Wrong size on RewardsListEntry_C_SetReward");
static_assert(offsetof(RewardsListEntry_C_SetReward, InRewardType) == 0x000000, "Member 'RewardsListEntry_C_SetReward::InRewardType' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_SetReward, InRewardItem) == 0x000008, "Member 'RewardsListEntry_C_SetReward::InRewardItem' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_SetReward, InTextColor) == 0x000010, "Member 'RewardsListEntry_C_SetReward::InTextColor' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_SetReward, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'RewardsListEntry_C_SetReward::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function RewardsListEntry.RewardsListEntry_C.UpdateReward
// 0x00A8 (0x00A8 - 0x0000)
struct RewardsListEntry_C_UpdateReward final
{
public:
	ERewardListEntryType                          InRewardType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            InTextColor;                                       // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WouldExceedMaxStackSize_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardListEntryType                          Temp_byte_Variable6;                               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardListEntryType                          Temp_byte_Variable10;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0068(0x0018)()
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumInStack_ReturnValue1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue1;                     // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardsListEntry_C_UpdateReward) == 0x000008, "Wrong alignment on RewardsListEntry_C_UpdateReward");
static_assert(sizeof(RewardsListEntry_C_UpdateReward) == 0x0000A8, "Wrong size on RewardsListEntry_C_UpdateReward");
static_assert(offsetof(RewardsListEntry_C_UpdateReward, InRewardType) == 0x000000, "Member 'RewardsListEntry_C_UpdateReward::InRewardType' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_UpdateReward, InTextColor) == 0x000008, "Member 'RewardsListEntry_C_UpdateReward::InTextColor' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_UpdateReward, Temp_bool_Variable) == 0x000030, "Member 'RewardsListEntry_C_UpdateReward::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RewardsListEntry_C_UpdateReward, Temp_byte_Variable) == 0x000031, "Member 'RewardsListEntry_C_UpdateReward::Temp_byte_Variable' has a wrong offset!");
