#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RootProfileStatsScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.ExecuteUbergraph_RootProfileStatsScreen
// 0x0050 (0x0050 - 0x0000)
struct RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen");
static_assert(sizeof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen) == 0x000050, "Wrong size on RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, EntryPoint) == 0x000000, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_ComponentBoundEvent_Button2) == 0x000018, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_ComponentBoundEvent_Button1) == 0x000020, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_ComponentBoundEvent_TabId) == 0x000030, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_ComponentBoundEvent_TabButton) == 0x000038, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000040, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'RootProfileStatsScreen_C_ExecuteUbergraph_RootProfileStatsScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'RootProfileStatsScreen_C_BndEvt__TopTabList_K2Node_ComponentBoundEvent_2_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RootProfileStatsScreen_C_BndEvt__PlaylistBucketChanger_K2Node_ComponentBoundEvent_147_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RootProfileStatsScreen_C_BndEvt__StatSetLeftBtn_K2Node_ComponentBoundEvent_104_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'RootProfileStatsScreen_C_BndEvt__StatSetRightBtn_K2Node_ComponentBoundEvent_87_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct RootProfileStatsScreen_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RootProfileStatsScreen_C_HandleBack) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_HandleBack");
static_assert(sizeof(RootProfileStatsScreen_C_HandleBack) == 0x000010, "Wrong size on RootProfileStatsScreen_C_HandleBack");
static_assert(offsetof(RootProfileStatsScreen_C_HandleBack, PassThrough) == 0x000000, "Member 'RootProfileStatsScreen_C_HandleBack::PassThrough' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_HandleBack, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'RootProfileStatsScreen_C_HandleBack::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.UpdatePlaylist
// 0x0030 (0x0030 - 0x0000)
struct RootProfileStatsScreen_C_UpdatePlaylist final
{
public:
	class FText                                   CallFunc_GetCurrentPlaylistName_ReturnValue;       // 0x0000(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(RootProfileStatsScreen_C_UpdatePlaylist) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_UpdatePlaylist");
static_assert(sizeof(RootProfileStatsScreen_C_UpdatePlaylist) == 0x000030, "Wrong size on RootProfileStatsScreen_C_UpdatePlaylist");
static_assert(offsetof(RootProfileStatsScreen_C_UpdatePlaylist, CallFunc_GetCurrentPlaylistName_ReturnValue) == 0x000000, "Member 'RootProfileStatsScreen_C_UpdatePlaylist::CallFunc_GetCurrentPlaylistName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_UpdatePlaylist, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'RootProfileStatsScreen_C_UpdatePlaylist::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function RootProfileStatsScreen.RootProfileStatsScreen_C.UpdateStatSet
// 0x0048 (0x0048 - 0x0000)
struct RootProfileStatsScreen_C_UpdateStatSet final
{
public:
	class UAthenaSeasonStats*                     CallFunc_GetCurrentStatSet_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonItemDefinition*            CallFunc_GetSeasonDefintion_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(RootProfileStatsScreen_C_UpdateStatSet) == 0x000008, "Wrong alignment on RootProfileStatsScreen_C_UpdateStatSet");
static_assert(sizeof(RootProfileStatsScreen_C_UpdateStatSet) == 0x000048, "Wrong size on RootProfileStatsScreen_C_UpdateStatSet");
static_assert(offsetof(RootProfileStatsScreen_C_UpdateStatSet, CallFunc_GetCurrentStatSet_ReturnValue) == 0x000000, "Member 'RootProfileStatsScreen_C_UpdateStatSet::CallFunc_GetCurrentStatSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_UpdateStatSet, CallFunc_GetSeasonDefintion_ReturnValue) == 0x000008, "Member 'RootProfileStatsScreen_C_UpdateStatSet::CallFunc_GetSeasonDefintion_ReturnValue' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_UpdateStatSet, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'RootProfileStatsScreen_C_UpdateStatSet::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_UpdateStatSet, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'RootProfileStatsScreen_C_UpdateStatSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RootProfileStatsScreen_C_UpdateStatSet, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'RootProfileStatsScreen_C_UpdateStatSet::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

