#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RubberDuckStatic

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RubberDuckStatic.RubberDuckStatic_C.ExecuteUbergraph_RubberDuckStatic
// 0x0120 (0x0120 - 0x0000)
struct RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DropChance_DropResult;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0010(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x003C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00D8(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic) == 0x000008, "Wrong alignment on RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic");
static_assert(sizeof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic) == 0x000120, "Wrong size on RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, EntryPoint) == 0x000000, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::EntryPoint' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, CallFunc_DropChance_DropResult) == 0x000004, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::CallFunc_DropChance_DropResult' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_Damage) == 0x000008, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_DamageTags) == 0x000010, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_Momentum) == 0x000030, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_HitInfo) == 0x00003C, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_InstigatedBy) == 0x0000C8, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_DamageCauser) == 0x0000D0, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, K2Node_Event_EffectContext) == 0x0000D8, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, Temp_int_Variable) == 0x0000F0, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F4, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000FC, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x000118, "Member 'RubberDuckStatic_C_ExecuteUbergraph_RubberDuckStatic::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");

// Function RubberDuckStatic.RubberDuckStatic_C.OnDeathServer
// 0x00E8 (0x00E8 - 0x0000)
struct RubberDuckStatic_C_OnDeathServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(RubberDuckStatic_C_OnDeathServer) == 0x000008, "Wrong alignment on RubberDuckStatic_C_OnDeathServer");
static_assert(sizeof(RubberDuckStatic_C_OnDeathServer) == 0x0000E8, "Wrong size on RubberDuckStatic_C_OnDeathServer");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, Damage) == 0x000000, "Member 'RubberDuckStatic_C_OnDeathServer::Damage' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, DamageTags) == 0x000008, "Member 'RubberDuckStatic_C_OnDeathServer::DamageTags' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, Momentum) == 0x000028, "Member 'RubberDuckStatic_C_OnDeathServer::Momentum' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, HitInfo) == 0x000034, "Member 'RubberDuckStatic_C_OnDeathServer::HitInfo' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, InstigatedBy) == 0x0000C0, "Member 'RubberDuckStatic_C_OnDeathServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, DamageCauser) == 0x0000C8, "Member 'RubberDuckStatic_C_OnDeathServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(RubberDuckStatic_C_OnDeathServer, EffectContext) == 0x0000D0, "Member 'RubberDuckStatic_C_OnDeathServer::EffectContext' has a wrong offset!");

}

