#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreboardPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScoreboardPanel.ScoreboardPanel_C
// 0x0060 (0x03A8 - 0x0348)
class UScoreboardPanel_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      AbortButton;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DismissButton;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RestartButton;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreboard_UI_C*                       Scoreboard_UI;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputRestartMinigame;                              // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    InputAbortMinigame;                                // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AFortPlayerControllerAthena*            OwnerPlayer;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Close_Menu_Sound;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Open_Menu_Sound;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScoreboardPanel(int32 EntryPoint);
	void Construct();
	void BndEvt__AbortButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RestartButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__DismissButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnDeactivated();
	void OnActivated();
	void Close();
	void CanChangeMinigameState(bool* bResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScoreboardPanel_C">();
	}
	static class UScoreboardPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreboardPanel_C>();
	}
};
static_assert(alignof(UScoreboardPanel_C) == 0x000008, "Wrong alignment on UScoreboardPanel_C");
static_assert(sizeof(UScoreboardPanel_C) == 0x0003A8, "Wrong size on UScoreboardPanel_C");
static_assert(offsetof(UScoreboardPanel_C, UberGraphFrame) == 0x000348, "Member 'UScoreboardPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, AbortButton) == 0x000350, "Member 'UScoreboardPanel_C::AbortButton' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, DismissButton) == 0x000358, "Member 'UScoreboardPanel_C::DismissButton' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, RestartButton) == 0x000360, "Member 'UScoreboardPanel_C::RestartButton' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, Scoreboard_UI) == 0x000368, "Member 'UScoreboardPanel_C::Scoreboard_UI' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, InputRestartMinigame) == 0x000370, "Member 'UScoreboardPanel_C::InputRestartMinigame' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, InputAbortMinigame) == 0x000380, "Member 'UScoreboardPanel_C::InputAbortMinigame' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, OwnerPlayer) == 0x000390, "Member 'UScoreboardPanel_C::OwnerPlayer' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, Close_Menu_Sound) == 0x000398, "Member 'UScoreboardPanel_C::Close_Menu_Sound' has a wrong offset!");
static_assert(offsetof(UScoreboardPanel_C, Open_Menu_Sound) == 0x0003A0, "Member 'UScoreboardPanel_C::Open_Menu_Sound' has a wrong offset!");

}

