#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreStatRowWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ScoreStatRowWidget.ScoreStatRowWidget_C.ExecuteUbergraph_ScoreStatRowWidget
// 0x00D8 (0x00D8 - 0x0000)
struct ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBaseStatView*                    CallFunc_GetBaseStatView_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUIStatStyle                       CallFunc_GetStatStyle_ReturnValue;                 // 0x0010(0x00C0)(ConstParm)
	float                                         CallFunc_GetStat_ReturnValue;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget) == 0x000008, "Wrong alignment on ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget");
static_assert(sizeof(ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget) == 0x0000D8, "Wrong size on ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget");
static_assert(offsetof(ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget, EntryPoint) == 0x000000, "Member 'ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget, CallFunc_GetBaseStatView_ReturnValue) == 0x000008, "Member 'ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget::CallFunc_GetBaseStatView_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget, CallFunc_GetStatStyle_ReturnValue) == 0x000010, "Member 'ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget::CallFunc_GetStatStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget, CallFunc_GetStat_ReturnValue) == 0x0000D0, "Member 'ScoreStatRowWidget_C_ExecuteUbergraph_ScoreStatRowWidget::CallFunc_GetStat_ReturnValue' has a wrong offset!");

}

