#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scoreboard_Team_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Scoreboard_Team_Widget.Scoreboard_Team_Widget_C
// 0x0048 (0x0278 - 0x0230)
class UScoreboard_Team_Widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           RightSideBox;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TeamBox;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TeamScore;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VictoryRoyale;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsWinningTeam;                                    // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bShowVictoryScore;                                 // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   VictoryScore;                                      // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Scoreboard_Team_Widget(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetVictoryColors(class UMaterialInstanceDynamic* DynamicMaterialInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Scoreboard_Team_Widget_C">();
	}
	static class UScoreboard_Team_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreboard_Team_Widget_C>();
	}
};
static_assert(alignof(UScoreboard_Team_Widget_C) == 0x000008, "Wrong alignment on UScoreboard_Team_Widget_C");
static_assert(sizeof(UScoreboard_Team_Widget_C) == 0x000278, "Wrong size on UScoreboard_Team_Widget_C");
static_assert(offsetof(UScoreboard_Team_Widget_C, UberGraphFrame) == 0x000230, "Member 'UScoreboard_Team_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, RightSideBox) == 0x000238, "Member 'UScoreboard_Team_Widget_C::RightSideBox' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, TeamBox) == 0x000240, "Member 'UScoreboard_Team_Widget_C::TeamBox' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, TeamScore) == 0x000248, "Member 'UScoreboard_Team_Widget_C::TeamScore' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, VictoryRoyale) == 0x000250, "Member 'UScoreboard_Team_Widget_C::VictoryRoyale' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, bIsWinningTeam) == 0x000258, "Member 'UScoreboard_Team_Widget_C::bIsWinningTeam' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, bShowVictoryScore) == 0x000259, "Member 'UScoreboard_Team_Widget_C::bShowVictoryScore' has a wrong offset!");
static_assert(offsetof(UScoreboard_Team_Widget_C, VictoryScore) == 0x000260, "Member 'UScoreboard_Team_Widget_C::VictoryScore' has a wrong offset!");

}

