#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownPosterViolator

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ShowdownPosterViolator.ShowdownPosterViolator_C.ExecuteUbergraph_ShowdownPosterViolator
// 0x0020 (0x0020 - 0x0000)
struct ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetTournamentState_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator) == 0x000008, "Wrong alignment on ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator");
static_assert(sizeof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator) == 0x000020, "Wrong size on ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator");
static_assert(offsetof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator, EntryPoint) == 0x000000, "Member 'ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator, Temp_byte_Variable) == 0x000004, "Member 'ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator, Temp_object_Variable) == 0x000008, "Member 'ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator, CallFunc_GetTournamentState_ReturnValue) == 0x000010, "Member 'ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator::CallFunc_GetTournamentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator, K2Node_Select_Default) == 0x000018, "Member 'ShowdownPosterViolator_C_ExecuteUbergraph_ShowdownPosterViolator::K2Node_Select_Default' has a wrong offset!");

}

