#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowSocialImportAction

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ShowSocialImportAction.ShowSocialImportAction_C.ExecuteUbergraph_ShowSocialImportAction
// 0x0038 (0x0038 - 0x0000)
struct ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowSocialImport_NewParam;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortScriptedActionParams              K2Node_Event_Params;                               // 0x0008(0x0030)(ConstParm, NoDestructor)
};
static_assert(alignof(ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction) == 0x000008, "Wrong alignment on ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction");
static_assert(sizeof(ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction) == 0x000038, "Wrong size on ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction");
static_assert(offsetof(ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction, EntryPoint) == 0x000000, "Member 'ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction, CallFunc_ShouldShowSocialImport_NewParam) == 0x000004, "Member 'ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction::CallFunc_ShouldShowSocialImport_NewParam' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction, K2Node_Event_Params) == 0x000008, "Member 'ShowSocialImportAction_C_ExecuteUbergraph_ShowSocialImportAction::K2Node_Event_Params' has a wrong offset!");

// Function ShowSocialImportAction.ShowSocialImportAction_C.Execute
// 0x0030 (0x0030 - 0x0000)
struct ShowSocialImportAction_C_Execute final
{
public:
	struct FFortScriptedActionParams              Params_0;                                          // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ShowSocialImportAction_C_Execute) == 0x000008, "Wrong alignment on ShowSocialImportAction_C_Execute");
static_assert(sizeof(ShowSocialImportAction_C_Execute) == 0x000030, "Wrong size on ShowSocialImportAction_C_Execute");
static_assert(offsetof(ShowSocialImportAction_C_Execute, Params_0) == 0x000000, "Member 'ShowSocialImportAction_C_Execute::Params_0' has a wrong offset!");

// Function ShowSocialImportAction.ShowSocialImportAction_C.ShowSocialImport
// 0x0028 (0x0028 - 0x0000)
struct ShowSocialImportAction_C_ShowSocialImport final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialImportPanel*                 CallFunc_ShowSocialImport_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ShowSocialImportAction_C_ShowSocialImport) == 0x000008, "Wrong alignment on ShowSocialImportAction_C_ShowSocialImport");
static_assert(sizeof(ShowSocialImportAction_C_ShowSocialImport) == 0x000028, "Wrong size on ShowSocialImportAction_C_ShowSocialImport");
static_assert(offsetof(ShowSocialImportAction_C_ShowSocialImport, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ShowSocialImportAction_C_ShowSocialImport::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShowSocialImport, CallFunc_GetContext_ReturnValue1) == 0x000008, "Member 'ShowSocialImportAction_C_ShowSocialImport::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShowSocialImport, CallFunc_ShowSocialImport_ReturnValue) == 0x000010, "Member 'ShowSocialImportAction_C_ShowSocialImport::CallFunc_ShowSocialImport_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShowSocialImport, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'ShowSocialImportAction_C_ShowSocialImport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ShowSocialImportAction.ShowSocialImportAction_C.HandleSocialImportClosed
// 0x0018 (0x0018 - 0x0000)
struct ShowSocialImportAction_C_HandleSocialImportClosed final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ShowSocialImportAction_C_HandleSocialImportClosed) == 0x000008, "Wrong alignment on ShowSocialImportAction_C_HandleSocialImportClosed");
static_assert(sizeof(ShowSocialImportAction_C_HandleSocialImportClosed) == 0x000018, "Wrong size on ShowSocialImportAction_C_HandleSocialImportClosed");
static_assert(offsetof(ShowSocialImportAction_C_HandleSocialImportClosed, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ShowSocialImportAction_C_HandleSocialImportClosed::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_HandleSocialImportClosed, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ShowSocialImportAction_C_HandleSocialImportClosed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ShowSocialImportAction.ShowSocialImportAction_C.ShouldShowSocialImport
// 0x0058 (0x0058 - 0x0000)
struct ShowSocialImportAction_C_ShouldShowSocialImport final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               UIManager;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowSocialImport_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPendingLogout_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowSocialImportAction_C_ShouldShowSocialImport) == 0x000008, "Wrong alignment on ShowSocialImportAction_C_ShouldShowSocialImport");
static_assert(sizeof(ShowSocialImportAction_C_ShouldShowSocialImport) == 0x000058, "Wrong size on ShowSocialImportAction_C_ShouldShowSocialImport");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, NewParam) == 0x000000, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::NewParam' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, UIManager) == 0x000008, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::UIManager' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_ShouldShowSocialImport_ReturnValue) == 0x000018, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_ShouldShowSocialImport_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_IsInViewport_ReturnValue) == 0x000019, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000020, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_GetContext_ReturnValue1) == 0x000028, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_GetSubGame_ReturnValue) == 0x000030, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_GetContext_ReturnValue2) == 0x000038, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_IsPendingLogout_ReturnValue) == 0x000041, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_IsPendingLogout_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_Not_PreBool_ReturnValue) == 0x000043, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_GetContext_ReturnValue3) == 0x000048, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_IsInZone_ReturnValue) == 0x000050, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_BooleanAND_ReturnValue1) == 0x000052, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowSocialImportAction_C_ShouldShowSocialImport, CallFunc_BooleanAND_ReturnValue2) == 0x000053, "Member 'ShowSocialImportAction_C_ShouldShowSocialImport::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

}

