#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownScreen.ShowdownScreen_C
// 0x00C8 (0x0460 - 0x0398)
class UShowdownScreen_C final : public UFortShowdownScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Left;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   CircleArrowButton_Right;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_ErrorSwitcher;                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoTournamentsContent;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoTournamentContent;                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownTournamentTile_C*              ShowdownTournamentTile;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownTournamentTile_C*              ShowdownTournamentTile_0;                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownTournamentTile_C*              ShowdownTournamentTile_1;                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Posters;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSwipePanel*                        SwipePanel;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TournamentsContent;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_ShowAbout;                                   // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateColor                            PrimaryColor;                                      // 0x0420(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    Input_ShowDetails;                                 // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UWidget*                                SelectedTile;                                      // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShowdownScreen(int32 EntryPoint);
	void SelectedEndTournament(bool bEndIsSelected);
	void SelectedFrontTournament(bool bFrontIsSelected);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TournamentListSelect(class UWidget* CurrentWidget);
	void OnInputModeChanged(bool bUsingGamepad);
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_4_OnFortSwipeEvent__DelegateSignature();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_3_OnFortSwipeEvent__DelegateSignature();
	void OnActivated();
	void Construct();
	void ShowTournamentDetails(const class FString& SelectedTournament);
	void BndEvt__ScrollBox_TournamentList_K2Node_ComponentBoundEvent_2_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void BndEvt__CircleArrowButton_Right_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CircleArrowButton_Left_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownScreen_C">();
	}
	static class UShowdownScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownScreen_C>();
	}
};
static_assert(alignof(UShowdownScreen_C) == 0x000008, "Wrong alignment on UShowdownScreen_C");
static_assert(sizeof(UShowdownScreen_C) == 0x000460, "Wrong size on UShowdownScreen_C");
static_assert(offsetof(UShowdownScreen_C, UberGraphFrame) == 0x000398, "Member 'UShowdownScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, Outro) == 0x0003A0, "Member 'UShowdownScreen_C::Outro' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, Intro) == 0x0003A8, "Member 'UShowdownScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, CircleArrowButton_Left) == 0x0003B0, "Member 'UShowdownScreen_C::CircleArrowButton_Left' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, CircleArrowButton_Right) == 0x0003B8, "Member 'UShowdownScreen_C::CircleArrowButton_Right' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, CommonWidgetSwitcher_ErrorSwitcher) == 0x0003C0, "Member 'UShowdownScreen_C::CommonWidgetSwitcher_ErrorSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, Image_BG) == 0x0003C8, "Member 'UShowdownScreen_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, NoTournamentsContent) == 0x0003D0, "Member 'UShowdownScreen_C::NoTournamentsContent' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, Overlay_NoTournamentContent) == 0x0003D8, "Member 'UShowdownScreen_C::Overlay_NoTournamentContent' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, ShowdownTournamentTile) == 0x0003E0, "Member 'UShowdownScreen_C::ShowdownTournamentTile' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, ShowdownTournamentTile_0) == 0x0003E8, "Member 'UShowdownScreen_C::ShowdownTournamentTile_0' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, ShowdownTournamentTile_1) == 0x0003F0, "Member 'UShowdownScreen_C::ShowdownTournamentTile_1' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, SizeBox_Posters) == 0x0003F8, "Member 'UShowdownScreen_C::SizeBox_Posters' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, SwipePanel) == 0x000400, "Member 'UShowdownScreen_C::SwipePanel' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, TournamentsContent) == 0x000408, "Member 'UShowdownScreen_C::TournamentsContent' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, Input_ShowAbout) == 0x000410, "Member 'UShowdownScreen_C::Input_ShowAbout' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, PrimaryColor) == 0x000420, "Member 'UShowdownScreen_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, Input_ShowDetails) == 0x000448, "Member 'UShowdownScreen_C::Input_ShowDetails' has a wrong offset!");
static_assert(offsetof(UShowdownScreen_C, SelectedTile) == 0x000458, "Member 'UShowdownScreen_C::SelectedTile' has a wrong offset!");

}

