#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.ExecuteUbergraph_ShowdownLobbyPanel
// 0x0158 (0x0158 - 0x0000)
struct ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownTournamentScreen_C*            CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTournamentId_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue1;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A8(0x0028)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue1;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue2;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue3;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bUsingGamepad;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue3;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel");
static_assert(sizeof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel) == 0x000158, "Wrong size on ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, EntryPoint) == 0x000000, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable) == 0x000010, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable1) == 0x000014, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable) == 0x000018, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button2) == 0x000038, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable1) == 0x000040, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Create_ReturnValue) == 0x000058, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetContext_ReturnValue1) == 0x000060, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetTournamentId_ReturnValue) == 0x000068, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetTournamentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button1) == 0x000078, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable2) == 0x000080, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_bool_Variable2) == 0x000090, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetStartTime_ReturnValue) == 0x000094, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetEndTime_ReturnValue) == 0x000098, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetStartTime_ReturnValue1) == 0x00009C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetStartTime_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_GetEndTime_ReturnValue1) == 0x0000A0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_GetEndTime_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_SlateColor) == 0x0000A8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_ComponentBoundEvent_Button) == 0x0000D0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CreateDelegate_OutputDelegate1) == 0x0000D8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue) == 0x0000E8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000EC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000F0, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue1) == 0x0000F4, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue2) == 0x0000F8, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000FC, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000100, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000108, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000110, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PauseAnimation_ReturnValue3) == 0x000114, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PauseAnimation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select_Default) == 0x000118, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00011C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue1) == 0x000120, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue2) == 0x000128, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, Temp_float_Variable3) == 0x000130, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_CustomEvent_bUsingGamepad) == 0x000134, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_CustomEvent_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select1_Default) == 0x000138, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_Select2_Default) == 0x00013C, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, CallFunc_PlayAnimation_ReturnValue3) == 0x000140, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::CallFunc_PlayAnimation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel, K2Node_MakeStruct_Margin) == 0x000148, "Member 'ShowdownLobbyPanel_C_ExecuteUbergraph_ShowdownLobbyPanel::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.EventSwitchUI
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_EventSwitchUI final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_EventSwitchUI");
static_assert(sizeof(ShowdownLobbyPanel_C_EventSwitchUI) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_EventSwitchUI");
static_assert(offsetof(ShowdownLobbyPanel_C_EventSwitchUI, bUsingGamepad) == 0x000000, "Member 'ShowdownLobbyPanel_C_EventSwitchUI::bUsingGamepad' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownLobbyPanel_C_BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.Refresh
// 0x02E8 (0x02E8 - 0x0000)
struct ShowdownLobbyPanel_C_Refresh final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0028(0x0018)()
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue1;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	EFortShowdownEventState                       Temp_byte_Variable4;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue1; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	int32                                         CallFunc_GetTournamentMatchCap_ReturnValue2;       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x00F8(0x0018)()
	EFortShowdownEventState                       CallFunc_GetEventState_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBestEventScore_ReturnValue;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0190(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x01A8(0x0018)()
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentEventScore_ReturnValue1;        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue1;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0200(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0218(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0230(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue2;                 // 0x0248(0x0018)()
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue;  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x026C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0280(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select3_Default;                            // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTournamentPinUnlockScore_ReturnValue1; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02B0(0x0018)()
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select5_Default;                            // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyPanel_C_Refresh) == 0x000008, "Wrong alignment on ShowdownLobbyPanel_C_Refresh");
static_assert(sizeof(ShowdownLobbyPanel_C_Refresh) == 0x0002E8, "Wrong size on ShowdownLobbyPanel_C_Refresh");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_float_Variable) == 0x000000, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_float_Variable1) == 0x000004, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_bool_Variable) == 0x000008, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_byte_Variable) == 0x000009, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_byte_Variable1) == 0x00000A, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_bool_Variable1) == 0x00000B, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_bool_Variable2) == 0x00000C, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_byte_Variable2) == 0x00000D, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_byte_Variable3) == 0x00000E, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_bool_Variable3) == 0x00000F, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_text_Variable) == 0x000010, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_text_Variable1) == 0x000028, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetTournamentMatchCap_ReturnValue) == 0x000040, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetTournamentMatchCap_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue) == 0x000048, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetTournamentMatchCap_ReturnValue1) == 0x00004C, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetTournamentMatchCap_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_byte_Variable4) == 0x000098, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_MakeArray_Array) == 0x0000A0, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue1) == 0x0000B0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetCurrentEventTeamNumMatchesPlayed_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetTournamentMatchCap_ReturnValue2) == 0x0000D0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetTournamentMatchCap_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Subtract_IntInt_ReturnValue1) == 0x0000D4, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x0000D8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_BooleanAND_ReturnValue) == 0x0000D9, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_MakeLiteralText_ReturnValue) == 0x0000E0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_MakeLiteralText_ReturnValue1) == 0x0000F8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetEventState_ReturnValue) == 0x000110, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetEventState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetCurrentEventScore_ReturnValue) == 0x000114, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetCurrentEventScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetBestEventScore_ReturnValue) == 0x000118, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetBestEventScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_Select_Default) == 0x000120, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_MakeStruct_FormatArgumentData1) == 0x000138, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_MakeArray_Array1) == 0x000178, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Greater_IntInt_ReturnValue) == 0x000188, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Format_ReturnValue1) == 0x000190, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_TextToUpper_ReturnValue) == 0x0001A8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_Select1_Default) == 0x0001C0, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetCurrentEventScore_ReturnValue1) == 0x0001C4, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetCurrentEventScore_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0001C8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_PauseAnimation_ReturnValue) == 0x0001D0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetStartTime_ReturnValue) == 0x0001D4, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001D8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_PauseAnimation_ReturnValue1) == 0x0001DC, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_PauseAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetEndTime_ReturnValue) == 0x0001E0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001E4, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001E8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_PlayAnimation_ReturnValue) == 0x0001F0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_float_Variable2) == 0x0001F8, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Conv_StringToText_ReturnValue) == 0x000200, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Conv_StringToText_ReturnValue1) == 0x000218, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_TextToUpper_ReturnValue1) == 0x000230, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_TextToUpper_ReturnValue2) == 0x000248, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_TextToUpper_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetTournamentPinUnlockScore_ReturnValue) == 0x000260, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetTournamentPinUnlockScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000264, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_Select2_Default) == 0x000268, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_MakeStruct_Margin) == 0x00026C, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetText_ReturnValue) == 0x000280, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_TextIsEmpty_ReturnValue) == 0x000298, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_Select3_Default) == 0x0002A0, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_Select4_Default) == 0x0002A8, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetTournamentPinUnlockScore_ReturnValue1) == 0x0002AC, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetTournamentPinUnlockScore_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_Conv_IntToText_ReturnValue) == 0x0002B0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_GetEventId_ReturnValue) == 0x0002C8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_GetEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0002D8, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, Temp_bool_Variable4) == 0x0002D9, "Member 'ShowdownLobbyPanel_C_Refresh::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, K2Node_Select5_Default) == 0x0002DC, "Member 'ShowdownLobbyPanel_C_Refresh::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyPanel_C_Refresh, CallFunc_PlayAnimation_ReturnValue1) == 0x0002E0, "Member 'ShowdownLobbyPanel_C_Refresh::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");

// Function ShowdownLobbyPanel.ShowdownLobbyPanel_C.InputTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct ShowdownLobbyPanel_C_InputTypeChanged final
{
public:
	bool                                          IsGamepad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong alignment on ShowdownLobbyPanel_C_InputTypeChanged");
static_assert(sizeof(ShowdownLobbyPanel_C_InputTypeChanged) == 0x000001, "Wrong size on ShowdownLobbyPanel_C_InputTypeChanged");
static_assert(offsetof(ShowdownLobbyPanel_C_InputTypeChanged, IsGamepad) == 0x000000, "Member 'ShowdownLobbyPanel_C_InputTypeChanged::IsGamepad' has a wrong offset!");

}

