#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownPin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownPin.ShowdownPin_C
// 0x0098 (0x0650 - 0x05B8)
class UShowdownPin_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_NoPinPts;                          // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_PinPts;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PinShadow;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoPinContent;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       NoPinIcon;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                NoPinScoreText;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       NoPinShadow;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PinContent;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PinIcon;                                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  PinInfoSwitcher;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PinScoreText;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PointValuesProgress;                   // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxPointValues;                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bRepresentsTournamentBestPin;                      // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          DEVShowPin;                                        // 0x0641(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HidePoints;                                        // 0x0642(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_643[0x1];                                      // 0x0643(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DEVPinScore;                                       // 0x0644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ColorSilhouette;                                   // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ShowdownPin(int32 EntryPoint);
	void EventRevealAnim();
	void EventColorize();
	void EventFixPts(int32 Points);
	void EventSetTier(int32 Score);
	void PreConstruct(bool IsDesignTime);
	void RefreshDataBP();
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownPin_C">();
	}
	static class UShowdownPin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownPin_C>();
	}
};
static_assert(alignof(UShowdownPin_C) == 0x000008, "Wrong alignment on UShowdownPin_C");
static_assert(sizeof(UShowdownPin_C) == 0x000650, "Wrong size on UShowdownPin_C");
static_assert(offsetof(UShowdownPin_C, UberGraphFrame) == 0x0005B8, "Member 'UShowdownPin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Hover) == 0x0005C0, "Member 'UShowdownPin_C::Hover' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Focus) == 0x0005C8, "Member 'UShowdownPin_C::Focus' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Reveal) == 0x0005D0, "Member 'UShowdownPin_C::Reveal' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, CommonTextBlock_NoPinPts) == 0x0005D8, "Member 'UShowdownPin_C::CommonTextBlock_NoPinPts' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, CommonTextBlock_PinPts) == 0x0005E0, "Member 'UShowdownPin_C::CommonTextBlock_PinPts' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, Image_PinShadow) == 0x0005E8, "Member 'UShowdownPin_C::Image_PinShadow' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinContent) == 0x0005F0, "Member 'UShowdownPin_C::NoPinContent' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinIcon) == 0x0005F8, "Member 'UShowdownPin_C::NoPinIcon' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinScoreText) == 0x000600, "Member 'UShowdownPin_C::NoPinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, NoPinShadow) == 0x000608, "Member 'UShowdownPin_C::NoPinShadow' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinContent) == 0x000610, "Member 'UShowdownPin_C::PinContent' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinIcon) == 0x000618, "Member 'UShowdownPin_C::PinIcon' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinInfoSwitcher) == 0x000620, "Member 'UShowdownPin_C::PinInfoSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, PinScoreText) == 0x000628, "Member 'UShowdownPin_C::PinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, VerticalBox_PointValuesProgress) == 0x000630, "Member 'UShowdownPin_C::VerticalBox_PointValuesProgress' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, VerticalBoxPointValues) == 0x000638, "Member 'UShowdownPin_C::VerticalBoxPointValues' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, bRepresentsTournamentBestPin) == 0x000640, "Member 'UShowdownPin_C::bRepresentsTournamentBestPin' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, DEVShowPin) == 0x000641, "Member 'UShowdownPin_C::DEVShowPin' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, HidePoints) == 0x000642, "Member 'UShowdownPin_C::HidePoints' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, DEVPinScore) == 0x000644, "Member 'UShowdownPin_C::DEVPinScore' has a wrong offset!");
static_assert(offsetof(UShowdownPin_C, ColorSilhouette) == 0x000648, "Member 'UShowdownPin_C::ColorSilhouette' has a wrong offset!");

}

