#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShowdownTournamentScreen.ShowdownTournamentScreen_C.ExecuteUbergraph_ShowdownTournamentScreen
// 0x0020 (0x0020 - 0x0000)
struct ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Handle_Back_PassThrough;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen) == 0x000008, "Wrong alignment on ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen");
static_assert(sizeof(ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen) == 0x000020, "Wrong size on ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen");
static_assert(offsetof(ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen, EntryPoint) == 0x000000, "Member 'ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen, CallFunc_Handle_Back_PassThrough) == 0x000004, "Member 'ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen::CallFunc_Handle_Back_PassThrough' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ShowdownTournamentScreen_C_ExecuteUbergraph_ShowdownTournamentScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function ShowdownTournamentScreen.ShowdownTournamentScreen_C.Handle_Back
// 0x0018 (0x0018 - 0x0000)
struct ShowdownTournamentScreen_C_Handle_Back final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Handle_Back_PassThrough;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownTournamentScreen_C_Handle_Back) == 0x000008, "Wrong alignment on ShowdownTournamentScreen_C_Handle_Back");
static_assert(sizeof(ShowdownTournamentScreen_C_Handle_Back) == 0x000018, "Wrong size on ShowdownTournamentScreen_C_Handle_Back");
static_assert(offsetof(ShowdownTournamentScreen_C_Handle_Back, PassThrough) == 0x000000, "Member 'ShowdownTournamentScreen_C_Handle_Back::PassThrough' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentScreen_C_Handle_Back, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'ShowdownTournamentScreen_C_Handle_Back::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentScreen_C_Handle_Back, CallFunc_Handle_Back_PassThrough) == 0x000010, "Member 'ShowdownTournamentScreen_C_Handle_Back::CallFunc_Handle_Back_PassThrough' has a wrong offset!");

// Function ShowdownTournamentScreen.ShowdownTournamentScreen_C.SetTournamentToRepresent
// 0x0018 (0x0018 - 0x0000)
struct ShowdownTournamentScreen_C_SetTournamentToRepresent final
{
public:
	class FString                                 TournamentId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentScreen_C_SetTournamentToRepresent) == 0x000008, "Wrong alignment on ShowdownTournamentScreen_C_SetTournamentToRepresent");
static_assert(sizeof(ShowdownTournamentScreen_C_SetTournamentToRepresent) == 0x000018, "Wrong size on ShowdownTournamentScreen_C_SetTournamentToRepresent");
static_assert(offsetof(ShowdownTournamentScreen_C_SetTournamentToRepresent, TournamentId) == 0x000000, "Member 'ShowdownTournamentScreen_C_SetTournamentToRepresent::TournamentId' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentScreen_C_SetTournamentToRepresent, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'ShowdownTournamentScreen_C_SetTournamentToRepresent::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

