#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownTournamentScreen.ShowdownTournamentScreen_C
// 0x0040 (0x0388 - 0x0348)
class UShowdownTournamentScreen_C final : public UFortActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownTournamentDetails_C*           ShowdownTournamentDetails;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_ShowAbout;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Input_Back;                                        // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_ShowdownTournamentScreen(int32 EntryPoint);
	void BndEvt__ShowdownTournamentDetails_K2Node_ComponentBoundEvent_0_BackActionSelected__DelegateSignature();
	void OnActivated();
	void Construct();
	void Handle_Back(bool* PassThrough);
	void SetTournamentToRepresent(const class FString& TournamentId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownTournamentScreen_C">();
	}
	static class UShowdownTournamentScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownTournamentScreen_C>();
	}
};
static_assert(alignof(UShowdownTournamentScreen_C) == 0x000008, "Wrong alignment on UShowdownTournamentScreen_C");
static_assert(sizeof(UShowdownTournamentScreen_C) == 0x000388, "Wrong size on UShowdownTournamentScreen_C");
static_assert(offsetof(UShowdownTournamentScreen_C, UberGraphFrame) == 0x000348, "Member 'UShowdownTournamentScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentScreen_C, Intro) == 0x000350, "Member 'UShowdownTournamentScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentScreen_C, Image_BG) == 0x000358, "Member 'UShowdownTournamentScreen_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentScreen_C, ShowdownTournamentDetails) == 0x000360, "Member 'UShowdownTournamentScreen_C::ShowdownTournamentDetails' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentScreen_C, Input_ShowAbout) == 0x000368, "Member 'UShowdownTournamentScreen_C::Input_ShowAbout' has a wrong offset!");
static_assert(offsetof(UShowdownTournamentScreen_C, Input_Back) == 0x000378, "Member 'UShowdownTournamentScreen_C::Input_Back' has a wrong offset!");

}

