#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyViolator

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShowdownLobbyViolator.ShowdownLobbyViolator_C.ExecuteUbergraph_ShowdownLobbyViolator
// 0x0238 (0x0238 - 0x0000)
struct ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0080(0x0018)()
	EFortShowdownEventState                       Temp_byte_Variable1;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventState_ReturnValue;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C8(0x0028)()
	int32                                         K2Node_Select_Default;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0138(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable6;                               // 0x0178(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x01B8(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x01D0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x01E8(0x0018)()
	class FText                                   K2Node_Select1_Default;                            // 0x0200(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x0218(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator) == 0x000008, "Wrong alignment on ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator");
static_assert(sizeof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator) == 0x000238, "Wrong size on ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, EntryPoint) == 0x000000, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_byte_Variable) == 0x000004, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable) == 0x000008, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable1) == 0x000020, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable2) == 0x000038, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable3) == 0x000050, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable4) == 0x000068, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable5) == 0x000080, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_byte_Variable1) == 0x000098, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable) == 0x00009C, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable1) == 0x0000A0, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable2) == 0x0000A4, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable3) == 0x0000A8, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable4) == 0x0000AC, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable5) == 0x0000B0, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable6) == 0x0000B4, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable7) == 0x0000B8, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_int_Variable8) == 0x0000BC, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, CallFunc_GetEventState_ReturnValue) == 0x0000C0, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::CallFunc_GetEventState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, K2Node_MakeStruct_SlateColor) == 0x0000C8, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, K2Node_Select_Default) == 0x0000F0, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, K2Node_MakeStruct_FormatArgumentData) == 0x0000F8, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, K2Node_MakeStruct_FormatArgumentData1) == 0x000138, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable6) == 0x000178, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable6' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, K2Node_MakeArray_Array) == 0x000190, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, CallFunc_TextToUpper_ReturnValue) == 0x0001B8, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable7) == 0x0001D0, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable7' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, Temp_text_Variable8) == 0x0001E8, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::Temp_text_Variable8' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, K2Node_Select1_Default) == 0x000200, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, CallFunc_TextToUpper_ReturnValue1) == 0x000218, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator, CallFunc_PlayAnimation_ReturnValue) == 0x000230, "Member 'ShowdownLobbyViolator_C_ExecuteUbergraph_ShowdownLobbyViolator::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

