#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownTournamentDetails

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.ExecuteUbergraph_ShowdownTournamentDetails
// 0x02B0 (0x02B0 - 0x0000)
struct ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_In1;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_CustomEvent_Animation;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaySpeed;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventState_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue1;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue2;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue1;                  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile1;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_SelectedWidget;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue3;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& TournamentId, const class FString& EventId)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_Widget;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_DynamicCast_AsCommon_Button;                // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0124(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile2;         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x014C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SafePadding;           // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSafeZonePadding_SafePaddingScale;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_GetSafeZonePadding_SpillOverPadding;      // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x01DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue1;           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue2;           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile3;         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable3;                                // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue3;                  // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShowdownEventTile_C*                   K2Node_DynamicCast_AsShowdown_Event_Tile4;         // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_TournamentId;                   // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventId;                        // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In;                             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       Temp_byte_Variable9;                               // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails) == 0x000010, "Wrong alignment on ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails");
static_assert(sizeof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails) == 0x0002B0, "Wrong size on ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, EntryPoint) == 0x000000, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_Button) == 0x000008, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_Event_IsDesignTime) == 0x000010, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_In1) == 0x000011, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_In1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_Animation) == 0x000018, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_PlaySpeed) == 0x000020, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_PlaySpeed' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_PauseAnimation_ReturnValue) == 0x000024, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetStartTime_ReturnValue) == 0x000028, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_PauseAnimation_ReturnValue1) == 0x00002C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_PauseAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Add_FloatFloat_ReturnValue) == 0x000034, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetEndTime_ReturnValue) == 0x000038, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_bool_Variable) == 0x00004C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_PlayAnimation_ReturnValue1) == 0x000050, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_int_Variable) == 0x00005C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildrenCount_ReturnValue) == 0x000060, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildAt_ReturnValue) == 0x000068, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile) == 0x000078, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000081, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetEventState_ReturnValue) == 0x000088, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetEventState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildrenCount_ReturnValue1) == 0x00008C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildrenCount_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildrenCount_ReturnValue2) == 0x000090, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildrenCount_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000098, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_int_Variable1) == 0x00009C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildAt_ReturnValue1) == 0x0000A8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildAt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile1) == 0x0000B0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_bSuccess1) == 0x0000B8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Add_IntInt_ReturnValue1) == 0x0000BC, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Not_PreBool_ReturnValue1) == 0x0000C0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x0000C1, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_BooleanAND_ReturnValue) == 0x0000C2, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_SelectedWidget) == 0x0000C8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_SelectedWidget' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildIndex_ReturnValue) == 0x0000D0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildrenCount_ReturnValue3) == 0x0000D4, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildrenCount_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_float_Variable) == 0x0000D8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CreateDelegate_OutputDelegate1) == 0x0000EC, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CreateDelegate_OutputDelegate2) == 0x0000FC, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_Widget) == 0x000110, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_AsCommon_Button) == 0x000118, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_AsCommon_Button' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_bSuccess2) == 0x000120, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CreateDelegate_OutputDelegate3) == 0x000124, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetUINavigationManager_ReturnValue) == 0x000138, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile2) == 0x000140, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_bSuccess3) == 0x000148, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable) == 0x000149, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable1) == 0x00014A, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable2) == 0x00014B, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_Event_MyGeometry) == 0x00014C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_Event_InDeltaTime) == 0x000184, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetSafeZonePadding_SafePadding) == 0x000190, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetSafeZonePadding_SafePadding' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetSafeZonePadding_SafePaddingScale) == 0x0001A0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetSafeZonePadding_SafePaddingScale' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetSafeZonePadding_SpillOverPadding) == 0x0001B0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetSafeZonePadding_SpillOverPadding' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0001C0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable3) == 0x0001C8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable4) == 0x0001C9, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x0001CC, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0001D0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_FloatFloat_ReturnValue3) == 0x0001D4, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Subtract_FloatFloat_ReturnValue4) == 0x0001D8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Subtract_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_MakeStruct_Margin) == 0x0001DC, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_SlotAsOverlaySlot_ReturnValue1) == 0x0001F0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_SlotAsOverlaySlot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable5) == 0x0001F8, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_SlotAsOverlaySlot_ReturnValue2) == 0x000200, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_SlotAsOverlaySlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable6) == 0x000208, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_ComponentBoundEvent_Button3) == 0x000210, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_ComponentBoundEvent_Button2) == 0x000218, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_ComponentBoundEvent_Button1) == 0x000220, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_ComponentBoundEvent_Button) == 0x000228, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_int_Variable2) == 0x000230, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable7) == 0x000234, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildAt_ReturnValue2) == 0x000238, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile3) == 0x000240, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_bSuccess4) == 0x000248, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000249, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetSelected_ReturnValue) == 0x00024A, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x00024B, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Add_IntInt_ReturnValue2) == 0x00024C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_bool_Variable1) == 0x000250, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_int_Variable3) == 0x000254, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_Select_Default) == 0x000258, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_GetChildAt_ReturnValue3) == 0x000260, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_GetChildAt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_PlayAnimation_ReturnValue2) == 0x000268, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_AsShowdown_Event_Tile4) == 0x000270, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_AsShowdown_Event_Tile4' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_DynamicCast_bSuccess5) == 0x000278, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_LessEqual_IntInt_ReturnValue3) == 0x000279, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_LessEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, CallFunc_Add_IntInt_ReturnValue3) == 0x00027C, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_TournamentId) == 0x000280, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_TournamentId' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_EventId) == 0x000290, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_EventId' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_CustomEvent_In) == 0x0002A0, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_CustomEvent_In' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable8) == 0x0002A1, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, Temp_byte_Variable9) == 0x0002A2, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails, K2Node_Select1_Default) == 0x0002A3, "Member 'ShowdownTournamentDetails_C_ExecuteUbergraph_ShowdownTournamentDetails::K2Node_Select1_Default' has a wrong offset!");

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.EventToggleFullScreenContent
// 0x0001 (0x0001 - 0x0000)
struct ShowdownTournamentDetails_C_EventToggleFullScreenContent final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShowdownTournamentDetails_C_EventToggleFullScreenContent) == 0x000001, "Wrong alignment on ShowdownTournamentDetails_C_EventToggleFullScreenContent");
static_assert(sizeof(ShowdownTournamentDetails_C_EventToggleFullScreenContent) == 0x000001, "Wrong size on ShowdownTournamentDetails_C_EventToggleFullScreenContent");
static_assert(offsetof(ShowdownTournamentDetails_C_EventToggleFullScreenContent, In) == 0x000000, "Member 'ShowdownTournamentDetails_C_EventToggleFullScreenContent::In' has a wrong offset!");

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.EventViewFullLeaderboard
// 0x0020 (0x0020 - 0x0000)
struct ShowdownTournamentDetails_C_EventViewFullLeaderboard final
{
public:
	class FString                                 TournamentId;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventId;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentDetails_C_EventViewFullLeaderboard) == 0x000008, "Wrong alignment on ShowdownTournamentDetails_C_EventViewFullLeaderboard");
static_assert(sizeof(ShowdownTournamentDetails_C_EventViewFullLeaderboard) == 0x000020, "Wrong size on ShowdownTournamentDetails_C_EventViewFullLeaderboard");
static_assert(offsetof(ShowdownTournamentDetails_C_EventViewFullLeaderboard, TournamentId) == 0x000000, "Member 'ShowdownTournamentDetails_C_EventViewFullLeaderboard::TournamentId' has a wrong offset!");
static_assert(offsetof(ShowdownTournamentDetails_C_EventViewFullLeaderboard, EventId) == 0x000010, "Member 'ShowdownTournamentDetails_C_EventViewFullLeaderboard::EventId' has a wrong offset!");

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownTournamentDetails_C_BndEvt__Button_ViewLeaderboard_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownTournamentDetails_C_BndEvt__OverviewPanelButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowdownTournamentDetails_C_BndEvt__DetailsPanelButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowdownTournamentDetails.ShowdownTournamentDetails_C.BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowdownTournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownTournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowdownTournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowdownTournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowdownTournamentDetails_C_BndEvt__BackButton2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
