#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownEventTileViolator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShowdownEventTileViolator.ShowdownEventTileViolator_C.ExecuteUbergraph_ShowdownEventTileViolator
// 0x00D0 (0x00D0 - 0x0000)
struct ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortShowdownEventState                       CallFunc_GetEventState_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable2;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTournamentNextEvent_ReturnValue;       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEventId_ReturnValue;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEventWindowRoundNumber_ReturnValue;    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEventWindowSessionNumber_ReturnValue;  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator) == 0x000008, "Wrong alignment on ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator");
static_assert(sizeof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator) == 0x0000D0, "Wrong size on ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, EntryPoint) == 0x000000, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_byte_Variable) == 0x000004, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_byte_Variable1) == 0x000005, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_bool_Variable) == 0x000006, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_int_Variable) == 0x000008, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_int_Variable1) == 0x00000C, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_GetEventState_ReturnValue) == 0x000010, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_GetEventState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_bool_Variable1) == 0x000011, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000013, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_int_Variable2) == 0x000014, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_GetTournamentNextEvent_ReturnValue) == 0x000020, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_GetTournamentNextEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_GetEventId_ReturnValue) == 0x000030, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_GetEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000040, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_GetEventWindowRoundNumber_ReturnValue) == 0x000044, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_GetEventWindowRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, K2Node_Select_Default) == 0x000088, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, K2Node_MakeArray_Array) == 0x000090, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_GetEventWindowSessionNumber_ReturnValue) == 0x0000BC, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_GetEventWindowSessionNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, Temp_bool_Variable2) == 0x0000C0, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C1, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, CallFunc_BooleanAND_ReturnValue) == 0x0000C2, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, K2Node_Select1_Default) == 0x0000C4, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator, K2Node_Select2_Default) == 0x0000C8, "Member 'ShowdownEventTileViolator_C_ExecuteUbergraph_ShowdownEventTileViolator::K2Node_Select2_Default' has a wrong offset!");

}

