#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownLobbyPanel.ShowdownLobbyPanel_C
// 0x0150 (0x0708 - 0x05B8)
class UShowdownLobbyPanel_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EventButtonHover;                                  // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderTimeRemaining;                               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CentralContentSwitcher;                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderPinContainer;                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_EarnAPin;                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_TournamentWarnings;           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EarnPinMessage;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EarnPinScoreText;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EventDetailsButton;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HighestScoreTeammatesText;                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HighestScoreText;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_35;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsButtonBG;                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ErrorBG;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PanelBorder;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoMessage;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_DetailsText;                              // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownPin_C*                         ShowdownPin;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HighestScore;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CrossplayWarning;                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MatchCapWarning;                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Remaining;                                    // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TournamentTitle;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TournamentTitle2;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningMessage;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            PrimaryColor;                                      // 0x0690(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ShadowColor;                                       // 0x06B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HighlightColor;                                    // 0x06E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ShowdownLobbyPanel(int32 EntryPoint);
	void EventSwitchUI(bool bUsingGamepad);
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void EventColorize();
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__EventDetailsButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void RefreshDataBP();
	void Refresh();
	void UpdateColors();
	void HandleCrossplayChanged();
	void InputTypeChanged(bool IsGamepad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownLobbyPanel_C">();
	}
	static class UShowdownLobbyPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownLobbyPanel_C>();
	}
};
static_assert(alignof(UShowdownLobbyPanel_C) == 0x000008, "Wrong alignment on UShowdownLobbyPanel_C");
static_assert(sizeof(UShowdownLobbyPanel_C) == 0x000708, "Wrong size on UShowdownLobbyPanel_C");
static_assert(offsetof(UShowdownLobbyPanel_C, UberGraphFrame) == 0x0005B8, "Member 'UShowdownLobbyPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, EventButtonHover) == 0x0005C0, "Member 'UShowdownLobbyPanel_C::EventButtonHover' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Intro) == 0x0005C8, "Member 'UShowdownLobbyPanel_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, BorderTimeRemaining) == 0x0005D0, "Member 'UShowdownLobbyPanel_C::BorderTimeRemaining' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, CentralContentSwitcher) == 0x0005D8, "Member 'UShowdownLobbyPanel_C::CentralContentSwitcher' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, CommonBorderPinContainer) == 0x0005E0, "Member 'UShowdownLobbyPanel_C::CommonBorderPinContainer' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, CommonTextBlock_EarnAPin) == 0x0005E8, "Member 'UShowdownLobbyPanel_C::CommonTextBlock_EarnAPin' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, CommonWidgetSwitcher_TournamentWarnings) == 0x0005F0, "Member 'UShowdownLobbyPanel_C::CommonWidgetSwitcher_TournamentWarnings' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, EarnPinMessage) == 0x0005F8, "Member 'UShowdownLobbyPanel_C::EarnPinMessage' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, EarnPinScoreText) == 0x000600, "Member 'UShowdownLobbyPanel_C::EarnPinScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, EventDetailsButton) == 0x000608, "Member 'UShowdownLobbyPanel_C::EventDetailsButton' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, HighestScoreTeammatesText) == 0x000610, "Member 'UShowdownLobbyPanel_C::HighestScoreTeammatesText' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, HighestScoreText) == 0x000618, "Member 'UShowdownLobbyPanel_C::HighestScoreText' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Image_35) == 0x000620, "Member 'UShowdownLobbyPanel_C::Image_35' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Image_DetailsButtonBG) == 0x000628, "Member 'UShowdownLobbyPanel_C::Image_DetailsButtonBG' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Image_ErrorBG) == 0x000630, "Member 'UShowdownLobbyPanel_C::Image_ErrorBG' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Image_PanelBorder) == 0x000638, "Member 'UShowdownLobbyPanel_C::Image_PanelBorder' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, NoMessage) == 0x000640, "Member 'UShowdownLobbyPanel_C::NoMessage' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, ScaleBox_DetailsText) == 0x000648, "Member 'UShowdownLobbyPanel_C::ScaleBox_DetailsText' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, ShowdownPin) == 0x000650, "Member 'UShowdownLobbyPanel_C::ShowdownPin' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, SizeBox_HighestScore) == 0x000658, "Member 'UShowdownLobbyPanel_C::SizeBox_HighestScore' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Text_CrossplayWarning) == 0x000660, "Member 'UShowdownLobbyPanel_C::Text_CrossplayWarning' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Text_MatchCapWarning) == 0x000668, "Member 'UShowdownLobbyPanel_C::Text_MatchCapWarning' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, Text_Remaining) == 0x000670, "Member 'UShowdownLobbyPanel_C::Text_Remaining' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, TournamentTitle) == 0x000678, "Member 'UShowdownLobbyPanel_C::TournamentTitle' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, TournamentTitle2) == 0x000680, "Member 'UShowdownLobbyPanel_C::TournamentTitle2' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, WarningMessage) == 0x000688, "Member 'UShowdownLobbyPanel_C::WarningMessage' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, PrimaryColor) == 0x000690, "Member 'UShowdownLobbyPanel_C::PrimaryColor' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, ShadowColor) == 0x0006B8, "Member 'UShowdownLobbyPanel_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyPanel_C, HighlightColor) == 0x0006E0, "Member 'UShowdownLobbyPanel_C::HighlightColor' has a wrong offset!");

}

