#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowdownLobbyViolator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShowdownLobbyViolator.ShowdownLobbyViolator_C
// 0x0058 (0x0610 - 0x05B8)
class UShowdownLobbyViolator_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_DetailsBG;                            // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_HighlightBorder;                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_TopContainer;                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_TimeRemainingDesc;                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_Status;                       // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGFillColor;                                 // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InnerTriangle;                               // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ShowdownTitle;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          RunOnce;                                           // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ShowdownLobbyViolator(int32 EntryPoint);
	void RefreshDataBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShowdownLobbyViolator_C">();
	}
	static class UShowdownLobbyViolator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowdownLobbyViolator_C>();
	}
};
static_assert(alignof(UShowdownLobbyViolator_C) == 0x000008, "Wrong alignment on UShowdownLobbyViolator_C");
static_assert(sizeof(UShowdownLobbyViolator_C) == 0x000610, "Wrong size on UShowdownLobbyViolator_C");
static_assert(offsetof(UShowdownLobbyViolator_C, UberGraphFrame) == 0x0005B8, "Member 'UShowdownLobbyViolator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Intro) == 0x0005C0, "Member 'UShowdownLobbyViolator_C::Intro' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonBorder_DetailsBG) == 0x0005C8, "Member 'UShowdownLobbyViolator_C::CommonBorder_DetailsBG' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonBorder_HighlightBorder) == 0x0005D0, "Member 'UShowdownLobbyViolator_C::CommonBorder_HighlightBorder' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonBorder_TopContainer) == 0x0005D8, "Member 'UShowdownLobbyViolator_C::CommonBorder_TopContainer' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonTextBlock_TimeRemainingDesc) == 0x0005E0, "Member 'UShowdownLobbyViolator_C::CommonTextBlock_TimeRemainingDesc' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, CommonWidgetSwitcher_Status) == 0x0005E8, "Member 'UShowdownLobbyViolator_C::CommonWidgetSwitcher_Status' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Image_BGFillColor) == 0x0005F0, "Member 'UShowdownLobbyViolator_C::Image_BGFillColor' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Image_InnerTriangle) == 0x0005F8, "Member 'UShowdownLobbyViolator_C::Image_InnerTriangle' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, Text_ShowdownTitle) == 0x000600, "Member 'UShowdownLobbyViolator_C::Text_ShowdownTitle' has a wrong offset!");
static_assert(offsetof(UShowdownLobbyViolator_C, RunOnce) == 0x000608, "Member 'UShowdownLobbyViolator_C::RunOnce' has a wrong offset!");

}

