#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignInAlternateWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SignInAlternateWidget.SignInAlternateWidget_C
// 0x0040 (0x03D0 - 0x0390)
class USignInAlternateWidget_C final : public UFortSignInWidget
{
public:
	class UNamedSlot*                             ButtonSlot;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_0;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentBox;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEmergencyNoticeWidget_C*               EmergencyNoticeWidget;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_133;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    LoginInputAction;                                  // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SignInAlternateWidget_C">();
	}
	static class USignInAlternateWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignInAlternateWidget_C>();
	}
};
static_assert(alignof(USignInAlternateWidget_C) == 0x000008, "Wrong alignment on USignInAlternateWidget_C");
static_assert(sizeof(USignInAlternateWidget_C) == 0x0003D0, "Wrong size on USignInAlternateWidget_C");
static_assert(offsetof(USignInAlternateWidget_C, ButtonSlot) == 0x000390, "Member 'USignInAlternateWidget_C::ButtonSlot' has a wrong offset!");
static_assert(offsetof(USignInAlternateWidget_C, CommonLazyImage_0) == 0x000398, "Member 'USignInAlternateWidget_C::CommonLazyImage_0' has a wrong offset!");
static_assert(offsetof(USignInAlternateWidget_C, ContentBox) == 0x0003A0, "Member 'USignInAlternateWidget_C::ContentBox' has a wrong offset!");
static_assert(offsetof(USignInAlternateWidget_C, EmergencyNoticeWidget) == 0x0003A8, "Member 'USignInAlternateWidget_C::EmergencyNoticeWidget' has a wrong offset!");
static_assert(offsetof(USignInAlternateWidget_C, Image_132) == 0x0003B0, "Member 'USignInAlternateWidget_C::Image_132' has a wrong offset!");
static_assert(offsetof(USignInAlternateWidget_C, Image_133) == 0x0003B8, "Member 'USignInAlternateWidget_C::Image_133' has a wrong offset!");
static_assert(offsetof(USignInAlternateWidget_C, LoginInputAction) == 0x0003C0, "Member 'USignInAlternateWidget_C::LoginInputAction' has a wrong offset!");

}

