#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmallStatRowWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SmallStatRowWidget.SmallStatRowWidget_C
// 0x0018 (0x0260 - 0x0248)
class USmallStatRowWidget_C final : public UAthenaProfileStatWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       StatName;                                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                StatValue;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SmallStatRowWidget(int32 EntryPoint);
	void OnStatChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SmallStatRowWidget_C">();
	}
	static class USmallStatRowWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmallStatRowWidget_C>();
	}
};
static_assert(alignof(USmallStatRowWidget_C) == 0x000008, "Wrong alignment on USmallStatRowWidget_C");
static_assert(sizeof(USmallStatRowWidget_C) == 0x000260, "Wrong size on USmallStatRowWidget_C");
static_assert(offsetof(USmallStatRowWidget_C, UberGraphFrame) == 0x000248, "Member 'USmallStatRowWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USmallStatRowWidget_C, StatName) == 0x000250, "Member 'USmallStatRowWidget_C::StatName' has a wrong offset!");
static_assert(offsetof(USmallStatRowWidget_C, StatValue) == 0x000258, "Member 'USmallStatRowWidget_C::StatValue' has a wrong offset!");

}

