#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialImportButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialImportButton.SocialImportButton_C
// 0x0040 (0x0BA0 - 0x0B60)
class USocialImportButton_C final : public UFortSocialImportButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContentBorder;                                     // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RightExtraContentSlot;                             // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextOverride;                                      // 0x0B88(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_SocialImportButton(int32 EntryPoint);
	void OnCaptionGenerated(const class FText& Caption);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialImportButton_C">();
	}
	static class USocialImportButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialImportButton_C>();
	}
};
static_assert(alignof(USocialImportButton_C) == 0x000008, "Wrong alignment on USocialImportButton_C");
static_assert(sizeof(USocialImportButton_C) == 0x000BA0, "Wrong size on USocialImportButton_C");
static_assert(offsetof(USocialImportButton_C, UberGraphFrame) == 0x000B60, "Member 'USocialImportButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, CenterButtonTextWidget) == 0x000B68, "Member 'USocialImportButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, ContentBorder) == 0x000B70, "Member 'USocialImportButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, LeftSideImage) == 0x000B78, "Member 'USocialImportButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, RightExtraContentSlot) == 0x000B80, "Member 'USocialImportButton_C::RightExtraContentSlot' has a wrong offset!");
static_assert(offsetof(USocialImportButton_C, TextOverride) == 0x000B88, "Member 'USocialImportButton_C::TextOverride' has a wrong offset!");

}

