#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialPanelView_UserLists

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialPanelView_UserLists.SocialPanelView_UserLists_C
// 0x0078 (0x0358 - 0x02E0)
class USocialPanelView_UserLists_C final : public UFortSocialPanelView_UserLists
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WeGameButtonHovered;                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitcherTransition;                                // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoFriendsArrowBounce;                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleTabShine;                                    // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleTabHighlight;                                // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuAnchorItemOpen;                                // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open_0;                                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                PanelTabHighlight;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_0;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialPanel_FriendLinkButton_C*        SocialPanel_FriendLinkButton;                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialPanelTab_C*                      CurSelectedPanelTab;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSwitchingFriendsButton;                           // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SocialPanelView_UserLists(int32 EntryPoint);
	void BndEvt__Button_AddWeGameFriends_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_AddWeGameFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Switcher_UserLists_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialPanelView_UserLists_C">();
	}
	static class USocialPanelView_UserLists_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPanelView_UserLists_C>();
	}
};
static_assert(alignof(USocialPanelView_UserLists_C) == 0x000008, "Wrong alignment on USocialPanelView_UserLists_C");
static_assert(sizeof(USocialPanelView_UserLists_C) == 0x000358, "Wrong size on USocialPanelView_UserLists_C");
static_assert(offsetof(USocialPanelView_UserLists_C, UberGraphFrame) == 0x0002E0, "Member 'USocialPanelView_UserLists_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, WeGameButtonHovered) == 0x0002E8, "Member 'USocialPanelView_UserLists_C::WeGameButtonHovered' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, SwitcherTransition) == 0x0002F0, "Member 'USocialPanelView_UserLists_C::SwitcherTransition' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, NoFriendsArrowBounce) == 0x0002F8, "Member 'USocialPanelView_UserLists_C::NoFriendsArrowBounce' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, ToggleTabShine) == 0x000300, "Member 'USocialPanelView_UserLists_C::ToggleTabShine' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, ToggleTabHighlight) == 0x000308, "Member 'USocialPanelView_UserLists_C::ToggleTabHighlight' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, MenuAnchorItemOpen) == 0x000310, "Member 'USocialPanelView_UserLists_C::MenuAnchorItemOpen' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Open_0) == 0x000318, "Member 'USocialPanelView_UserLists_C::Open_0' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Open) == 0x000320, "Member 'USocialPanelView_UserLists_C::Open' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, PanelTabHighlight) == 0x000328, "Member 'USocialPanelView_UserLists_C::PanelTabHighlight' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, RichTextBlock_0) == 0x000330, "Member 'USocialPanelView_UserLists_C::RichTextBlock_0' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, Shine) == 0x000338, "Member 'USocialPanelView_UserLists_C::Shine' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, SocialPanel_FriendLinkButton) == 0x000340, "Member 'USocialPanelView_UserLists_C::SocialPanel_FriendLinkButton' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, CurSelectedPanelTab) == 0x000348, "Member 'USocialPanelView_UserLists_C::CurSelectedPanelTab' has a wrong offset!");
static_assert(offsetof(USocialPanelView_UserLists_C, bSwitchingFriendsButton) == 0x000350, "Member 'USocialPanelView_UserLists_C::bSwitchingFriendsButton' has a wrong offset!");

}

