#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialSettingToggle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SocialSettingToggle.SocialSettingToggle_C.ExecuteUbergraph_SocialSettingToggle
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle) == 0x000004, "Wrong alignment on SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle");
static_assert(sizeof(SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle) == 0x000004, "Wrong size on SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle");
static_assert(offsetof(SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle, EntryPoint) == 0x000000, "Member 'SocialSettingToggle_C_ExecuteUbergraph_SocialSettingToggle::EntryPoint' has a wrong offset!");

// Function SocialSettingToggle.SocialSettingToggle_C.UpdateSize
// 0x0050 (0x0050 - 0x0000)
struct SocialSettingToggle_C_UpdateSize final
{
public:
	struct FVector2D                              LargeSize;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SmallSize;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button1;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue1;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue2;                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select2_Default;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingToggle_C_UpdateSize) == 0x000008, "Wrong alignment on SocialSettingToggle_C_UpdateSize");
static_assert(sizeof(SocialSettingToggle_C_UpdateSize) == 0x000050, "Wrong size on SocialSettingToggle_C_UpdateSize");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, LargeSize) == 0x000000, "Member 'SocialSettingToggle_C_UpdateSize::LargeSize' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, SmallSize) == 0x000008, "Member 'SocialSettingToggle_C_UpdateSize::SmallSize' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, Temp_int_Variable) == 0x000010, "Member 'SocialSettingToggle_C_UpdateSize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, Temp_bool_Variable) == 0x000014, "Member 'SocialSettingToggle_C_UpdateSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000018, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_DynamicCast_AsIcon_Text_Button1) == 0x000028, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_DynamicCast_AsIcon_Text_Button1' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, CallFunc_IsMobileGame_ReturnValue) == 0x000031, "Member 'SocialSettingToggle_C_UpdateSize::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, CallFunc_IsMobileGame_ReturnValue1) == 0x000032, "Member 'SocialSettingToggle_C_UpdateSize::CallFunc_IsMobileGame_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, CallFunc_IsMobileGame_ReturnValue2) == 0x000033, "Member 'SocialSettingToggle_C_UpdateSize::CallFunc_IsMobileGame_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_Select_Default) == 0x000034, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, Temp_int_Variable1) == 0x00003C, "Member 'SocialSettingToggle_C_UpdateSize::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, Temp_bool_Variable1) == 0x000040, "Member 'SocialSettingToggle_C_UpdateSize::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, Temp_bool_Variable2) == 0x000041, "Member 'SocialSettingToggle_C_UpdateSize::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_Select1_Default) == 0x000044, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(SocialSettingToggle_C_UpdateSize, K2Node_Select2_Default) == 0x000048, "Member 'SocialSettingToggle_C_UpdateSize::K2Node_Select2_Default' has a wrong offset!");

}

