#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Party_classes.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SocialUMG_structs.hpp"


namespace SDK
{

// Class SocialUMG.SocialChatChannelTab
// 0x0010 (0x0B40 - 0x0B30)
class USocialChatChannelTab : public UCommonButton
{
public:
	class USocialChatChannel*                     ChatChannel;                                       // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       CommonText_ChannelName;                            // 0x0B38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChannelTab">();
	}
	static class USocialChatChannelTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChannelTab>();
	}
};
static_assert(alignof(USocialChatChannelTab) == 0x000008, "Wrong alignment on USocialChatChannelTab");
static_assert(sizeof(USocialChatChannelTab) == 0x000B40, "Wrong size on USocialChatChannelTab");
static_assert(offsetof(USocialChatChannelTab, ChatChannel) == 0x000B30, "Member 'USocialChatChannelTab::ChatChannel' has a wrong offset!");
static_assert(offsetof(USocialChatChannelTab, CommonText_ChannelName) == 0x000B38, "Member 'USocialChatChannelTab::CommonText_ChannelName' has a wrong offset!");

// Class SocialUMG.SocialChatContainer
// 0x0058 (0x0288 - 0x0230)
class USocialChatContainer : public UUserWidget
{
public:
	class USocialChatManager*                     ChatManager;                                       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USocialChatChannel*>             JoinedChannels;                                    // 0x0238(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USocialChatChannel*                     ActiveChannel;                                     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                     TabButtonGroup;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatMessageList*                 ChatList_Messages;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialChatEditableText*                ChatEditableText_MessageEntry;                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_SendMessage;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_JoinedChannels;                           // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Channels;                                // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DynamicHandleMessageTextCommitted(const class FText& MessageText, ETextCommit CommitMethod);
	void FocusEditableText();
	void HandleLeftTabPressed();
	void HandleRightTabPressed();
	void OnChatOpenChanged(bool bShouldBeOpen);
	void SendCurrentMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatContainer">();
	}
	static class USocialChatContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatContainer>();
	}
};
static_assert(alignof(USocialChatContainer) == 0x000008, "Wrong alignment on USocialChatContainer");
static_assert(sizeof(USocialChatContainer) == 0x000288, "Wrong size on USocialChatContainer");
static_assert(offsetof(USocialChatContainer, ChatManager) == 0x000230, "Member 'USocialChatContainer::ChatManager' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, JoinedChannels) == 0x000238, "Member 'USocialChatContainer::JoinedChannels' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ActiveChannel) == 0x000248, "Member 'USocialChatContainer::ActiveChannel' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, TabButtonGroup) == 0x000250, "Member 'USocialChatContainer::TabButtonGroup' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ChatList_Messages) == 0x000260, "Member 'USocialChatContainer::ChatList_Messages' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ChatEditableText_MessageEntry) == 0x000268, "Member 'USocialChatContainer::ChatEditableText_MessageEntry' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, Button_SendMessage) == 0x000270, "Member 'USocialChatContainer::Button_SendMessage' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, EntryBox_JoinedChannels) == 0x000278, "Member 'USocialChatContainer::EntryBox_JoinedChannels' has a wrong offset!");
static_assert(offsetof(USocialChatContainer, ScrollBox_Channels) == 0x000280, "Member 'USocialChatContainer::ScrollBox_Channels' has a wrong offset!");

// Class SocialUMG.SocialChatEditableText
// 0x04E0 (0x05E8 - 0x0108)
class USocialChatEditableText final : public UWidget
{
public:
	uint8                                         Pad_108[0x20];                                     // 0x0108(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0128(0x0218)(Edit, NativeAccessSpecifierPrivate)
	struct FTextBlockStyle                        AutoCompleteStyle;                                 // 0x0340(0x0268)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A8[0x40];                                     // 0x05A8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatEditableText">();
	}
	static class USocialChatEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatEditableText>();
	}
};
static_assert(alignof(USocialChatEditableText) == 0x000008, "Wrong alignment on USocialChatEditableText");
static_assert(sizeof(USocialChatEditableText) == 0x0005E8, "Wrong size on USocialChatEditableText");
static_assert(offsetof(USocialChatEditableText, EditableTextStyle) == 0x000128, "Member 'USocialChatEditableText::EditableTextStyle' has a wrong offset!");
static_assert(offsetof(USocialChatEditableText, AutoCompleteStyle) == 0x000340, "Member 'USocialChatEditableText::AutoCompleteStyle' has a wrong offset!");

// Class SocialUMG.SocialChatMessageEntry
// 0x0168 (0x0398 - 0x0230)
class USocialChatMessageEntry : public UUserWidget
{
public:
	uint8                                         Pad_230[0x18];                                     // 0x0230(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialChatMessageEntryStyle           DefaultStyle;                                      // 0x0248(0x0120)(Edit, Protected, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_Message;                                      // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_SenderName;                                   // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_ChannelName;                                  // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_Timestamp;                                    // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                Button_MessageButton;                              // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMessageSet();

	bool CanInteract() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageEntry">();
	}
	static class USocialChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageEntry>();
	}
};
static_assert(alignof(USocialChatMessageEntry) == 0x000008, "Wrong alignment on USocialChatMessageEntry");
static_assert(sizeof(USocialChatMessageEntry) == 0x000398, "Wrong size on USocialChatMessageEntry");
static_assert(offsetof(USocialChatMessageEntry, DefaultStyle) == 0x000248, "Member 'USocialChatMessageEntry::DefaultStyle' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, Text_Message) == 0x000368, "Member 'USocialChatMessageEntry::Text_Message' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, Text_SenderName) == 0x000370, "Member 'USocialChatMessageEntry::Text_SenderName' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, Text_ChannelName) == 0x000378, "Member 'USocialChatMessageEntry::Text_ChannelName' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, Text_Timestamp) == 0x000380, "Member 'USocialChatMessageEntry::Text_Timestamp' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, HorizontalBox_Header) == 0x000388, "Member 'USocialChatMessageEntry::HorizontalBox_Header' has a wrong offset!");
static_assert(offsetof(USocialChatMessageEntry, Button_MessageButton) == 0x000390, "Member 'USocialChatMessageEntry::Button_MessageButton' has a wrong offset!");

// Class SocialUMG.SocialChatMessageList
// 0x00D8 (0x02E8 - 0x0210)
class USocialChatMessageList final : public UListViewBase
{
public:
	uint8                                         Pad_210[0xA8];                                     // 0x0210(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsFocusable;                                      // 0x02B8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatChannel*                     ActiveChannel;                                     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x20];                                     // 0x02C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageList">();
	}
	static class USocialChatMessageList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageList>();
	}
};
static_assert(alignof(USocialChatMessageList) == 0x000008, "Wrong alignment on USocialChatMessageList");
static_assert(sizeof(USocialChatMessageList) == 0x0002E8, "Wrong size on USocialChatMessageList");
static_assert(offsetof(USocialChatMessageList, bIsFocusable) == 0x0002B8, "Member 'USocialChatMessageList::bIsFocusable' has a wrong offset!");
static_assert(offsetof(USocialChatMessageList, ActiveChannel) == 0x0002C0, "Member 'USocialChatMessageList::ActiveChannel' has a wrong offset!");

// Class SocialUMG.SocialInteractionButton
// 0x0060 (0x0B90 - 0x0B30)
class USocialInteractionButton : public UCommonButton
{
public:
	struct FLinearColor                           DefaultIndicatorColor;                             // 0x0B30(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           AlertingIndicatorColor;                            // 0x0B40(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B50[0x30];                                     // 0x0B50(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x0B80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0B88(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInteractionSet();

	class FName GetInteractionName() const;
	bool IsPlatformOnlyFriend() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionButton">();
	}
	static class USocialInteractionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionButton>();
	}
};
static_assert(alignof(USocialInteractionButton) == 0x000008, "Wrong alignment on USocialInteractionButton");
static_assert(sizeof(USocialInteractionButton) == 0x000B90, "Wrong size on USocialInteractionButton");
static_assert(offsetof(USocialInteractionButton, DefaultIndicatorColor) == 0x000B30, "Member 'USocialInteractionButton::DefaultIndicatorColor' has a wrong offset!");
static_assert(offsetof(USocialInteractionButton, AlertingIndicatorColor) == 0x000B40, "Member 'USocialInteractionButton::AlertingIndicatorColor' has a wrong offset!");
static_assert(offsetof(USocialInteractionButton, Text_InteractionName) == 0x000B80, "Member 'USocialInteractionButton::Text_InteractionName' has a wrong offset!");
static_assert(offsetof(USocialInteractionButton, Border_InteractionIndicator) == 0x000B88, "Member 'USocialInteractionButton::Border_InteractionIndicator' has a wrong offset!");

// Class SocialUMG.SocialInteractionMenu
// 0x0080 (0x02B0 - 0x0230)
class USocialInteractionMenu : public UUserWidget
{
public:
	class UObject*                                SocialContext;                                     // 0x0230(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x40];                                     // 0x0238(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_PositiveInteractions;                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_NegativeInteractions;                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpacer*                                Spacer_InteractionSeparator;                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                  Switcher_Confirmation;                             // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_ConfirmationLabel;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Confirm;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Decline;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSocialContextSet();
	void OnToggleConfirmation(bool bIsVisible);

	class UWidget* GetFirstEntryToCenter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionMenu">();
	}
	static class USocialInteractionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionMenu>();
	}
};
static_assert(alignof(USocialInteractionMenu) == 0x000008, "Wrong alignment on USocialInteractionMenu");
static_assert(sizeof(USocialInteractionMenu) == 0x0002B0, "Wrong size on USocialInteractionMenu");
static_assert(offsetof(USocialInteractionMenu, SocialContext) == 0x000230, "Member 'USocialInteractionMenu::SocialContext' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, EntryBox_PositiveInteractions) == 0x000278, "Member 'USocialInteractionMenu::EntryBox_PositiveInteractions' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, EntryBox_NegativeInteractions) == 0x000280, "Member 'USocialInteractionMenu::EntryBox_NegativeInteractions' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Spacer_InteractionSeparator) == 0x000288, "Member 'USocialInteractionMenu::Spacer_InteractionSeparator' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Switcher_Confirmation) == 0x000290, "Member 'USocialInteractionMenu::Switcher_Confirmation' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Text_ConfirmationLabel) == 0x000298, "Member 'USocialInteractionMenu::Text_ConfirmationLabel' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Button_Confirm) == 0x0002A0, "Member 'USocialInteractionMenu::Button_Confirm' has a wrong offset!");
static_assert(offsetof(USocialInteractionMenu, Button_Decline) == 0x0002A8, "Member 'USocialInteractionMenu::Button_Decline' has a wrong offset!");

// Class SocialUMG.DesignerPreviewChatChannel
// 0x0068 (0x0150 - 0x00E8)
class UDesignerPreviewChatChannel final : public USocialChatChannel
{
public:
	uint8                                         Pad_E8[0x68];                                      // 0x00E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerPreviewChatChannel">();
	}
	static class UDesignerPreviewChatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerPreviewChatChannel>();
	}
};
static_assert(alignof(UDesignerPreviewChatChannel) == 0x000008, "Wrong alignment on UDesignerPreviewChatChannel");
static_assert(sizeof(UDesignerPreviewChatChannel) == 0x000150, "Wrong size on UDesignerPreviewChatChannel");

// Class SocialUMG.SocialListEntry
// 0x0018 (0x0B48 - 0x0B30)
class USocialListEntry : public UCommonButton
{
public:
	uint8                                         Pad_B30[0x8];                                      // 0x0B30(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             Text_UserName;                                     // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0B40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListEntry">();
	}
	static class USocialListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntry>();
	}
};
static_assert(alignof(USocialListEntry) == 0x000008, "Wrong alignment on USocialListEntry");
static_assert(sizeof(USocialListEntry) == 0x000B48, "Wrong size on USocialListEntry");
static_assert(offsetof(USocialListEntry, Text_UserName) == 0x000B38, "Member 'USocialListEntry::Text_UserName' has a wrong offset!");
static_assert(offsetof(USocialListEntry, MenuAnchor_Actions) == 0x000B40, "Member 'USocialListEntry::MenuAnchor_Actions' has a wrong offset!");

// Class SocialUMG.SocialUserListEntry
// 0x0010 (0x0B58 - 0x0B48)
class USocialUserListEntry : public USocialListEntry
{
public:
	class USocialUser*                            SocialUser;                                        // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_RichPresence;                                 // 0x0B50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnUserPresenceChanged(EOnlineStatus OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListEntry">();
	}
	static class USocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListEntry>();
	}
};
static_assert(alignof(USocialUserListEntry) == 0x000008, "Wrong alignment on USocialUserListEntry");
static_assert(sizeof(USocialUserListEntry) == 0x000B58, "Wrong size on USocialUserListEntry");
static_assert(offsetof(USocialUserListEntry, SocialUser) == 0x000B48, "Member 'USocialUserListEntry::SocialUser' has a wrong offset!");
static_assert(offsetof(USocialUserListEntry, Text_RichPresence) == 0x000B50, "Member 'USocialUserListEntry::Text_RichPresence' has a wrong offset!");

// Class SocialUMG.SocialInviteListEntry
// 0x0008 (0x0B50 - 0x0B48)
class USocialInviteListEntry : public USocialListEntry
{
public:
	class USocialInvite*                          SocialInvite;                                      // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInviteListEntry">();
	}
	static class USocialInviteListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInviteListEntry>();
	}
};
static_assert(alignof(USocialInviteListEntry) == 0x000008, "Wrong alignment on USocialInviteListEntry");
static_assert(sizeof(USocialInviteListEntry) == 0x000B50, "Wrong size on USocialInviteListEntry");
static_assert(offsetof(USocialInviteListEntry, SocialInvite) == 0x000B48, "Member 'USocialInviteListEntry::SocialInvite' has a wrong offset!");

// Class SocialUMG.SocialUserListHeader
// 0x0040 (0x0068 - 0x0028)
class USocialUserListHeader : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListHeader">();
	}
	static class USocialUserListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeader>();
	}
};
static_assert(alignof(USocialUserListHeader) == 0x000008, "Wrong alignment on USocialUserListHeader");
static_assert(sizeof(USocialUserListHeader) == 0x000068, "Wrong size on USocialUserListHeader");

// Class SocialUMG.SocialInviteListHeader
// 0x0018 (0x0080 - 0x0068)
class USocialInviteListHeader final : public USocialUserListHeader
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USocialInvite*>                  SocialInvites;                                     // 0x0070(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInviteListHeader">();
	}
	static class USocialInviteListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInviteListHeader>();
	}
};
static_assert(alignof(USocialInviteListHeader) == 0x000008, "Wrong alignment on USocialInviteListHeader");
static_assert(sizeof(USocialInviteListHeader) == 0x000080, "Wrong size on USocialInviteListHeader");
static_assert(offsetof(USocialInviteListHeader, SocialInvites) == 0x000070, "Member 'USocialInviteListHeader::SocialInvites' has a wrong offset!");

// Class SocialUMG.SocialInvite
// 0x0008 (0x0030 - 0x0028)
class USocialInvite : public UObject
{
public:
	class USocialUser*                            OtherUser;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInvite">();
	}
	static class USocialInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInvite>();
	}
};
static_assert(alignof(USocialInvite) == 0x000008, "Wrong alignment on USocialInvite");
static_assert(sizeof(USocialInvite) == 0x000030, "Wrong size on USocialInvite");
static_assert(offsetof(USocialInvite, OtherUser) == 0x000028, "Member 'USocialInvite::OtherUser' has a wrong offset!");

// Class SocialUMG.SocialFriendInvite
// 0x0000 (0x0030 - 0x0030)
class USocialFriendInvite final : public USocialInvite
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialFriendInvite">();
	}
	static class USocialFriendInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFriendInvite>();
	}
};
static_assert(alignof(USocialFriendInvite) == 0x000008, "Wrong alignment on USocialFriendInvite");
static_assert(sizeof(USocialFriendInvite) == 0x000030, "Wrong size on USocialFriendInvite");

// Class SocialUMG.SocialPartyInvite
// 0x0000 (0x0030 - 0x0030)
class USocialPartyInvite final : public USocialInvite
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialPartyInvite">();
	}
	static class USocialPartyInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPartyInvite>();
	}
};
static_assert(alignof(USocialPartyInvite) == 0x000008, "Wrong alignment on USocialPartyInvite");
static_assert(sizeof(USocialPartyInvite) == 0x000030, "Wrong size on USocialPartyInvite");

// Class SocialUMG.SocialUserListHeaderEntry
// 0x0020 (0x0B50 - 0x0B30)
class USocialUserListHeaderEntry : public UCommonButton
{
public:
	uint8                                         Pad_B30[0x8];                                      // 0x0B30(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialUserListHeader*                  ListHeader;                                        // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_ListName;                                     // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_NumEntries;                                   // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListHeaderEntry">();
	}
	static class USocialUserListHeaderEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeaderEntry>();
	}
};
static_assert(alignof(USocialUserListHeaderEntry) == 0x000008, "Wrong alignment on USocialUserListHeaderEntry");
static_assert(sizeof(USocialUserListHeaderEntry) == 0x000B50, "Wrong size on USocialUserListHeaderEntry");
static_assert(offsetof(USocialUserListHeaderEntry, ListHeader) == 0x000B38, "Member 'USocialUserListHeaderEntry::ListHeader' has a wrong offset!");
static_assert(offsetof(USocialUserListHeaderEntry, Text_ListName) == 0x000B40, "Member 'USocialUserListHeaderEntry::Text_ListName' has a wrong offset!");
static_assert(offsetof(USocialUserListHeaderEntry, Text_NumEntries) == 0x000B48, "Member 'USocialUserListHeaderEntry::Text_NumEntries' has a wrong offset!");

// Class SocialUMG.SocialUserTreeView
// 0x0030 (0x03C0 - 0x0390)
class USocialUserTreeView final : public UTreeView
{
public:
	TSubclassOf<class USocialUserListEntry>       UserEntryWidgetClass;                              // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInviteListEntry>     InviteEntryWidgetClass;                            // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActionMenu;                                        // 0x03A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B0[0x10];                                     // 0x03B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserTreeView">();
	}
	static class USocialUserTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserTreeView>();
	}
};
static_assert(alignof(USocialUserTreeView) == 0x000008, "Wrong alignment on USocialUserTreeView");
static_assert(sizeof(USocialUserTreeView) == 0x0003C0, "Wrong size on USocialUserTreeView");
static_assert(offsetof(USocialUserTreeView, UserEntryWidgetClass) == 0x000390, "Member 'USocialUserTreeView::UserEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(USocialUserTreeView, InviteEntryWidgetClass) == 0x000398, "Member 'USocialUserTreeView::InviteEntryWidgetClass' has a wrong offset!");
static_assert(offsetof(USocialUserTreeView, ActionMenuClass) == 0x0003A0, "Member 'USocialUserTreeView::ActionMenuClass' has a wrong offset!");
