#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreenWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SplashScreenWidget.SplashScreenWidget_C
// 0x0070 (0x03A0 - 0x0330)
class USplashScreenWidget_C final : public UFortSplashScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InputPromptIdle;                                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USkewButton_C*                          Button_Start;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    GamepadActionWidget;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadInputHbox;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       GamepadInputText;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_BattleRoyale;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_Fortnite;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MobileInputHbox;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MobileInputText;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MouseInputHBox;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MouseInputText;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Input;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Logo;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SplashScreenWidget(int32 EntryPoint);
	void OnInputMethodChanged(bool UsingGampad);
	void Construct();
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplashScreenWidget_C">();
	}
	static class USplashScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplashScreenWidget_C>();
	}
};
static_assert(alignof(USplashScreenWidget_C) == 0x000008, "Wrong alignment on USplashScreenWidget_C");
static_assert(sizeof(USplashScreenWidget_C) == 0x0003A0, "Wrong size on USplashScreenWidget_C");
static_assert(offsetof(USplashScreenWidget_C, UberGraphFrame) == 0x000330, "Member 'USplashScreenWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, InputPromptIdle) == 0x000338, "Member 'USplashScreenWidget_C::InputPromptIdle' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, Button_Start) == 0x000340, "Member 'USplashScreenWidget_C::Button_Start' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadActionWidget) == 0x000348, "Member 'USplashScreenWidget_C::GamepadActionWidget' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputHbox) == 0x000350, "Member 'USplashScreenWidget_C::GamepadInputHbox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, GamepadInputText) == 0x000358, "Member 'USplashScreenWidget_C::GamepadInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, I_BattleRoyale) == 0x000360, "Member 'USplashScreenWidget_C::I_BattleRoyale' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, I_Fortnite) == 0x000368, "Member 'USplashScreenWidget_C::I_Fortnite' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputHbox) == 0x000370, "Member 'USplashScreenWidget_C::MobileInputHbox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MobileInputText) == 0x000378, "Member 'USplashScreenWidget_C::MobileInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputHBox) == 0x000380, "Member 'USplashScreenWidget_C::MouseInputHBox' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, MouseInputText) == 0x000388, "Member 'USplashScreenWidget_C::MouseInputText' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, Switcher_Input) == 0x000390, "Member 'USplashScreenWidget_C::Switcher_Input' has a wrong offset!");
static_assert(offsetof(USplashScreenWidget_C, Switcher_Logo) == 0x000398, "Member 'USplashScreenWidget_C::Switcher_Logo' has a wrong offset!");

}

