#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadSlotItemPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SquadSlotItemPicker.SquadSlotItemPicker_C
// 0x0030 (0x0408 - 0x03D8)
class USquadSlotItemPicker_C final : public UFortSquadSlotItemPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideSort;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowSort;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show_Items;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide_Items;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       SortText;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SquadSlotItemPicker(int32 EntryPoint);
	void HandleSortChanged(ESquadSlotSortType CurrentSortType, ESquadSlotType NewParam);
	void Construct();
	void HandleChangeSort();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SquadSlotItemPicker_C">();
	}
	static class USquadSlotItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadSlotItemPicker_C>();
	}
};
static_assert(alignof(USquadSlotItemPicker_C) == 0x000008, "Wrong alignment on USquadSlotItemPicker_C");
static_assert(sizeof(USquadSlotItemPicker_C) == 0x000408, "Wrong size on USquadSlotItemPicker_C");
static_assert(offsetof(USquadSlotItemPicker_C, UberGraphFrame) == 0x0003D8, "Member 'USquadSlotItemPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USquadSlotItemPicker_C, HideSort) == 0x0003E0, "Member 'USquadSlotItemPicker_C::HideSort' has a wrong offset!");
static_assert(offsetof(USquadSlotItemPicker_C, ShowSort) == 0x0003E8, "Member 'USquadSlotItemPicker_C::ShowSort' has a wrong offset!");
static_assert(offsetof(USquadSlotItemPicker_C, Show_Items) == 0x0003F0, "Member 'USquadSlotItemPicker_C::Show_Items' has a wrong offset!");
static_assert(offsetof(USquadSlotItemPicker_C, Hide_Items) == 0x0003F8, "Member 'USquadSlotItemPicker_C::Hide_Items' has a wrong offset!");
static_assert(offsetof(USquadSlotItemPicker_C, SortText) == 0x000400, "Member 'USquadSlotItemPicker_C::SortText' has a wrong offset!");

}

