#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_Root

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_Root.StoreMain_Root_C
// 0x00A8 (0x0440 - 0x0398)
class UStoreMain_Root_C final : public UFortMtxStoreRootBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BorderPlatformMTX;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CurrencyNotificationBorder;                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyNotificationText;                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxOffers;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             LTMOffers;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LTMOffersSection;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              OfferScaleBoxRoot;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayProgressSpinner;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PurchasingDisabledBox;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SplitCurrencyText;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherItemsProgress;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOffers;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             VBuckOffers;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBuckOffersSection;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_MTXOffer_C*                  Mtx_Offer;                                         // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Ambient_Sound;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                InitiallyFocusedOffer;                             // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowingCampaignUpsell;                            // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_StoreMain_Root(int32 EntryPoint);
	void OnPurchasingDisabled();
	void GenerateOfferWidget(class UFortStoreFrontOfferInfo* OfferData);
	void OnUpdateOtherPlatformMTXMessage(bool HasOtherPlatformCurrency, const class FText& CurrencyMessageLocText);
	void OnRemovedFromActivationStack();
	void OnAddedToActivationStack();
	void ClearOfferWidgets();
	void OnStartReadingOffers();
	void OnDeactivated();
	void OnActivated();
	void OnOffersGenerated();
	void NoOffersAvailable();
	void Focus();
	void UpdateCurrencyNotification();
	void Start_Ambient_Sound(bool Condition);
	bool Get_Main_Tab_Reference();
	void LayoutVBuckTiles();
	void SetupFirstFocusableTile();
	void SetupForCampaignUpsell();
	void HandleRedeem(bool* bPassThrough);
	void HandleBack(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_Root_C">();
	}
	static class UStoreMain_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_Root_C>();
	}
};
static_assert(alignof(UStoreMain_Root_C) == 0x000008, "Wrong alignment on UStoreMain_Root_C");
static_assert(sizeof(UStoreMain_Root_C) == 0x000440, "Wrong size on UStoreMain_Root_C");
static_assert(offsetof(UStoreMain_Root_C, UberGraphFrame) == 0x000398, "Member 'UStoreMain_Root_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, BorderPlatformMTX) == 0x0003A0, "Member 'UStoreMain_Root_C::BorderPlatformMTX' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, CurrencyNotificationBorder) == 0x0003A8, "Member 'UStoreMain_Root_C::CurrencyNotificationBorder' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, CurrencyNotificationText) == 0x0003B0, "Member 'UStoreMain_Root_C::CurrencyNotificationText' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, HBoxOffers) == 0x0003B8, "Member 'UStoreMain_Root_C::HBoxOffers' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, LTMOffers) == 0x0003C0, "Member 'UStoreMain_Root_C::LTMOffers' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, LTMOffersSection) == 0x0003C8, "Member 'UStoreMain_Root_C::LTMOffersSection' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, NoOffersBox) == 0x0003D0, "Member 'UStoreMain_Root_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, OfferScaleBoxRoot) == 0x0003D8, "Member 'UStoreMain_Root_C::OfferScaleBoxRoot' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, OverlayProgressSpinner) == 0x0003E0, "Member 'UStoreMain_Root_C::OverlayProgressSpinner' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, ProgressSpinner) == 0x0003E8, "Member 'UStoreMain_Root_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, PurchasingDisabledBox) == 0x0003F0, "Member 'UStoreMain_Root_C::PurchasingDisabledBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, SplitCurrencyText) == 0x0003F8, "Member 'UStoreMain_Root_C::SplitCurrencyText' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, SwitcherItemsProgress) == 0x000400, "Member 'UStoreMain_Root_C::SwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, VBOffers) == 0x000408, "Member 'UStoreMain_Root_C::VBOffers' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, VBuckOffers) == 0x000410, "Member 'UStoreMain_Root_C::VBuckOffers' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, VBuckOffersSection) == 0x000418, "Member 'UStoreMain_Root_C::VBuckOffersSection' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Mtx_Offer) == 0x000420, "Member 'UStoreMain_Root_C::Mtx_Offer' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, Ambient_Sound) == 0x000428, "Member 'UStoreMain_Root_C::Ambient_Sound' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, InitiallyFocusedOffer) == 0x000430, "Member 'UStoreMain_Root_C::InitiallyFocusedOffer' has a wrong offset!");
static_assert(offsetof(UStoreMain_Root_C, bShowingCampaignUpsell) == 0x000438, "Member 'UStoreMain_Root_C::bShowingCampaignUpsell' has a wrong offset!");

}

