#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_MTXOffer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_MTXOffer.StoreMain_MTXOffer_C
// 0x00C0 (0x0C08 - 0x0B48)
class UStoreMain_MTXOffer_C final : public UFortStoreFrontOfferWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Embiggen;                                          // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightGlow_Founders;                            // 0x0B60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightGlow_VBuck;                               // 0x0B68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GradientFade;                                      // 0x0B70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOffer_SpecialBanner_C* AthenaDirectAcquisitionOffer_SpecialBanner;        // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColor;                                         // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BonusTextArea;                                     // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderAll;                                         // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyArt;                                            // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXCurrencyArea;                                   // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpotHighlight;                                     // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferName;                                     // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TileSize;                                          // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   AboutToShowDetails;                                // 0x0BF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          LargeTile;                                         // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AboutToShowDetails__DelegateSignature();
	void ExecuteUbergraph_StoreMain_MTXOffer(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnClick(class UCommonButton* Button);
	void Construct();
	void InitOffer();
	void ShowDetails();
	void TriggerIntro();
	void InitialReset();
	void TriggerReset();
	void SetTileSize(bool Large);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_MTXOffer_C">();
	}
	static class UStoreMain_MTXOffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_MTXOffer_C>();
	}
};
static_assert(alignof(UStoreMain_MTXOffer_C) == 0x000008, "Wrong alignment on UStoreMain_MTXOffer_C");
static_assert(sizeof(UStoreMain_MTXOffer_C) == 0x000C08, "Wrong size on UStoreMain_MTXOffer_C");
static_assert(offsetof(UStoreMain_MTXOffer_C, UberGraphFrame) == 0x000B48, "Member 'UStoreMain_MTXOffer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Intro) == 0x000B50, "Member 'UStoreMain_MTXOffer_C::Intro' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, Embiggen) == 0x000B58, "Member 'UStoreMain_MTXOffer_C::Embiggen' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, HighlightGlow_Founders) == 0x000B60, "Member 'UStoreMain_MTXOffer_C::HighlightGlow_Founders' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, HighlightGlow_VBuck) == 0x000B68, "Member 'UStoreMain_MTXOffer_C::HighlightGlow_VBuck' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, GradientFade) == 0x000B70, "Member 'UStoreMain_MTXOffer_C::GradientFade' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, AthenaDirectAcquisitionOffer_SpecialBanner) == 0x000B78, "Member 'UStoreMain_MTXOffer_C::AthenaDirectAcquisitionOffer_SpecialBanner' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BaseColor) == 0x000B80, "Member 'UStoreMain_MTXOffer_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BonusTextArea) == 0x000B88, "Member 'UStoreMain_MTXOffer_C::BonusTextArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, BorderAll) == 0x000B90, "Member 'UStoreMain_MTXOffer_C::BorderAll' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, CommonText_BaseQuantity) == 0x000B98, "Member 'UStoreMain_MTXOffer_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, CommonText_BonusQuantity) == 0x000BA0, "Member 'UStoreMain_MTXOffer_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, KeyArt) == 0x000BA8, "Member 'UStoreMain_MTXOffer_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, MTXCurrencyArea) == 0x000BB0, "Member 'UStoreMain_MTXOffer_C::MTXCurrencyArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, OverlayGradient) == 0x000BB8, "Member 'UStoreMain_MTXOffer_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, OverlaySalePrice) == 0x000BC0, "Member 'UStoreMain_MTXOffer_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, SpotHighlight) == 0x000BC8, "Member 'UStoreMain_MTXOffer_C::SpotHighlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOfferDisplayPrice) == 0x000BD0, "Member 'UStoreMain_MTXOffer_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOfferName) == 0x000BD8, "Member 'UStoreMain_MTXOffer_C::TextOfferName' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TextOriginalPrice) == 0x000BE0, "Member 'UStoreMain_MTXOffer_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, TileSize) == 0x000BE8, "Member 'UStoreMain_MTXOffer_C::TileSize' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, AboutToShowDetails) == 0x000BF0, "Member 'UStoreMain_MTXOffer_C::AboutToShowDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C, LargeTile) == 0x000C00, "Member 'UStoreMain_MTXOffer_C::LargeTile' has a wrong offset!");

}

