#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamingInstallProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function StreamingInstallProgressBar.StreamingInstallProgressBar_C.ExecuteUbergraph_StreamingInstallProgressBar
// 0x0004 (0x0004 - 0x0000)
struct StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar) == 0x000004, "Wrong alignment on StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar");
static_assert(sizeof(StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar) == 0x000004, "Wrong size on StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar");
static_assert(offsetof(StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar, EntryPoint) == 0x000000, "Member 'StreamingInstallProgressBar_C_ExecuteUbergraph_StreamingInstallProgressBar::EntryPoint' has a wrong offset!");

// Function StreamingInstallProgressBar.StreamingInstallProgressBar_C.ToggleTimer
// 0x0020 (0x0020 - 0x0000)
struct StreamingInstallProgressBar_C_ToggleTimer final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StreamingInstallProgressBar_C_ToggleTimer) == 0x000008, "Wrong alignment on StreamingInstallProgressBar_C_ToggleTimer");
static_assert(sizeof(StreamingInstallProgressBar_C_ToggleTimer) == 0x000020, "Wrong size on StreamingInstallProgressBar_C_ToggleTimer");
static_assert(offsetof(StreamingInstallProgressBar_C_ToggleTimer, Enable) == 0x000000, "Member 'StreamingInstallProgressBar_C_ToggleTimer::Enable' has a wrong offset!");
static_assert(offsetof(StreamingInstallProgressBar_C_ToggleTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'StreamingInstallProgressBar_C_ToggleTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StreamingInstallProgressBar_C_ToggleTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'StreamingInstallProgressBar_C_ToggleTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function StreamingInstallProgressBar.StreamingInstallProgressBar_C.RefreshTick
// 0x0010 (0x0010 - 0x0000)
struct StreamingInstallProgressBar_C_RefreshTick final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ContentInstallationProgress_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StreamingInstallProgressBar_C_RefreshTick) == 0x000008, "Wrong alignment on StreamingInstallProgressBar_C_RefreshTick");
static_assert(sizeof(StreamingInstallProgressBar_C_RefreshTick) == 0x000010, "Wrong size on StreamingInstallProgressBar_C_RefreshTick");
static_assert(offsetof(StreamingInstallProgressBar_C_RefreshTick, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'StreamingInstallProgressBar_C_RefreshTick::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StreamingInstallProgressBar_C_RefreshTick, CallFunc_ContentInstallationProgress_ReturnValue) == 0x000008, "Member 'StreamingInstallProgressBar_C_RefreshTick::CallFunc_ContentInstallationProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(StreamingInstallProgressBar_C_RefreshTick, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'StreamingInstallProgressBar_C_RefreshTick::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

