#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupportHeroSquadBonusesDetailWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C.ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget
// 0x0038 (0x0038 - 0x0000)
struct SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SquadName, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue1;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget) == 0x000008, "Wrong alignment on SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget");
static_assert(sizeof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget) == 0x000038, "Wrong size on SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget, EntryPoint) == 0x000000, "Member 'SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget, K2Node_DynamicCast_AsFort_Hero) == 0x000018, "Member 'SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget, CallFunc_GetContext_ReturnValue1) == 0x000030, "Member 'SupportHeroSquadBonusesDetailWidget_C_ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget::CallFunc_GetContext_ReturnValue1' has a wrong offset!");

// Function SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C.UpdateVisibility
// 0x00C8 (0x00C8 - 0x0000)
struct SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility final
{
public:
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId1;   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId2;   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex2; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeroLoadoutSystemEnabled_ReturnValue;   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHomebaseSquad                         CallFunc_TryGetHomebaseSquadData_OutHomebaseSquad; // 0x0038(0x0088)()
	bool                                          CallFunc_TryGetHomebaseSquadData_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility) == 0x000008, "Wrong alignment on SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility");
static_assert(sizeof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility) == 0x0000C8, "Wrong size on SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000000, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000008, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId1) == 0x00000C, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex1) == 0x000014, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000019, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId2) == 0x00001C, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId2' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex2) == 0x000024, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex2' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, Temp_byte_Variable) == 0x000029, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, Temp_byte_Variable1) == 0x00002A, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, Temp_bool_Variable) == 0x00002B, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_IsHeroLoadoutSystemEnabled_ReturnValue) == 0x00002C, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_IsHeroLoadoutSystemEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_TryGetHomebaseSquadData_OutHomebaseSquad) == 0x000038, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_TryGetHomebaseSquadData_OutHomebaseSquad' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_TryGetHomebaseSquadData_ReturnValue) == 0x0000C0, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_TryGetHomebaseSquadData_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C2, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_BooleanAND_ReturnValue) == 0x0000C3, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_BooleanOR_ReturnValue1) == 0x0000C4, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_BooleanAND_ReturnValue1) == 0x0000C5, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, CallFunc_BooleanAND_ReturnValue2) == 0x0000C6, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility, K2Node_Select_Default) == 0x0000C7, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");

// Function SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C.UpdatePerkWidgets
// 0x0014 (0x0014 - 0x0000)
struct SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortSupportBonusType                         Temp_byte_Variable1;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets) == 0x000004, "Wrong alignment on SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets");
static_assert(sizeof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets) == 0x000014, "Wrong size on SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, Temp_bool_Variable) == 0x000000, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000004, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x00000C, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, Temp_byte_Variable) == 0x000010, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, Temp_byte_Variable1) == 0x000012, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets, K2Node_Select_Default) == 0x000013, "Member 'SupportHeroSquadBonusesDetailWidget_C_UpdatePerkWidgets::K2Node_Select_Default' has a wrong offset!");

// Function SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct SupportHeroSquadBonusesDetailWidget_C_SetState final
{
public:
	EFortSupportPerkWidgetState                   InState;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SupportHeroSquadBonusesDetailWidget_C_SetState) == 0x000001, "Wrong alignment on SupportHeroSquadBonusesDetailWidget_C_SetState");
static_assert(sizeof(SupportHeroSquadBonusesDetailWidget_C_SetState) == 0x000001, "Wrong size on SupportHeroSquadBonusesDetailWidget_C_SetState");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_SetState, InState) == 0x000000, "Member 'SupportHeroSquadBonusesDetailWidget_C_SetState::InState' has a wrong offset!");

// Function SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C.HandleSquadSlotChanged
// 0x001C (0x001C - 0x0000)
struct SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged final
{
public:
	class FName                                   SquadName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged) == 0x000004, "Wrong alignment on SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged");
static_assert(sizeof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged) == 0x00001C, "Wrong size on SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, SquadName) == 0x000000, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::SquadName' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, SlotIndex) == 0x000008, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x00000C, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000014, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'SupportHeroSquadBonusesDetailWidget_C_HandleSquadSlotChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

