#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMemberPedestal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TeamMemberPedestal.TeamMemberPedestal_C
// 0x0138 (0x0538 - 0x0400)
class ATeamMemberPedestal_C final : public AFortTeamMemberPedestal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CharacterPlacement;                                // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FE_Smoke;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LightsParent;                                      // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSparkle;                       // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSwirl02;                       // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSwirl01;                       // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lobby_Character_Pad_Light_Ring;                 // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lobby_Character_Pad;                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lobby_Character_TopSpot;                        // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   UnderlightBluePoint02;                             // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   UnderlightBluePoint01;                             // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    UnderlightBlue02;                                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    UnderlightBlue01;                                  // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimSpotLight;                                      // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    TopSpotLight;                                      // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewMesh;                                       // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayerSelected;                                 // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Pad;                                           // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   Debug_OnFriendLFGRequest;                          // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UOverlay*                               Hovered_InputAction;                               // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerPadGadgets_C*               Gadgets;                                           // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerAddPlayer_C*                PlayerAdd;                                         // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        LastAnimatedPlayerPawn;                            // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowPartySuggestions;                            // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OffsetLobbyAddPlayer;                              // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayerPodiumHovered;                              // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Pad_Light_Ring;                                // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Top_Light_Ring;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FxActive;                                          // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Holo;                                          // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     HoloMaterial;                                      // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               Hovered_WithPlayer_InputAction;                    // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLobbyLayout;                                    // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LightBrightnessScale;                              // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopSpotLight_Brightness;                           // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopSpotLight_Brightness_Hovered;                   // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RimSpotLight_Brightness;                           // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnderlightBlueSpot_Brightness;                     // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnderlightBlueSpot_Brightness_Hovered;             // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnderlightBluePoint_Brightness;                    // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnderlightBluePoint_Brightness_Hovered;            // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugHoveredLighting;                              // 0x0534(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Debug_OnFriendLFGRequest__DelegateSignature(int32 PlayerIndex);
	void ExecuteUbergraph_TeamMemberPedestal(int32 EntryPoint);
	void OnItemClicked();
	void OnPedestalIsPopulatedChanged(bool bIsPopulated);
	void OnIsCurrentlyInMatchChanged(bool bIsInMatch);
	void RefreshBattlePassOwnerVisuals(bool bOwnsBattlePass);
	void OnConnectedToCampaignLobby();
	void ReceiveBeginPlay();
	void OnUnhovered();
	void HandleClientEvent_StoreTabClosed(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void OnHovered();
	void HandleClientEvent_StoreTabSelected(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void UserConstructionScript();
	void InitializeContextEvents();
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void OnTeamMemberStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void RefreshWidgets();
	void PlayLobbyAnimation();
	void IsInLobby(bool* Param_IsInLobby);
	void CompletedQuestPrerequisites(bool* bCompleted);
	void OnPartyDataChanged(struct FFortTeamMemberInfo& MemberInfo);
	void InitializeInputActionRefs();
	void HandleHoverInputActions(bool bIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TeamMemberPedestal_C">();
	}
	static class ATeamMemberPedestal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATeamMemberPedestal_C>();
	}
};
static_assert(alignof(ATeamMemberPedestal_C) == 0x000008, "Wrong alignment on ATeamMemberPedestal_C");
static_assert(sizeof(ATeamMemberPedestal_C) == 0x000538, "Wrong size on ATeamMemberPedestal_C");
static_assert(offsetof(ATeamMemberPedestal_C, UberGraphFrame) == 0x000400, "Member 'ATeamMemberPedestal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, CharacterPlacement) == 0x000408, "Member 'ATeamMemberPedestal_C::CharacterPlacement' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, P_FE_Smoke) == 0x000410, "Member 'ATeamMemberPedestal_C::P_FE_Smoke' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, LightsParent) == 0x000418, "Member 'ATeamMemberPedestal_C::LightsParent' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, PSMinusNoPlayerMinusSparkle) == 0x000420, "Member 'ATeamMemberPedestal_C::PSMinusNoPlayerMinusSparkle' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, PSMinusNoPlayerMinusSwirl02) == 0x000428, "Member 'ATeamMemberPedestal_C::PSMinusNoPlayerMinusSwirl02' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, PSMinusNoPlayerMinusSwirl01) == 0x000430, "Member 'ATeamMemberPedestal_C::PSMinusNoPlayerMinusSwirl01' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, SM_Lobby_Character_Pad_Light_Ring) == 0x000438, "Member 'ATeamMemberPedestal_C::SM_Lobby_Character_Pad_Light_Ring' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, SM_Lobby_Character_Pad) == 0x000440, "Member 'ATeamMemberPedestal_C::SM_Lobby_Character_Pad' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, SM_Lobby_Character_TopSpot) == 0x000448, "Member 'ATeamMemberPedestal_C::SM_Lobby_Character_TopSpot' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBluePoint02) == 0x000450, "Member 'ATeamMemberPedestal_C::UnderlightBluePoint02' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBluePoint01) == 0x000458, "Member 'ATeamMemberPedestal_C::UnderlightBluePoint01' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBlue02) == 0x000460, "Member 'ATeamMemberPedestal_C::UnderlightBlue02' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBlue01) == 0x000468, "Member 'ATeamMemberPedestal_C::UnderlightBlue01' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, RimSpotLight) == 0x000470, "Member 'ATeamMemberPedestal_C::RimSpotLight' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, TopSpotLight) == 0x000478, "Member 'ATeamMemberPedestal_C::TopSpotLight' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, PreviewMesh) == 0x000480, "Member 'ATeamMemberPedestal_C::PreviewMesh' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, Mesh) == 0x000488, "Member 'ATeamMemberPedestal_C::Mesh' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, bIsPlayerSelected) == 0x000490, "Member 'ATeamMemberPedestal_C::bIsPlayerSelected' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, MID_Pad) == 0x000498, "Member 'ATeamMemberPedestal_C::MID_Pad' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, Debug_OnFriendLFGRequest) == 0x0004A0, "Member 'ATeamMemberPedestal_C::Debug_OnFriendLFGRequest' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, Hovered_InputAction) == 0x0004B0, "Member 'ATeamMemberPedestal_C::Hovered_InputAction' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, Gadgets) == 0x0004B8, "Member 'ATeamMemberPedestal_C::Gadgets' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, PlayerAdd) == 0x0004C0, "Member 'ATeamMemberPedestal_C::PlayerAdd' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, LastAnimatedPlayerPawn) == 0x0004C8, "Member 'ATeamMemberPedestal_C::LastAnimatedPlayerPawn' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, bAllowPartySuggestions) == 0x0004D0, "Member 'ATeamMemberPedestal_C::bAllowPartySuggestions' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, OffsetLobbyAddPlayer) == 0x0004D4, "Member 'ATeamMemberPedestal_C::OffsetLobbyAddPlayer' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, bPlayerPodiumHovered) == 0x0004D8, "Member 'ATeamMemberPedestal_C::bPlayerPodiumHovered' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, MID_Pad_Light_Ring) == 0x0004E0, "Member 'ATeamMemberPedestal_C::MID_Pad_Light_Ring' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, MID_Top_Light_Ring) == 0x0004E8, "Member 'ATeamMemberPedestal_C::MID_Top_Light_Ring' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, FxActive) == 0x0004F0, "Member 'ATeamMemberPedestal_C::FxActive' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, MID_Holo) == 0x0004F8, "Member 'ATeamMemberPedestal_C::MID_Holo' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, HoloMaterial) == 0x000500, "Member 'ATeamMemberPedestal_C::HoloMaterial' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, Hovered_WithPlayer_InputAction) == 0x000508, "Member 'ATeamMemberPedestal_C::Hovered_WithPlayer_InputAction' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, NewLobbyLayout) == 0x000510, "Member 'ATeamMemberPedestal_C::NewLobbyLayout' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, LightBrightnessScale) == 0x000514, "Member 'ATeamMemberPedestal_C::LightBrightnessScale' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, TopSpotLight_Brightness) == 0x000518, "Member 'ATeamMemberPedestal_C::TopSpotLight_Brightness' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, TopSpotLight_Brightness_Hovered) == 0x00051C, "Member 'ATeamMemberPedestal_C::TopSpotLight_Brightness_Hovered' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, RimSpotLight_Brightness) == 0x000520, "Member 'ATeamMemberPedestal_C::RimSpotLight_Brightness' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBlueSpot_Brightness) == 0x000524, "Member 'ATeamMemberPedestal_C::UnderlightBlueSpot_Brightness' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBlueSpot_Brightness_Hovered) == 0x000528, "Member 'ATeamMemberPedestal_C::UnderlightBlueSpot_Brightness_Hovered' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBluePoint_Brightness) == 0x00052C, "Member 'ATeamMemberPedestal_C::UnderlightBluePoint_Brightness' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, UnderlightBluePoint_Brightness_Hovered) == 0x000530, "Member 'ATeamMemberPedestal_C::UnderlightBluePoint_Brightness_Hovered' has a wrong offset!");
static_assert(offsetof(ATeamMemberPedestal_C, DebugHoveredLighting) == 0x000534, "Member 'ATeamMemberPedestal_C::DebugHoveredLighting' has a wrong offset!");

}

