#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBarDetailsWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.ExecuteUbergraph_TopBarDetailsWidget
// 0x00C0 (0x00C0 - 0x0000)
struct TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue1;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_BoostAmount;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 BoostAmount)>            K2Node_CreateDelegate_OutputDelegate3;             // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortPrivateAccountInfo& NewInfo)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FFortPrivateAccountInfo                CallFunc_GetLocalAccountInfo_Result;               // 0x0088(0x0038)(NoDestructor)
};
static_assert(alignof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget");
static_assert(sizeof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget) == 0x0000C0, "Wrong size on TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, EntryPoint) == 0x000000, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, K2Node_CreateDelegate_OutputDelegate1) == 0x000014, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, CallFunc_GetContext_ReturnValue1) == 0x000040, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, CallFunc_GetContext_ReturnValue2) == 0x000048, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, K2Node_CustomEvent_BoostAmount) == 0x000050, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::K2Node_CustomEvent_BoostAmount' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000054, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, CallFunc_GetContext_ReturnValue3) == 0x000068, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, CallFunc_GetContext_ReturnValue4) == 0x000070, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000078, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget, CallFunc_GetLocalAccountInfo_Result) == 0x000088, "Member 'TopBarDetailsWidget_C_ExecuteUbergraph_TopBarDetailsWidget::CallFunc_GetLocalAccountInfo_Result' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.Xp Boost Changed
// 0x0004 (0x0004 - 0x0000)
struct TopBarDetailsWidget_C_Xp_Boost_Changed final
{
public:
	int32                                         BoostAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_Xp_Boost_Changed) == 0x000004, "Wrong alignment on TopBarDetailsWidget_C_Xp_Boost_Changed");
static_assert(sizeof(TopBarDetailsWidget_C_Xp_Boost_Changed) == 0x000004, "Wrong size on TopBarDetailsWidget_C_Xp_Boost_Changed");
static_assert(offsetof(TopBarDetailsWidget_C_Xp_Boost_Changed, BoostAmount) == 0x000000, "Member 'TopBarDetailsWidget_C_Xp_Boost_Changed::BoostAmount' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.UpdateAccountInfo
// 0x0034 (0x0034 - 0x0000)
struct TopBarDetailsWidget_C_UpdateAccountInfo final
{
public:
	struct FFortPublicAccountInfo                 Info;                                              // 0x0000(0x0034)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(TopBarDetailsWidget_C_UpdateAccountInfo) == 0x000004, "Wrong alignment on TopBarDetailsWidget_C_UpdateAccountInfo");
static_assert(sizeof(TopBarDetailsWidget_C_UpdateAccountInfo) == 0x000034, "Wrong size on TopBarDetailsWidget_C_UpdateAccountInfo");
static_assert(offsetof(TopBarDetailsWidget_C_UpdateAccountInfo, Info) == 0x000000, "Member 'TopBarDetailsWidget_C_UpdateAccountInfo::Info' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.Update Boosts
// 0x000F (0x000F - 0x0000)
struct TopBarDetailsWidget_C_Update_Boosts final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Has_Mission_Reward_Boost_Result;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Has_VIP_Badge_Result;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Has_Founder_Badge_Result;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_Update_Boosts) == 0x000001, "Wrong alignment on TopBarDetailsWidget_C_Update_Boosts");
static_assert(sizeof(TopBarDetailsWidget_C_Update_Boosts) == 0x00000F, "Wrong size on TopBarDetailsWidget_C_Update_Boosts");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_bool_Variable) == 0x000000, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_byte_Variable) == 0x000001, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_byte_Variable1) == 0x000002, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_bool_Variable1) == 0x000003, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_byte_Variable2) == 0x000004, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_byte_Variable3) == 0x000005, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_bool_Variable2) == 0x000006, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_byte_Variable4) == 0x000007, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, Temp_byte_Variable5) == 0x000008, "Member 'TopBarDetailsWidget_C_Update_Boosts::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, CallFunc_Has_Mission_Reward_Boost_Result) == 0x000009, "Member 'TopBarDetailsWidget_C_Update_Boosts::CallFunc_Has_Mission_Reward_Boost_Result' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, CallFunc_Has_VIP_Badge_Result) == 0x00000A, "Member 'TopBarDetailsWidget_C_Update_Boosts::CallFunc_Has_VIP_Badge_Result' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, K2Node_Select_Default) == 0x00000B, "Member 'TopBarDetailsWidget_C_Update_Boosts::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, K2Node_Select1_Default) == 0x00000C, "Member 'TopBarDetailsWidget_C_Update_Boosts::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, CallFunc_Has_Founder_Badge_Result) == 0x00000D, "Member 'TopBarDetailsWidget_C_Update_Boosts::CallFunc_Has_Founder_Badge_Result' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Update_Boosts, K2Node_Select2_Default) == 0x00000E, "Member 'TopBarDetailsWidget_C_Update_Boosts::K2Node_Select2_Default' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.GetBonusExperienceTooltipWidget
// 0x0070 (0x0070 - 0x0000)
struct TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TooltipHeader;                                     // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   TooltipDescription;                                // 0x0020(0x0018)(Edit, BlueprintVisible)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UXpBonusToolTip_C*                      CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue1;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Custom_Tooltip_Output;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget");
static_assert(sizeof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget) == 0x000070, "Wrong size on TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, ReturnValue) == 0x000000, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, TooltipHeader) == 0x000008, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::TooltipHeader' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, TooltipDescription) == 0x000020, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::TooltipDescription' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_GetCurrentInputType_ReturnValue) == 0x000048, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_Create_ReturnValue) == 0x000050, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue1) == 0x000060, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget, CallFunc_Create_Custom_Tooltip_Output) == 0x000068, "Member 'TopBarDetailsWidget_C_GetBonusExperienceTooltipWidget::CallFunc_Create_Custom_Tooltip_Output' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.GetSkillPointsTooltipWidget
// 0x0060 (0x0060 - 0x0000)
struct TopBarDetailsWidget_C_GetSkillPointsTooltipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0018)()
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0040(0x0018)()
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_GetSkillPointsTooltipWidget");
static_assert(sizeof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget) == 0x000060, "Wrong size on TopBarDetailsWidget_C_GetSkillPointsTooltipWidget");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, ReturnValue) == 0x000000, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_GetCurrentInputType_ReturnValue) == 0x000028, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_MakeLiteralText_ReturnValue1) == 0x000040, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_MakeLiteralText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetSkillPointsTooltipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000058, "Member 'TopBarDetailsWidget_C_GetSkillPointsTooltipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.GetBonusExperienceDescription
// 0x0370 (0x0370 - 0x0000)
struct TopBarDetailsWidget_C_GetBonusExperienceDescription final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0038(0x0018)()
	int32                                         CallFunc_RestExperencePercentOfLevel_ReturnValue;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BoostExperiencePercentOfLevel_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0098(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_RestExperencePercentOfLevel_ReturnValue1; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00F0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0130(0x0018)()
	int32                                         CallFunc_BoostExperiencePercentOfLevel_ReturnValue1; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0150(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_BoostExperiencePercentOfLevel_ReturnValue2; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x01A8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x01E8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x0200(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x0210(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x0228(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array4;                           // 0x0268(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_RestExperencePercentOfLevel_ReturnValue2; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue4;                      // 0x0280(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x0298(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array5;                           // 0x02D8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData7;             // 0x02E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue5;                      // 0x0328(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array6;                           // 0x0340(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue6;                      // 0x0350(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue5;         // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue6;         // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBarDetailsWidget_C_GetBonusExperienceDescription) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_GetBonusExperienceDescription");
static_assert(sizeof(TopBarDetailsWidget_C_GetBonusExperienceDescription) == 0x000370, "Wrong size on TopBarDetailsWidget_C_GetBonusExperienceDescription");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, Result) == 0x000000, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::Result' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue1) == 0x000019, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array) == 0x000020, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000030, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue) == 0x000038, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_RestExperencePercentOfLevel_ReturnValue) == 0x000050, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_RestExperencePercentOfLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_BoostExperiencePercentOfLevel_ReturnValue) == 0x000054, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_BoostExperiencePercentOfLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData1) == 0x000098, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_RestExperencePercentOfLevel_ReturnValue1) == 0x0000D8, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_RestExperencePercentOfLevel_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array1) == 0x0000E0, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData2) == 0x0000F0, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue1) == 0x000130, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_BoostExperiencePercentOfLevel_ReturnValue1) == 0x000148, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_BoostExperiencePercentOfLevel_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData3) == 0x000150, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_BoostExperiencePercentOfLevel_ReturnValue2) == 0x000190, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_BoostExperiencePercentOfLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array2) == 0x000198, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData4) == 0x0001A8, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue2) == 0x0001E8, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array3) == 0x000200, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue3) == 0x000210, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData5) == 0x000228, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData5' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array4) == 0x000268, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_RestExperencePercentOfLevel_ReturnValue2) == 0x000278, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_RestExperencePercentOfLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue4) == 0x000280, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData6) == 0x000298, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData6' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array5) == 0x0002D8, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeStruct_FormatArgumentData7) == 0x0002E8, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeStruct_FormatArgumentData7' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue5) == 0x000328, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, K2Node_MakeArray_Array6) == 0x000340, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::K2Node_MakeArray_Array6' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_Format_ReturnValue6) == 0x000350, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_Format_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000368, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x000369, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue5) == 0x00036A, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_GetBonusExperienceDescription, CallFunc_EqualEqual_NameName_ReturnValue6) == 0x00036B, "Member 'TopBarDetailsWidget_C_GetBonusExperienceDescription::CallFunc_EqualEqual_NameName_ReturnValue6' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.RestExperencePercentOfLevel
// 0x0030 (0x0030 - 0x0000)
struct TopBarDetailsWidget_C_RestExperencePercentOfLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetXpPerAccountLevel_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRestXpBalance_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_RestExperencePercentOfLevel) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_RestExperencePercentOfLevel");
static_assert(sizeof(TopBarDetailsWidget_C_RestExperencePercentOfLevel) == 0x000030, "Wrong size on TopBarDetailsWidget_C_RestExperencePercentOfLevel");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, ReturnValue) == 0x000000, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_GetXpPerAccountLevel_ReturnValue) == 0x000004, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_GetXpPerAccountLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x00000C, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000018, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_GetRestXpBalance_ReturnValue) == 0x00001C, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_GetRestXpBalance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000020, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_RestExperencePercentOfLevel, CallFunc_FTrunc_ReturnValue) == 0x00002C, "Member 'TopBarDetailsWidget_C_RestExperencePercentOfLevel::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.BoostExperiencePercentOfLevel
// 0x0030 (0x0030 - 0x0000)
struct TopBarDetailsWidget_C_BoostExperiencePercentOfLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetXpPerAccountLevel_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetXpBoostBalance_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_BoostExperiencePercentOfLevel");
static_assert(sizeof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel) == 0x000030, "Wrong size on TopBarDetailsWidget_C_BoostExperiencePercentOfLevel");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, ReturnValue) == 0x000000, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_GetXpPerAccountLevel_ReturnValue) == 0x000004, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_GetXpPerAccountLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x00000C, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000018, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_GetXpBoostBalance_ReturnValue) == 0x00001C, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_GetXpBoostBalance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000020, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_BoostExperiencePercentOfLevel, CallFunc_FTrunc_ReturnValue) == 0x00002C, "Member 'TopBarDetailsWidget_C_BoostExperiencePercentOfLevel::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.Bind Party Delegates
// 0x0040 (0x0040 - 0x0000)
struct TopBarDetailsWidget_C_Bind_Party_Delegates final
{
public:
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate1;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_Bind_Party_Delegates) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_Bind_Party_Delegates");
static_assert(sizeof(TopBarDetailsWidget_C_Bind_Party_Delegates) == 0x000040, "Wrong size on TopBarDetailsWidget_C_Bind_Party_Delegates");
static_assert(offsetof(TopBarDetailsWidget_C_Bind_Party_Delegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBarDetailsWidget_C_Bind_Party_Delegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Bind_Party_Delegates, K2Node_CreateDelegate_OutputDelegate1) == 0x000010, "Member 'TopBarDetailsWidget_C_Bind_Party_Delegates::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Bind_Party_Delegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'TopBarDetailsWidget_C_Bind_Party_Delegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Bind_Party_Delegates, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'TopBarDetailsWidget_C_Bind_Party_Delegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Bind_Party_Delegates, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000038, "Member 'TopBarDetailsWidget_C_Bind_Party_Delegates::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.Unbind Party Delegates
// 0x0040 (0x0040 - 0x0000)
struct TopBarDetailsWidget_C_Unbind_Party_Delegates final
{
public:
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate1;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& TeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_Unbind_Party_Delegates) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_Unbind_Party_Delegates");
static_assert(sizeof(TopBarDetailsWidget_C_Unbind_Party_Delegates) == 0x000040, "Wrong size on TopBarDetailsWidget_C_Unbind_Party_Delegates");
static_assert(offsetof(TopBarDetailsWidget_C_Unbind_Party_Delegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBarDetailsWidget_C_Unbind_Party_Delegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Unbind_Party_Delegates, K2Node_CreateDelegate_OutputDelegate1) == 0x000010, "Member 'TopBarDetailsWidget_C_Unbind_Party_Delegates::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Unbind_Party_Delegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'TopBarDetailsWidget_C_Unbind_Party_Delegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Unbind_Party_Delegates, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'TopBarDetailsWidget_C_Unbind_Party_Delegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Unbind_Party_Delegates, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000038, "Member 'TopBarDetailsWidget_C_Unbind_Party_Delegates::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.HandleOnTeamMemberStateChanged
// 0x0200 (0x0200 - 0x0000)
struct TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged final
{
public:
	struct FFortTeamMemberInfo                    NewMemberState;                                    // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged");
static_assert(sizeof(TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged) == 0x000200, "Wrong size on TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged");
static_assert(offsetof(TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged, NewMemberState) == 0x000000, "Member 'TopBarDetailsWidget_C_HandleOnTeamMemberStateChanged::NewMemberState' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.HandleRemotePlayerRemoved
// 0x0004 (0x0004 - 0x0000)
struct TopBarDetailsWidget_C_HandleRemotePlayerRemoved final
{
public:
	int32                                         RemovedIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBarDetailsWidget_C_HandleRemotePlayerRemoved) == 0x000004, "Wrong alignment on TopBarDetailsWidget_C_HandleRemotePlayerRemoved");
static_assert(sizeof(TopBarDetailsWidget_C_HandleRemotePlayerRemoved) == 0x000004, "Wrong size on TopBarDetailsWidget_C_HandleRemotePlayerRemoved");
static_assert(offsetof(TopBarDetailsWidget_C_HandleRemotePlayerRemoved, RemovedIndex) == 0x000000, "Member 'TopBarDetailsWidget_C_HandleRemotePlayerRemoved::RemovedIndex' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.Has Founder Badge
// 0x0030 (0x0030 - 0x0000)
struct TopBarDetailsWidget_C_Has_Founder_Badge final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       CallFunc_GetAccountItemWithDefinition_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountBuffItem*                   K2Node_DynamicCast_AsFort_Account_Buff_Item;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBarDetailsWidget_C_Has_Founder_Badge) == 0x000008, "Wrong alignment on TopBarDetailsWidget_C_Has_Founder_Badge");
static_assert(sizeof(TopBarDetailsWidget_C_Has_Founder_Badge) == 0x000030, "Wrong size on TopBarDetailsWidget_C_Has_Founder_Badge");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, Result) == 0x000000, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::Result' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, CallFunc_GetAccountItemWithDefinition_ReturnValue) == 0x000010, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::CallFunc_GetAccountItemWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, K2Node_DynamicCast_AsFort_Account_Buff_Item) == 0x000020, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::K2Node_DynamicCast_AsFort_Account_Buff_Item' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TopBarDetailsWidget_C_Has_Founder_Badge, CallFunc_IsActive_ReturnValue) == 0x000029, "Member 'TopBarDetailsWidget_C_Has_Founder_Badge::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function TopBarDetailsWidget.TopBarDetailsWidget_C.Has VIP Badge
// 0x0030 (0x0030 - 0x0000)
