#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopMenu_HelpButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.OnUpdateVisibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature final
{
public:
	bool                                          Param_Visibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature) == 0x000001, "Wrong alignment on TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature");
static_assert(sizeof(TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature) == 0x000001, "Wrong size on TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature");
static_assert(offsetof(TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature, Param_Visibility) == 0x000000, "Member 'TopMenu_HelpButton_C_OnUpdateVisibility__DelegateSignature::Param_Visibility' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.OnButtonHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature) == 0x000008, "Wrong alignment on TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature");
static_assert(sizeof(TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature) == 0x000008, "Wrong size on TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature");
static_assert(offsetof(TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature, Button) == 0x000000, "Member 'TopMenu_HelpButton_C_OnButtonHovered__DelegateSignature::Button' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.ExecuteUbergraph_TopMenu_HelpButton
// 0x0150 (0x0150 - 0x0000)
struct TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHelpItem*                          K2Node_DynamicCast_AsFort_Help_Item;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button1;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0070(0x0070)(ConstParm)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00E8(0x0018)(ConstParm)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHelpPanel_C*                           CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetButtonVisibility_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton) == 0x000008, "Wrong alignment on TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton");
static_assert(sizeof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton) == 0x000150, "Wrong size on TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, EntryPoint) == 0x000000, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, Temp_object_Variable) == 0x000008, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_DynamicCast_AsFort_Help_Item) == 0x000020, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_DynamicCast_AsFort_Help_Item' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_ComponentBoundEvent_Button1) == 0x000030, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_ComponentBoundEvent_Button1' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_Event_MyGeometry) == 0x000038, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_Event_MouseEvent) == 0x000070, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_CustomEvent_Loaded) == 0x0000E0, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, Temp_text_Variable) == 0x0000E8, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000100, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_GetContext_ReturnValue) == 0x000108, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_DynamicCast_AsUIManager) == 0x000110, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_GetContext_ReturnValue1) == 0x000120, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, K2Node_ComponentBoundEvent_Button) == 0x000128, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000130, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_Create_ReturnValue) == 0x000138, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_GetButtonVisibility_ReturnValue) == 0x000140, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_GetButtonVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton, CallFunc_GetContext_ReturnValue2) == 0x000148, "Member 'TopMenu_HelpButton_C_ExecuteUbergraph_TopMenu_HelpButton::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopMenu_HelpButton_C_BndEvt__HelpButtonInner_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct TopMenu_HelpButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TopMenu_HelpButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on TopMenu_HelpButton_C_OnMouseEnter");
static_assert(sizeof(TopMenu_HelpButton_C_OnMouseEnter) == 0x0000A8, "Wrong size on TopMenu_HelpButton_C_OnMouseEnter");
static_assert(offsetof(TopMenu_HelpButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'TopMenu_HelpButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'TopMenu_HelpButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopMenu_HelpButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.OnLoaded_A64379784E473AB391B349B478F10865
// 0x0008 (0x0008 - 0x0000)
struct TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865) == 0x000008, "Wrong alignment on TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865");
static_assert(sizeof(TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865) == 0x000008, "Wrong size on TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865");
static_assert(offsetof(TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865, Loaded) == 0x000000, "Member 'TopMenu_HelpButton_C_OnLoaded_A64379784E473AB391B349B478F10865::Loaded' has a wrong offset!");

// Function TopMenu_HelpButton.TopMenu_HelpButton_C.GetButtonVisibility
// 0x0007 (0x0007 - 0x0000)
struct TopMenu_HelpButton_C_GetButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopMenu_HelpButton_C_GetButtonVisibility) == 0x000001, "Wrong alignment on TopMenu_HelpButton_C_GetButtonVisibility");
static_assert(sizeof(TopMenu_HelpButton_C_GetButtonVisibility) == 0x000007, "Wrong size on TopMenu_HelpButton_C_GetButtonVisibility");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, ReturnValue) == 0x000000, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, Temp_byte_Variable1) == 0x000003, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, CallFunc_GetSubGame_ReturnValue) == 0x000004, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopMenu_HelpButton_C_GetButtonVisibility, K2Node_Select_Default) == 0x000006, "Member 'TopMenu_HelpButton_C_GetButtonVisibility::K2Node_Select_Default' has a wrong offset!");

}

