#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopWeaponStatRowEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TopWeaponStatRowEntry.TopWeaponStatRowEntry_C
// 0x0018 (0x0260 - 0x0248)
class UTopWeaponStatRowEntry_C final : public UAthenaProfileStatWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                StatValue;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WeaponCard;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TopWeaponStatRowEntry(int32 EntryPoint);
	void OnStatChanged();
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TopWeaponStatRowEntry_C">();
	}
	static class UTopWeaponStatRowEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopWeaponStatRowEntry_C>();
	}
};
static_assert(alignof(UTopWeaponStatRowEntry_C) == 0x000008, "Wrong alignment on UTopWeaponStatRowEntry_C");
static_assert(sizeof(UTopWeaponStatRowEntry_C) == 0x000260, "Wrong size on UTopWeaponStatRowEntry_C");
static_assert(offsetof(UTopWeaponStatRowEntry_C, UberGraphFrame) == 0x000248, "Member 'UTopWeaponStatRowEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTopWeaponStatRowEntry_C, StatValue) == 0x000250, "Member 'UTopWeaponStatRowEntry_C::StatValue' has a wrong offset!");
static_assert(offsetof(UTopWeaponStatRowEntry_C, WeaponCard) == 0x000258, "Member 'UTopWeaponStatRowEntry_C::WeaponCard' has a wrong offset!");

}

