#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToyOptionsModal

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ToyOptionsModal.ToyOptionsModal_C.ExecuteUbergraph_ToyOptionsModal
// 0x00A0 (0x00A0 - 0x0000)
struct ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortActorOptionsComponent*             K2Node_Event_OptionsComponent;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOptionsText_DisplayName;               // 0x0040(0x0018)()
	class FText                                   CallFunc_GetOptionsText_Descriptions;              // 0x0058(0x0018)()
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue1;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal) == 0x000008, "Wrong alignment on ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal");
static_assert(sizeof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal) == 0x0000A0, "Wrong size on ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, EntryPoint) == 0x000000, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, K2Node_Event_bUsingGamepad) == 0x000004, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_PlayAnimation_ReturnValue1) == 0x000018, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, K2Node_Event_OptionsComponent) == 0x000028, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::K2Node_Event_OptionsComponent' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetOptionsText_DisplayName) == 0x000040, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetOptionsText_DisplayName' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetOptionsText_Descriptions) == 0x000058, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetOptionsText_Descriptions' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetContext_ReturnValue1) == 0x000070, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetContext_ReturnValue2) == 0x000078, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetContext_ReturnValue3) == 0x000080, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, CallFunc_GetContext_ReturnValue4) == 0x000088, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'ToyOptionsModal_C_ExecuteUbergraph_ToyOptionsModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ToyOptionsModal.ToyOptionsModal_C.InitForOptionsComponent
// 0x0008 (0x0008 - 0x0000)
struct ToyOptionsModal_C_InitForOptionsComponent final
{
public:
	class UFortActorOptionsComponent*             OptionsComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToyOptionsModal_C_InitForOptionsComponent) == 0x000008, "Wrong alignment on ToyOptionsModal_C_InitForOptionsComponent");
static_assert(sizeof(ToyOptionsModal_C_InitForOptionsComponent) == 0x000008, "Wrong size on ToyOptionsModal_C_InitForOptionsComponent");
static_assert(offsetof(ToyOptionsModal_C_InitForOptionsComponent, OptionsComponent) == 0x000000, "Member 'ToyOptionsModal_C_InitForOptionsComponent::OptionsComponent' has a wrong offset!");

// Function ToyOptionsModal.ToyOptionsModal_C.BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ToyOptionsModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ToyOptionsModal.ToyOptionsModal_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ToyOptionsModal_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ToyOptionsModal_C_OnInputModeChanged) == 0x000001, "Wrong alignment on ToyOptionsModal_C_OnInputModeChanged");
static_assert(sizeof(ToyOptionsModal_C_OnInputModeChanged) == 0x000001, "Wrong size on ToyOptionsModal_C_OnInputModeChanged");
static_assert(offsetof(ToyOptionsModal_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'ToyOptionsModal_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function ToyOptionsModal.ToyOptionsModal_C.SetItemInfo
// 0x0048 (0x0048 - 0x0000)
struct ToyOptionsModal_C_SetItemInfo final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ItemDescription;                                   // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue1;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue3;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToyOptionsModal_C_SetItemInfo) == 0x000008, "Wrong alignment on ToyOptionsModal_C_SetItemInfo");
static_assert(sizeof(ToyOptionsModal_C_SetItemInfo) == 0x000048, "Wrong size on ToyOptionsModal_C_SetItemInfo");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, ItemName) == 0x000000, "Member 'ToyOptionsModal_C_SetItemInfo::ItemName' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, ItemDescription) == 0x000018, "Member 'ToyOptionsModal_C_SetItemInfo::ItemDescription' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_byte_Variable) == 0x000030, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_byte_Variable1) == 0x000031, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_bool_Variable) == 0x000032, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_byte_Variable2) == 0x000033, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_byte_Variable3) == 0x000034, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_bool_Variable1) == 0x000035, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_byte_Variable4) == 0x000036, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_byte_Variable5) == 0x000037, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, CallFunc_TextIsEmpty_ReturnValue) == 0x000038, "Member 'ToyOptionsModal_C_SetItemInfo::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, CallFunc_TextIsEmpty_ReturnValue1) == 0x000039, "Member 'ToyOptionsModal_C_SetItemInfo::CallFunc_TextIsEmpty_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, Temp_bool_Variable2) == 0x00003A, "Member 'ToyOptionsModal_C_SetItemInfo::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'ToyOptionsModal_C_SetItemInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, CallFunc_TextIsEmpty_ReturnValue2) == 0x00003C, "Member 'ToyOptionsModal_C_SetItemInfo::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, K2Node_Select_Default) == 0x00003D, "Member 'ToyOptionsModal_C_SetItemInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, K2Node_Select1_Default) == 0x00003E, "Member 'ToyOptionsModal_C_SetItemInfo::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, CallFunc_TextIsEmpty_ReturnValue3) == 0x00003F, "Member 'ToyOptionsModal_C_SetItemInfo::CallFunc_TextIsEmpty_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ToyOptionsModal_C_SetItemInfo, K2Node_Select2_Default) == 0x000040, "Member 'ToyOptionsModal_C_SetItemInfo::K2Node_Select2_Default' has a wrong offset!");

}

