#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToyOptionsComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ToyOptionsComponent.ToyOptionsComponent_C.OnLocalInteract
// 0x00A0 (0x00A0 - 0x0000)
struct ToyOptionsComponent_C_OnLocalInteract final
{
public:
	class AFortPlayerPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResult;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingKnobsModal*             ModalWidget;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingKnobsModal*             OutModalWidget;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractSuccess;                                  // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  InteractingPlayer;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0040(0x0010)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinigameSettingsMachine_C*             K2Node_DynamicCast_AsMinigame_Settings_Machine;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeMyIslandModal_C*               K2Node_DynamicCast_AsCreative_My_Island_Modal;     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingKnobsModal*             CallFunc_Create_ReturnValue1;                      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToyOptionsComponent_C_OnLocalInteract) == 0x000008, "Wrong alignment on ToyOptionsComponent_C_OnLocalInteract");
static_assert(sizeof(ToyOptionsComponent_C_OnLocalInteract) == 0x0000A0, "Wrong size on ToyOptionsComponent_C_OnLocalInteract");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, InteractingPawn) == 0x000000, "Member 'ToyOptionsComponent_C_OnLocalInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, bResult) == 0x000008, "Member 'ToyOptionsComponent_C_OnLocalInteract::bResult' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, ModalWidget) == 0x000010, "Member 'ToyOptionsComponent_C_OnLocalInteract::ModalWidget' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, OutModalWidget) == 0x000018, "Member 'ToyOptionsComponent_C_OnLocalInteract::OutModalWidget' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, bInteractSuccess) == 0x000020, "Member 'ToyOptionsComponent_C_OnLocalInteract::bInteractSuccess' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, InteractingPlayer) == 0x000028, "Member 'ToyOptionsComponent_C_OnLocalInteract::InteractingPlayer' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000030, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, K2Node_MakeStruct_DataTableRowHandle) == 0x000040, "Member 'ToyOptionsComponent_C_OnLocalInteract::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, K2Node_DynamicCast_AsMinigame_Settings_Machine) == 0x000058, "Member 'ToyOptionsComponent_C_OnLocalInteract::K2Node_DynamicCast_AsMinigame_Settings_Machine' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ToyOptionsComponent_C_OnLocalInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_Create_ReturnValue) == 0x000068, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, K2Node_DynamicCast_AsCreative_My_Island_Modal) == 0x000070, "Member 'ToyOptionsComponent_C_OnLocalInteract::K2Node_DynamicCast_AsCreative_My_Island_Modal' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'ToyOptionsComponent_C_OnLocalInteract::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000080, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_Create_ReturnValue1) == 0x000088, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_Create_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_IsValid_ReturnValue1) == 0x000090, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ToyOptionsComponent_C_OnLocalInteract, CallFunc_GetContext_ReturnValue) == 0x000098, "Member 'ToyOptionsComponent_C_OnLocalInteract::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

