#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToyOptionsComponent

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ToyOptionsComponent.ToyOptionsComponent_C
// 0x0018 (0x0270 - 0x0258)
class UToyOptionsComponent_C final : public UFortActorOptionsComponent
{
public:
	class UClass*                                 OptionsWidgetClass;                                // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MyIslandTabList;                                   // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMachine;                                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnLocalInteract(class AFortPlayerPawn* InteractingPawn, bool* bResult, class UFortMatchmakingKnobsModal** ModalWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToyOptionsComponent_C">();
	}
	static class UToyOptionsComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToyOptionsComponent_C>();
	}
};
static_assert(alignof(UToyOptionsComponent_C) == 0x000008, "Wrong alignment on UToyOptionsComponent_C");
static_assert(sizeof(UToyOptionsComponent_C) == 0x000270, "Wrong size on UToyOptionsComponent_C");
static_assert(offsetof(UToyOptionsComponent_C, OptionsWidgetClass) == 0x000258, "Member 'UToyOptionsComponent_C::OptionsWidgetClass' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, MyIslandTabList) == 0x000260, "Member 'UToyOptionsComponent_C::MyIslandTabList' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, IsMachine) == 0x000268, "Member 'UToyOptionsComponent_C::IsMachine' has a wrong offset!");

}

