#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpgradeMonitor

#include "Basic.hpp"


namespace SDK::Params
{

// Function UpgradeMonitor.UpgradeMonitor_C.ExecuteUbergraph_UpgradeMonitor
// 0x0004 (0x0004 - 0x0000)
struct UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor) == 0x000004, "Wrong alignment on UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor");
static_assert(sizeof(UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor) == 0x000004, "Wrong size on UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor");
static_assert(offsetof(UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor, EntryPoint) == 0x000000, "Member 'UpgradeMonitor_C_ExecuteUbergraph_UpgradeMonitor::EntryPoint' has a wrong offset!");

// Function UpgradeMonitor.UpgradeMonitor_C.SetUtilities-Icon
// 0x0008 (0x0008 - 0x0000)
struct UpgradeMonitor_C_SetUtilitiesMinusIcon final
{
public:
	class UTexture2D*                             ActiveMinusIcon;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UpgradeMonitor_C_SetUtilitiesMinusIcon) == 0x000008, "Wrong alignment on UpgradeMonitor_C_SetUtilitiesMinusIcon");
static_assert(sizeof(UpgradeMonitor_C_SetUtilitiesMinusIcon) == 0x000008, "Wrong size on UpgradeMonitor_C_SetUtilitiesMinusIcon");
static_assert(offsetof(UpgradeMonitor_C_SetUtilitiesMinusIcon, ActiveMinusIcon) == 0x000000, "Member 'UpgradeMonitor_C_SetUtilitiesMinusIcon::ActiveMinusIcon' has a wrong offset!");

// Function UpgradeMonitor.UpgradeMonitor_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct UpgradeMonitor_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UpgradeMonitor_C_UserConstructionScript) == 0x000008, "Wrong alignment on UpgradeMonitor_C_UserConstructionScript");
static_assert(sizeof(UpgradeMonitor_C_UserConstructionScript) == 0x000010, "Wrong size on UpgradeMonitor_C_UserConstructionScript");
static_assert(offsetof(UpgradeMonitor_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'UpgradeMonitor_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UpgradeMonitor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'UpgradeMonitor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

