#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UserActionMenu.UserActionMenu_C
// 0x00D0 (0x03B0 - 0x02E0)
class UUserActionMenu_C final : public UFortSocialInteractionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HoverBubble;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Online;                                            // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Away;                                              // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offline;                                           // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           bLocked;                                           // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            UserNameOnline;                                    // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UserNameAwayOfflineBlocked;                        // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UserActionMenu(int32 EntryPoint);
	void OnEnableBackButtonDisplay(bool bEnableBackButtonDisplay);
	void OnUserPresenceChanged(EOnlineStatus OnlineStatus);
	void OnToggleConfirmation(bool bIsVisible);
	void OnSocialContextSet();
	void HandleOnlineIndicatorView(EOnlineStatus OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UserActionMenu_C">();
	}
	static class UUserActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserActionMenu_C>();
	}
};
static_assert(alignof(UUserActionMenu_C) == 0x000008, "Wrong alignment on UUserActionMenu_C");
static_assert(sizeof(UUserActionMenu_C) == 0x0003B0, "Wrong size on UUserActionMenu_C");
static_assert(offsetof(UUserActionMenu_C, UberGraphFrame) == 0x0002E0, "Member 'UUserActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, ConfirmationOpened) == 0x0002E8, "Member 'UUserActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Opened) == 0x0002F0, "Member 'UUserActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Arrow) == 0x0002F8, "Member 'UUserActionMenu_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Border_OnlineStatusIndicator) == 0x000300, "Member 'UUserActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, EntryBorder) == 0x000308, "Member 'UUserActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, HoverBubble) == 0x000310, "Member 'UUserActionMenu_C::HoverBubble' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, UserActionMenuInputButton) == 0x000318, "Member 'UUserActionMenu_C::UserActionMenuInputButton' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Online) == 0x000320, "Member 'UUserActionMenu_C::Online' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Away) == 0x000330, "Member 'UUserActionMenu_C::Away' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, Offline) == 0x000340, "Member 'UUserActionMenu_C::Offline' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, bLocked) == 0x000350, "Member 'UUserActionMenu_C::bLocked' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, UserNameOnline) == 0x000360, "Member 'UUserActionMenu_C::UserNameOnline' has a wrong offset!");
static_assert(offsetof(UUserActionMenu_C, UserNameAwayOfflineBlocked) == 0x000388, "Member 'UUserActionMenu_C::UserNameAwayOfflineBlocked' has a wrong offset!");

}

