#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UserListEntry_XS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UserListEntry_XS.UserListEntry_XS_C.ExecuteUbergraph_UserListEntry_XS
// 0x0060 (0x0060 - 0x0000)
struct UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformOnlyFriend_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOnlineStatus                                 K2Node_Event_OnlineStatus;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue3;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableSocialPanelAddEpicFriendsBang_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS) == 0x000008, "Wrong alignment on UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS");
static_assert(sizeof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS) == 0x000060, "Wrong size on UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, EntryPoint) == 0x000000, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::EntryPoint' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, Temp_bool_Variable) == 0x000004, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, Temp_byte_Variable) == 0x000005, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, Temp_byte_Variable1) == 0x000006, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, K2Node_ComponentBoundEvent_bIsOpen) == 0x000007, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, K2Node_Select_Default) == 0x000008, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_PlayAnimation_ReturnValue1) == 0x000020, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_PlayAnimation_ReturnValue2) == 0x000028, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, K2Node_Event_ListItemObject) == 0x000038, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_IsPlatformOnlyFriend_ReturnValue) == 0x000040, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_IsPlatformOnlyFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, K2Node_Event_OnlineStatus) == 0x000041, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::K2Node_Event_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_PlayAnimation_ReturnValue3) == 0x000048, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_PlayAnimation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000050, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS, CallFunc_GetEnableSocialPanelAddEpicFriendsBang_ReturnValue) == 0x000058, "Member 'UserListEntry_XS_C_ExecuteUbergraph_UserListEntry_XS::CallFunc_GetEnableSocialPanelAddEpicFriendsBang_ReturnValue' has a wrong offset!");

// Function UserListEntry_XS.UserListEntry_XS_C.OnUserPresenceChanged
// 0x0001 (0x0001 - 0x0000)
struct UserListEntry_XS_C_OnUserPresenceChanged final
{
public:
	EOnlineStatus                                 OnlineStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserListEntry_XS_C_OnUserPresenceChanged) == 0x000001, "Wrong alignment on UserListEntry_XS_C_OnUserPresenceChanged");
static_assert(sizeof(UserListEntry_XS_C_OnUserPresenceChanged) == 0x000001, "Wrong size on UserListEntry_XS_C_OnUserPresenceChanged");
static_assert(offsetof(UserListEntry_XS_C_OnUserPresenceChanged, OnlineStatus) == 0x000000, "Member 'UserListEntry_XS_C_OnUserPresenceChanged::OnlineStatus' has a wrong offset!");

// Function UserListEntry_XS.UserListEntry_XS_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UserListEntry_XS_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserListEntry_XS_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UserListEntry_XS_C_OnListItemObjectSet");
static_assert(sizeof(UserListEntry_XS_C_OnListItemObjectSet) == 0x000008, "Wrong size on UserListEntry_XS_C_OnListItemObjectSet");
static_assert(offsetof(UserListEntry_XS_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UserListEntry_XS_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UserListEntry_XS.UserListEntry_XS_C.BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'UserListEntry_XS_C_BndEvt__MenuAnchor_Actions_K2Node_ComponentBoundEvent_0_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function UserListEntry_XS.UserListEntry_XS_C.HandleOnlineIndicatorView
// 0x00F8 (0x00F8 - 0x0000)
struct UserListEntry_XS_C_HandleOnlineIndicatorView final
{
public:
	EOnlineStatus                                 OnlineStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnlineStatus                                 Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnlineStatus                                 Temp_byte_Variable1;                               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnlineStatus                                 Temp_byte_Variable2;                               // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable1;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable3;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnlineStatus                                 Temp_byte_Variable3;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select1_Default;                            // 0x0080(0x0028)()
	struct FSlateColor                            K2Node_Select2_Default;                            // 0x00A8(0x0028)()
	EOnlineStatus                                 Temp_byte_Variable4;                               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select3_Default;                            // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select4_Default;                            // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UserListEntry_XS_C_HandleOnlineIndicatorView) == 0x000008, "Wrong alignment on UserListEntry_XS_C_HandleOnlineIndicatorView");
static_assert(sizeof(UserListEntry_XS_C_HandleOnlineIndicatorView) == 0x0000F8, "Wrong size on UserListEntry_XS_C_HandleOnlineIndicatorView");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, OnlineStatus) == 0x000000, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::OnlineStatus' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable) == 0x000004, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable1) == 0x000014, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable2) == 0x000024, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_byte_Variable) == 0x000034, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_byte_Variable1) == 0x000035, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_byte_Variable2) == 0x000036, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_object_Variable) == 0x000038, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_object_Variable1) == 0x000040, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_object_Variable2) == 0x000048, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_object_Variable3) == 0x000050, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_byte_Variable3) == 0x000058, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, K2Node_Select_Default) == 0x000060, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_struct_Variable3) == 0x000070, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, K2Node_Select1_Default) == 0x000080, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, K2Node_Select2_Default) == 0x0000A8, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, Temp_byte_Variable4) == 0x0000D0, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, K2Node_Select3_Default) == 0x0000D4, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(UserListEntry_XS_C_HandleOnlineIndicatorView, K2Node_Select4_Default) == 0x0000E4, "Member 'UserListEntry_XS_C_HandleOnlineIndicatorView::K2Node_Select4_Default' has a wrong offset!");

}

