#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSmithBoard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WeaponSmithBoardOrganizationEnum_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WeaponSmithBoard.WeaponSmithBoard_C.ExecuteUbergraph_WeaponSmithBoard
// 0x00D0 (0x00D0 - 0x0000)
struct WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             K2Node_CustomEvent_StaticMeshAsset;                // 0x0040(0x0028)(HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_CustomEvent_MeshComponent;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate1;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	EWeaponSmithBoardOrganizationEnum             K2Node_CustomEvent_Organization;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortSchematicItem*>             CallFunc_RandomizeRangedSchematics_RangedSchematicsForBoard; // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortAccountItem*>               CallFunc_RandomizeMeleeSchematics_MeleeSchematicsForBoard; // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard");
static_assert(sizeof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard) == 0x0000D0, "Wrong size on WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, EntryPoint) == 0x000000, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_GetContext_ReturnValue1) == 0x000028, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_GetQuestManager_ReturnValue) == 0x000030, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CustomEvent_StaticMeshAsset) == 0x000040, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CustomEvent_StaticMeshAsset' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CustomEvent_MeshComponent) == 0x000068, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CustomEvent_MeshComponent' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CreateDelegate_OutputDelegate1) == 0x000070, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CustomEvent_Organization) == 0x000080, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CustomEvent_Organization' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_SwitchEnum_CmpSuccess) == 0x000081, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, Temp_object_Variable) == 0x000088, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CustomEvent_NewCamera) == 0x000090, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CustomEvent_NewCamera' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CustomEvent_OldCamera) == 0x000091, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CustomEvent_OldCamera' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_DynamicCast_AsStatic_Mesh) == 0x000098, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A1, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_HasCompletedQuest_ReturnValue) == 0x0000A2, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, K2Node_CustomEvent_Loaded) == 0x0000A8, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_RandomizeRangedSchematics_RangedSchematicsForBoard) == 0x0000B0, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_RandomizeRangedSchematics_RangedSchematicsForBoard' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard, CallFunc_RandomizeMeleeSchematics_MeleeSchematicsForBoard) == 0x0000C0, "Member 'WeaponSmithBoard_C_ExecuteUbergraph_WeaponSmithBoard::CallFunc_RandomizeMeleeSchematics_MeleeSchematicsForBoard' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.CameraChanged
// 0x0002 (0x0002 - 0x0000)
struct WeaponSmithBoard_C_CameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSmithBoard_C_CameraChanged) == 0x000001, "Wrong alignment on WeaponSmithBoard_C_CameraChanged");
static_assert(sizeof(WeaponSmithBoard_C_CameraChanged) == 0x000002, "Wrong size on WeaponSmithBoard_C_CameraChanged");
static_assert(offsetof(WeaponSmithBoard_C_CameraChanged, NewCamera) == 0x000000, "Member 'WeaponSmithBoard_C_CameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_CameraChanged, OldCamera) == 0x000001, "Member 'WeaponSmithBoard_C_CameraChanged::OldCamera' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.PopulateWeaponBoard
// 0x0001 (0x0001 - 0x0000)
struct WeaponSmithBoard_C_PopulateWeaponBoard final
{
public:
	EWeaponSmithBoardOrganizationEnum             Organization;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSmithBoard_C_PopulateWeaponBoard) == 0x000001, "Wrong alignment on WeaponSmithBoard_C_PopulateWeaponBoard");
static_assert(sizeof(WeaponSmithBoard_C_PopulateWeaponBoard) == 0x000001, "Wrong size on WeaponSmithBoard_C_PopulateWeaponBoard");
static_assert(offsetof(WeaponSmithBoard_C_PopulateWeaponBoard, Organization) == 0x000000, "Member 'WeaponSmithBoard_C_PopulateWeaponBoard::Organization' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.LoadAsync
// 0x0030 (0x0030 - 0x0000)
struct WeaponSmithBoard_C_LoadAsync final
{
public:
	TSoftObjectPtr<class UStaticMesh>             StaticMeshAsset;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshComponent;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSmithBoard_C_LoadAsync) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_LoadAsync");
static_assert(sizeof(WeaponSmithBoard_C_LoadAsync) == 0x000030, "Wrong size on WeaponSmithBoard_C_LoadAsync");
static_assert(offsetof(WeaponSmithBoard_C_LoadAsync, StaticMeshAsset) == 0x000000, "Member 'WeaponSmithBoard_C_LoadAsync::StaticMeshAsset' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_LoadAsync, MeshComponent) == 0x000028, "Member 'WeaponSmithBoard_C_LoadAsync::MeshComponent' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.OnLoaded_2931F78441AF4AD6B643BEB635F904F1
// 0x0008 (0x0008 - 0x0000)
struct WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1");
static_assert(sizeof(WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1) == 0x000008, "Wrong size on WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1");
static_assert(offsetof(WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1, Loaded) == 0x000000, "Member 'WeaponSmithBoard_C_OnLoaded_2931F78441AF4AD6B643BEB635F904F1::Loaded' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct WeaponSmithBoard_C_UserConstructionScript final
{
public:
	int32                                         FavSchematicCount;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortSchematicItem*>             Param_FavSchematics;                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          NewLocalVar_0;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSmithBoard_C_UserConstructionScript) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_UserConstructionScript");
static_assert(sizeof(WeaponSmithBoard_C_UserConstructionScript) == 0x000020, "Wrong size on WeaponSmithBoard_C_UserConstructionScript");
static_assert(offsetof(WeaponSmithBoard_C_UserConstructionScript, FavSchematicCount) == 0x000000, "Member 'WeaponSmithBoard_C_UserConstructionScript::FavSchematicCount' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_UserConstructionScript, Param_FavSchematics) == 0x000008, "Member 'WeaponSmithBoard_C_UserConstructionScript::Param_FavSchematics' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_UserConstructionScript, NewLocalVar_0) == 0x000018, "Member 'WeaponSmithBoard_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.Populate Schematic Favs
// 0x0060 (0x0060 - 0x0000)
struct WeaponSmithBoard_C_Populate_Schematic_Favs final
{
public:
	int32                                         FavSchematicCount;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items;              // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFavorite_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSmithBoard_C_Populate_Schematic_Favs) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_Populate_Schematic_Favs");
static_assert(sizeof(WeaponSmithBoard_C_Populate_Schematic_Favs) == 0x000060, "Wrong size on WeaponSmithBoard_C_Populate_Schematic_Favs");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, FavSchematicCount) == 0x000000, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::FavSchematicCount' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_GetAccountItemsByType_Items) == 0x000020, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_GetAccountItemsByType_Items' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Add_IntInt_ReturnValue1) == 0x000030, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Array_Get_Item) == 0x000038, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, K2Node_DynamicCast_AsFort_Schematic_Item) == 0x000040, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::K2Node_DynamicCast_AsFort_Schematic_Item' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_IsFavorite_ReturnValue) == 0x000055, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_IsFavorite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_BooleanAND_ReturnValue) == 0x000056, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, Temp_int_Variable) == 0x000058, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Schematic_Favs, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'WeaponSmithBoard_C_Populate_Schematic_Favs::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.Generate StaticMesh Array
// 0x0010 (0x0010 - 0x0000)
struct WeaponSmithBoard_C_Generate_StaticMesh_Array final
{
public:
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WeaponSmithBoard_C_Generate_StaticMesh_Array) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_Generate_StaticMesh_Array");
static_assert(sizeof(WeaponSmithBoard_C_Generate_StaticMesh_Array) == 0x000010, "Wrong size on WeaponSmithBoard_C_Generate_StaticMesh_Array");
static_assert(offsetof(WeaponSmithBoard_C_Generate_StaticMesh_Array, K2Node_MakeArray_Array) == 0x000000, "Member 'WeaponSmithBoard_C_Generate_StaticMesh_Array::K2Node_MakeArray_Array' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.Populate Ranged
// 0x0140 (0x0140 - 0x0000)
struct WeaponSmithBoard_C_Populate_Ranged final
{
public:
	int32                                         FavSchematicCount;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items;              // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue1;      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2; // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface3; // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue3;      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface4; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue4;      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item1;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item2;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item3;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item4;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable4;                                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSmithBoard_C_Populate_Ranged) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_Populate_Ranged");
static_assert(sizeof(WeaponSmithBoard_C_Populate_Ranged) == 0x000140, "Wrong size on WeaponSmithBoard_C_Populate_Ranged");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, FavSchematicCount) == 0x000000, "Member 'WeaponSmithBoard_C_Populate_Ranged::FavSchematicCount' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Variable) == 0x000004, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_bool_Variable) == 0x000008, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Variable1) == 0x00000C, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_bool_Variable1) == 0x000010, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Variable2) == 0x000014, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Variable3) == 0x000020, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_GetAccountItemsByType_Items) == 0x000028, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_GetAccountItemsByType_Items' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_bool_True_if_break_was_hit_Variable) == 0x000045, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Array_Get_Item) == 0x000050, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000058, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1) == 0x000070, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess1) == 0x000080, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000081, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_HasMatchingGameplayTag_ReturnValue1) == 0x000082, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_HasMatchingGameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2) == 0x000088, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess2) == 0x000098, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x000099, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface3) == 0x0000A0, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess3) == 0x0000B0, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_HasMatchingGameplayTag_ReturnValue3) == 0x0000B1, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_HasMatchingGameplayTag_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface4) == 0x0000B8, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess4) == 0x0000C8, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsFort_Schematic_Item) == 0x0000D0, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsFort_Schematic_Item' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess5) == 0x0000D8, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_HasMatchingGameplayTag_ReturnValue4) == 0x0000D9, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_HasMatchingGameplayTag_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsFort_Schematic_Item1) == 0x0000E0, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsFort_Schematic_Item1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess6) == 0x0000E8, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsFort_Schematic_Item2) == 0x0000F0, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsFort_Schematic_Item2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess7) == 0x0000F8, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsFort_Schematic_Item3) == 0x000100, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsFort_Schematic_Item3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess8) == 0x000108, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_AsFort_Schematic_Item4) == 0x000110, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_AsFort_Schematic_Item4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, K2Node_DynamicCast_bSuccess9) == 0x000118, "Member 'WeaponSmithBoard_C_Populate_Ranged::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_bool_Variable2) == 0x00011B, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_int_Variable4) == 0x00011C, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000120, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Add_IntInt_ReturnValue1) == 0x000124, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Add_IntInt_ReturnValue2) == 0x000128, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Add_IntInt_ReturnValue3) == 0x00012C, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Add_IntInt_ReturnValue4) == 0x000130, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, CallFunc_Add_IntInt_ReturnValue5) == 0x000134, "Member 'WeaponSmithBoard_C_Populate_Ranged::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_bool_Variable3) == 0x000138, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Ranged, Temp_bool_Variable4) == 0x000139, "Member 'WeaponSmithBoard_C_Populate_Ranged::Temp_bool_Variable4' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.Populate Skeletal Mesh Slots
// 0x0050 (0x0050 - 0x0000)
struct WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots final
{
public:
	class UFortWeaponItemDefinition*              CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetWeaponMeshOverride_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetWeaponMeshOverride_ReturnValue1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue2; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue3; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetWeaponMeshOverride_ReturnValue2;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetWeaponMeshOverride_ReturnValue3;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue4; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetWeaponMeshOverride_ReturnValue4;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots) == 0x000008, "Wrong alignment on WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots");
static_assert(sizeof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots) == 0x000050, "Wrong size on WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue) == 0x000000, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue1) == 0x000008, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetWeaponMeshOverride_ReturnValue) == 0x000010, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetWeaponMeshOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetWeaponMeshOverride_ReturnValue1) == 0x000018, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetWeaponMeshOverride_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue2) == 0x000020, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue3) == 0x000028, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetWeaponMeshOverride_ReturnValue2) == 0x000030, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetWeaponMeshOverride_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetWeaponMeshOverride_ReturnValue3) == 0x000038, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetWeaponMeshOverride_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue4) == 0x000040, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetSchematicCraftingResultOrCraftedWeaponBP_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots, CallFunc_GetWeaponMeshOverride_ReturnValue4) == 0x000048, "Member 'WeaponSmithBoard_C_Populate_Skeletal_Mesh_Slots::CallFunc_GetWeaponMeshOverride_ReturnValue4' has a wrong offset!");

// Function WeaponSmithBoard.WeaponSmithBoard_C.PopulateSceneWithBestRangedWeaponSchematics
// 0x0A30 (0x0A30 - 0x0000)
struct WeaponSmithBoard_C_PopulateSceneWithBestRangedWeaponSchematics final
{
public:
	struct FTransform                             RocketLauncherMinusTransform;                      // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             ShotgunMinusTransform;                             // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             PistolMinusTransform;                              // 0x0060(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             SniperMinusTransform;                              // 0x0090(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             AssaultMinusTransform;                             // 0x00C0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	TArray<class UFortAccountItem*>               RangedWeaponAccountItems;                          // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UFortSchematicItem*>             SchematicWpnArray;                                 // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class FText>                           WpnTypes;                                          // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0184(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult1;  // 0x0210(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult2;  // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult3;  // 0x0328(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult4;  // 0x03B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult5;  // 0x0438(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByFilterType_OutItemList;  // 0x04D0(0x0010)(ZeroConstructor, ReferenceParm)
