#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponCalloutStatWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WeaponCalloutStatWidget.WeaponCalloutStatWidget_C.ExecuteUbergraph_WeaponCalloutStatWidget
// 0x0028 (0x0028 - 0x0000)
struct WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaBaseStatView*                    CallFunc_GetBaseStatView_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMatchStatView*                   K2Node_DynamicCast_AsAthena_Match_Stat_View;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaWeaponStatView*                  CallFunc_GetWeaponViewHighestStat_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget) == 0x000008, "Wrong alignment on WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget");
static_assert(sizeof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget) == 0x000028, "Wrong size on WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget");
static_assert(offsetof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget, EntryPoint) == 0x000000, "Member 'WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget, CallFunc_GetBaseStatView_ReturnValue) == 0x000008, "Member 'WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget::CallFunc_GetBaseStatView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget, K2Node_DynamicCast_AsAthena_Match_Stat_View) == 0x000010, "Member 'WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget::K2Node_DynamicCast_AsAthena_Match_Stat_View' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget, CallFunc_GetWeaponViewHighestStat_ReturnValue) == 0x000020, "Member 'WeaponCalloutStatWidget_C_ExecuteUbergraph_WeaponCalloutStatWidget::CallFunc_GetWeaponViewHighestStat_ReturnValue' has a wrong offset!");

// Function WeaponCalloutStatWidget.WeaponCalloutStatWidget_C.Update
// 0x01F0 (0x01F0 - 0x0000)
struct WeaponCalloutStatWidget_C_Update final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUIStatStyle                       CallFunc_GetStatStyle_ReturnValue;                 // 0x0008(0x00C0)(ConstParm)
	class UAthenaBaseStatView*                    CallFunc_GetBaseStatView_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStat_ReturnValue;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaWeaponStatView*                  K2Node_DynamicCast_AsAthena_Weapon_Stat_View;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponDefinition_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0100(0x0080)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0180(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0198(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01B0(0x0028)()
	class FText                                   CallFunc_TextToUpper_ReturnValue1;                 // 0x01D8(0x0018)()
};
static_assert(alignof(WeaponCalloutStatWidget_C_Update) == 0x000008, "Wrong alignment on WeaponCalloutStatWidget_C_Update");
static_assert(sizeof(WeaponCalloutStatWidget_C_Update) == 0x0001F0, "Wrong size on WeaponCalloutStatWidget_C_Update");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetStatStyle_ReturnValue) == 0x000008, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetStatStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetBaseStatView_ReturnValue) == 0x0000C8, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetBaseStatView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetStat_ReturnValue) == 0x0000D0, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, K2Node_DynamicCast_AsAthena_Weapon_Stat_View) == 0x0000D8, "Member 'WeaponCalloutStatWidget_C_Update::K2Node_DynamicCast_AsAthena_Weapon_Stat_View' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WeaponCalloutStatWidget_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetWeaponDefinition_ReturnValue) == 0x0000E8, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetWeaponDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x0000F0, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetRarity_ReturnValue) == 0x0000F8, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_BPGetRarityData_ReturnValue) == 0x000100, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_GetDisplayName_ReturnValue) == 0x000180, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_TextToUpper_ReturnValue) == 0x000198, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, K2Node_MakeStruct_SlateColor) == 0x0001B0, "Member 'WeaponCalloutStatWidget_C_Update::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WeaponCalloutStatWidget_C_Update, CallFunc_TextToUpper_ReturnValue1) == 0x0001D8, "Member 'WeaponCalloutStatWidget_C_Update::CallFunc_TextToUpper_ReturnValue1' has a wrong offset!");

}

