#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponCalloutStatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponCalloutStatWidget.WeaponCalloutStatWidget_C
// 0x0038 (0x0280 - 0x0248)
class UWeaponCalloutStatWidget_C final : public UAthenaProfileStatWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RarityLineRule;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RarityTextBlock;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatName;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                StatValue;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WeaponCard;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WeaponName;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WeaponCalloutStatWidget(int32 EntryPoint);
	void OnStatChanged();
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponCalloutStatWidget_C">();
	}
	static class UWeaponCalloutStatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponCalloutStatWidget_C>();
	}
};
static_assert(alignof(UWeaponCalloutStatWidget_C) == 0x000008, "Wrong alignment on UWeaponCalloutStatWidget_C");
static_assert(sizeof(UWeaponCalloutStatWidget_C) == 0x000280, "Wrong size on UWeaponCalloutStatWidget_C");
static_assert(offsetof(UWeaponCalloutStatWidget_C, UberGraphFrame) == 0x000248, "Member 'UWeaponCalloutStatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponCalloutStatWidget_C, RarityLineRule) == 0x000250, "Member 'UWeaponCalloutStatWidget_C::RarityLineRule' has a wrong offset!");
static_assert(offsetof(UWeaponCalloutStatWidget_C, RarityTextBlock) == 0x000258, "Member 'UWeaponCalloutStatWidget_C::RarityTextBlock' has a wrong offset!");
static_assert(offsetof(UWeaponCalloutStatWidget_C, StatName) == 0x000260, "Member 'UWeaponCalloutStatWidget_C::StatName' has a wrong offset!");
static_assert(offsetof(UWeaponCalloutStatWidget_C, StatValue) == 0x000268, "Member 'UWeaponCalloutStatWidget_C::StatValue' has a wrong offset!");
static_assert(offsetof(UWeaponCalloutStatWidget_C, WeaponCard) == 0x000270, "Member 'UWeaponCalloutStatWidget_C::WeaponCard' has a wrong offset!");
static_assert(offsetof(UWeaponCalloutStatWidget_C, WeaponName) == 0x000278, "Member 'UWeaponCalloutStatWidget_C::WeaponName' has a wrong offset!");

}

