#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSummaryListEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponSummaryListEntryWidget.WeaponSummaryListEntryWidget_C
// 0x0048 (0x0B88 - 0x0B40)
class UWeaponSummaryListEntryWidget_C final : public UAthenaProfileStatListWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RarityLineRule;                                    // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RarityTextBlock;                                   // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USmallStatRowWidget_C*                  Stat1;                                             // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USmallStatRowWidget_C*                  Stat2;                                             // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USmallStatRowWidget_C*                  Stat3;                                             // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USmallStatRowWidget_C*                  Stat4;                                             // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WeaponCard;                                        // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       WeaponName;                                        // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WeaponSummaryListEntryWidget(int32 EntryPoint);
	void OnStatChanged();
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponSummaryListEntryWidget_C">();
	}
	static class UWeaponSummaryListEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponSummaryListEntryWidget_C>();
	}
};
static_assert(alignof(UWeaponSummaryListEntryWidget_C) == 0x000008, "Wrong alignment on UWeaponSummaryListEntryWidget_C");
static_assert(sizeof(UWeaponSummaryListEntryWidget_C) == 0x000B88, "Wrong size on UWeaponSummaryListEntryWidget_C");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, UberGraphFrame) == 0x000B40, "Member 'UWeaponSummaryListEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, RarityLineRule) == 0x000B48, "Member 'UWeaponSummaryListEntryWidget_C::RarityLineRule' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, RarityTextBlock) == 0x000B50, "Member 'UWeaponSummaryListEntryWidget_C::RarityTextBlock' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, Stat1) == 0x000B58, "Member 'UWeaponSummaryListEntryWidget_C::Stat1' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, Stat2) == 0x000B60, "Member 'UWeaponSummaryListEntryWidget_C::Stat2' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, Stat3) == 0x000B68, "Member 'UWeaponSummaryListEntryWidget_C::Stat3' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, Stat4) == 0x000B70, "Member 'UWeaponSummaryListEntryWidget_C::Stat4' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, WeaponCard) == 0x000B78, "Member 'UWeaponSummaryListEntryWidget_C::WeaponCard' has a wrong offset!");
static_assert(offsetof(UWeaponSummaryListEntryWidget_C, WeaponName) == 0x000B80, "Member 'UWeaponSummaryListEntryWidget_C::WeaponName' has a wrong offset!");

}

