#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_Lights

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WM_Lights.WM_Lights_C
// 0x0030 (0x0360 - 0x0330)
class AWM_Lights_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WM_Lights(int32 EntryPoint);
	void WMMinusLightcontrol(bool TurnOn);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WM_Lights_C">();
	}
	static class AWM_Lights_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWM_Lights_C>();
	}
};
static_assert(alignof(AWM_Lights_C) == 0x000008, "Wrong alignment on AWM_Lights_C");
static_assert(sizeof(AWM_Lights_C) == 0x000360, "Wrong size on AWM_Lights_C");
static_assert(offsetof(AWM_Lights_C, UberGraphFrame) == 0x000330, "Member 'AWM_Lights_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, Arrow) == 0x000338, "Member 'AWM_Lights_C::Arrow' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, DirectionalLight) == 0x000340, "Member 'AWM_Lights_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, SkyLight) == 0x000348, "Member 'AWM_Lights_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, PointLight1) == 0x000350, "Member 'AWM_Lights_C::PointLight1' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, DefaultSceneRoot) == 0x000358, "Member 'AWM_Lights_C::DefaultSceneRoot' has a wrong offset!");

}

