#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkerBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WorkerBoard.WorkerBoard_C
// 0x0090 (0x03C0 - 0x0330)
class AWorkerBoard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_BoardSupport;                                   // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_08;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_07;                                       // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_06;                                       // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Prop_Mansion_Painting_Ornate_01_Searched;          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_01;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_04;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_05;                                       // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_03;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Survivor_02;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HR_Board;                                          // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           SurvivorMinusGeom;                                 // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortAccountItem*>               SurvivorItems;                                     // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortQuestItemDefinition*               QuestToShow;                                       // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WorkerBoard(int32 EntryPoint);
	void CameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void ReceiveBeginPlay();
	void PopulateSuvivorsBoard();
	void UserConstructionScript();
	void PopulateSurivorArt();
	void UpdateVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorkerBoard_C">();
	}
	static class AWorkerBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWorkerBoard_C>();
	}
};
static_assert(alignof(AWorkerBoard_C) == 0x000008, "Wrong alignment on AWorkerBoard_C");
static_assert(sizeof(AWorkerBoard_C) == 0x0003C0, "Wrong size on AWorkerBoard_C");
static_assert(offsetof(AWorkerBoard_C, UberGraphFrame) == 0x000330, "Member 'AWorkerBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, SM_BoardSupport) == 0x000338, "Member 'AWorkerBoard_C::SM_BoardSupport' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_08) == 0x000340, "Member 'AWorkerBoard_C::Survivor_08' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_07) == 0x000348, "Member 'AWorkerBoard_C::Survivor_07' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_06) == 0x000350, "Member 'AWorkerBoard_C::Survivor_06' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Prop_Mansion_Painting_Ornate_01_Searched) == 0x000358, "Member 'AWorkerBoard_C::Prop_Mansion_Painting_Ornate_01_Searched' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_01) == 0x000360, "Member 'AWorkerBoard_C::Survivor_01' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_04) == 0x000368, "Member 'AWorkerBoard_C::Survivor_04' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_05) == 0x000370, "Member 'AWorkerBoard_C::Survivor_05' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_03) == 0x000378, "Member 'AWorkerBoard_C::Survivor_03' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, Survivor_02) == 0x000380, "Member 'AWorkerBoard_C::Survivor_02' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, HR_Board) == 0x000388, "Member 'AWorkerBoard_C::HR_Board' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, DefaultSceneRoot) == 0x000390, "Member 'AWorkerBoard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, SurvivorMinusGeom) == 0x000398, "Member 'AWorkerBoard_C::SurvivorMinusGeom' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, SurvivorItems) == 0x0003A8, "Member 'AWorkerBoard_C::SurvivorItems' has a wrong offset!");
static_assert(offsetof(AWorkerBoard_C, QuestToShow) == 0x0003B8, "Member 'AWorkerBoard_C::QuestToShow' has a wrong offset!");

}

