#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorkerBoard

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function WorkerBoard.WorkerBoard_C.ExecuteUbergraph_WorkerBoard
// 0x0050 (0x0050 - 0x0000)
struct WorkerBoard_C_ExecuteUbergraph_WorkerBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue1;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard) == 0x000008, "Wrong alignment on WorkerBoard_C_ExecuteUbergraph_WorkerBoard");
static_assert(sizeof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard) == 0x000050, "Wrong size on WorkerBoard_C_ExecuteUbergraph_WorkerBoard");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, EntryPoint) == 0x000000, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, K2Node_CustomEvent_NewCamera) == 0x000028, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::K2Node_CustomEvent_NewCamera' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, K2Node_CustomEvent_OldCamera) == 0x000029, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::K2Node_CustomEvent_OldCamera' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, CallFunc_GetContext_ReturnValue1) == 0x000030, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::CallFunc_GetContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_ExecuteUbergraph_WorkerBoard, CallFunc_HasCompletedQuest_ReturnValue) == 0x000048, "Member 'WorkerBoard_C_ExecuteUbergraph_WorkerBoard::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");

// Function WorkerBoard.WorkerBoard_C.CameraChanged
// 0x0002 (0x0002 - 0x0000)
struct WorkerBoard_C_CameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorkerBoard_C_CameraChanged) == 0x000001, "Wrong alignment on WorkerBoard_C_CameraChanged");
static_assert(sizeof(WorkerBoard_C_CameraChanged) == 0x000002, "Wrong size on WorkerBoard_C_CameraChanged");
static_assert(offsetof(WorkerBoard_C_CameraChanged, NewCamera) == 0x000000, "Member 'WorkerBoard_C_CameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_CameraChanged, OldCamera) == 0x000001, "Member 'WorkerBoard_C_CameraChanged::OldCamera' has a wrong offset!");

// Function WorkerBoard.WorkerBoard_C.PopulateSurivorArt
// 0x00B0 (0x00B0 - 0x0000)
struct WorkerBoard_C_PopulateSurivorArt final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByFilterType_OutItemList;  // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortAccountItem*                       CallFunc_Array_Get_Item1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue;         // 0x0060(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WorkerBoard_C_PopulateSurivorArt) == 0x000008, "Wrong alignment on WorkerBoard_C_PopulateSurivorArt");
static_assert(sizeof(WorkerBoard_C_PopulateSurivorArt) == 0x0000B0, "Wrong size on WorkerBoard_C_PopulateSurivorArt");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'WorkerBoard_C_PopulateSurivorArt::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WorkerBoard_C_PopulateSurivorArt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WorkerBoard_C_PopulateSurivorArt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Array_Get_Item) == 0x000010, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_GetMaterial_ReturnValue) == 0x000020, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_GetAccountItemsByFilterType_OutItemList) == 0x000040, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_GetAccountItemsByFilterType_OutItemList' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Array_Get_Item1) == 0x000050, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_GetLargePreviewImage_ReturnValue) == 0x000060, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_GetLargePreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000088, "Member 'WorkerBoard_C_PopulateSurivorArt::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, K2Node_DynamicCast_AsTexture_2D) == 0x000090, "Member 'WorkerBoard_C_PopulateSurivorArt::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WorkerBoard_C_PopulateSurivorArt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_PopulateSurivorArt, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WorkerBoard_C_PopulateSurivorArt::K2Node_MakeArray_Array' has a wrong offset!");

// Function WorkerBoard.WorkerBoard_C.UpdateVisibility
// 0x0020 (0x0020 - 0x0000)
struct WorkerBoard_C_UpdateVisibility final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorkerBoard_C_UpdateVisibility) == 0x000008, "Wrong alignment on WorkerBoard_C_UpdateVisibility");
static_assert(sizeof(WorkerBoard_C_UpdateVisibility) == 0x000020, "Wrong size on WorkerBoard_C_UpdateVisibility");
static_assert(offsetof(WorkerBoard_C_UpdateVisibility, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'WorkerBoard_C_UpdateVisibility::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_UpdateVisibility, CallFunc_GetQuestManager_ReturnValue) == 0x000008, "Member 'WorkerBoard_C_UpdateVisibility::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_UpdateVisibility, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000010, "Member 'WorkerBoard_C_UpdateVisibility::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_UpdateVisibility, CallFunc_HasCompletedQuest_ReturnValue) == 0x000018, "Member 'WorkerBoard_C_UpdateVisibility::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorkerBoard_C_UpdateVisibility, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WorkerBoard_C_UpdateVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

